{
  "paper_id": "http://arxiv.org/abs/2505.24784v1",
  "extraction_timestamp": "2025-06-03 02:41:24.071457",
  "extraction_version": "1.0",
  "key_findings": [
    "AXIOM is a novel object-centric active inference agent that learns to model scenes as compositions of objects with piecewise linear trajectories capturing sparse object-object interactions.",
    "The model structure is expanded online by growing and learning mixture models from single events, and periodically refined through Bayesian model reduction to induce generalization.",
    "AXIOM masters various games within only 10,000 interaction steps, with a small number of parameters compared to deep reinforcement learning methods, and without the computational expense of gradient-based optimization.",
    "The approach combines the data efficiency and interpretability of Bayesian approaches with the cross-task generalization capability typically associated with deep reinforcement learning.",
    "AXIOM outperforms state-of-the-art deep learning methods in terms of both sample efficiency and absolute performance, with its online learning scheme showing robustness to environmental perturbations."
  ],
  "main_contribution": "The paper introduces AXIOM, a novel object-centric active inference agent that integrates a minimal set of core priors about object-centric dynamics and interactions to accelerate learning in low-d...",
  "limitations": [],
  "future_work": [],
  "study_type": "empirical",
  "industry_applications": [],
  "techniques_used": [],
  "implementation_complexity": "medium",
  "resource_requirements": {
    "team_size": "small_team",
    "estimated_time_weeks": 8,
    "compute_requirements": "",
    "data_requirements": "",
    "budget_tier": null,
    "special_hardware": [],
    "cloud_services": []
  },
  "success_metrics": [],
  "problem_addressed": "Achieving sample-efficient learning in environments with objects and sparse interactions, while maintaining interpretability and cross-task generalization.",
  "prerequisites": [],
  "comparable_approaches": [],
  "real_world_applications": [],
  "evidence_strength": 0.8,
  "practical_applicability": 0.7,
  "extraction_confidence": 0.8,
  "has_code_available": false,
  "has_dataset_available": false,
  "reproducibility_score": null,
  "industry_validation": false
}