{
  "paper_id": "http://arxiv.org/abs/2505.24876v1",
  "extraction_timestamp": "2025-06-04 03:12:59.802558",
  "extraction_version": "1.0",
  "key_findings": [
    "Deep reasoning is fundamental for solving complex tasks, especially in\nvision-centric scenarios that demand sequential, multimodal understanding.\nHowever, existing benchmarks typically evaluate agents with fully synthetic,\nsingle-turn queries, limited visual modalities, and lack a framework to assess\nreasoning quality over multiple steps as required in real-world settings. To\naddress this, we introduce Agent-X, a large-scale benchmark for evaluating\nvision-centric agents multi-step and deep reasoning capabilities in real-world,\nmultimodal settings. Agent- X features 828 agentic tasks with authentic visual\ncontexts, including images, multi-image comparisons, videos, and instructional\ntext. These tasks span six major agentic environments: general visual\nreasoning, web browsing, security and surveillance, autonomous driving, sports,\nand math reasoning. Our benchmark requires agents to integrate tool use with\nexplicit, stepwise decision-making in these diverse settings.",
    "In addition, we\npropose a fine-grained, step-level evaluation framework that assesses the\ncorrectness and logical coherence of each reasoning step and the effectiveness\nof tool usage throughout the task.",
    "Our results reveal that even the\nbest-performing models, including GPT, Gemini, and Qwen families, struggle to\nsolve multi-step vision tasks, achieving less than 50% full-chain success.\nThese findings highlight key bottlenecks in current LMM reasoning and tool-use\ncapabilities and identify future research directions in vision-centric agentic\nreasoning models. Our data and code are publicly available at\nhttps://github.com/mbzuai-oryx/Agent-X."
  ],
  "limitations": [
    "Full text not analyzed",
    "Detailed methodology not available"
  ],
  "future_work": [],
  "study_type": "unknown",
  "techniques_used": [],
  "implementation_complexity": "unknown",
  "resource_requirements": {
    "compute_requirements": null,
    "data_requirements": null,
    "budget_tier": null,
    "special_hardware": [],
    "cloud_services": []
  },
  "success_metrics": [],
  "problem_addressed": "",
  "prerequisites": [],
  "comparable_approaches": [],
  "real_world_applications": [],
  "evidence_strength": 0.3,
  "practical_applicability": 0.3,
  "extraction_confidence": 0.4,
  "has_code_available": false,
  "has_dataset_available": false,
  "reproducibility_score": null,
  "industry_validation": false
}