{
  "paper_id": "http://arxiv.org/abs/2506.03123v1",
  "extraction_timestamp": "2025-06-04 19:11:33.170897",
  "extraction_version": "1.0",
  "key_findings": [
    "Diffusion Models have achieved remarkable results in video synthesis but\nrequire iterative denoising steps, leading to substantial computational\noverhead. Consistency Models have made significant progress in accelerating\ndiffusion models.",
    "However, directly applying them to video diffusion models\noften results in severe degradation of temporal consistency and appearance\ndetails. In this paper, by analyzing the training dynamics of Consistency\nModels, we identify a key conflicting learning dynamics during the distillation\nprocess: there is a significant discrepancy in the optimization gradients and\nloss contributions across different timesteps. This discrepancy prevents the\ndistilled student model from achieving an optimal state, leading to compromised\ntemporal consistency and degraded appearance details.",
    "To address this issue, we\npropose a parameter-efficient \\textbf{Dual-Expert Consistency Model~(DCM)},\nwhere a semantic expert focuses on learning semantic layout and motion, while a\ndetail expert specializes in fine detail refinement.",
    "Furthermore, we introduce\nTemporal Coherence Loss to improve motion consistency for the semantic expert\nand apply GAN and Feature Matching Loss to enhance the synthesis quality of the\ndetail expert.Our approach achieves state-of-the-art visual quality with\nsignificantly reduced sampling steps, demonstrating the effectiveness of expert\nspecialization in video diffusion model distillation. Our code and models are\navailable at\n\\href{https://github.com/Vchitect/DCM}{https://github.com/Vchitect/DCM}."
  ],
  "limitations": [
    "Full text not analyzed",
    "Detailed methodology not available"
  ],
  "future_work": [],
  "study_type": "unknown",
  "techniques_used": [],
  "implementation_complexity": "unknown",
  "resource_requirements": {
    "compute_requirements": null,
    "data_requirements": null,
    "budget_tier": null,
    "special_hardware": [],
    "cloud_services": []
  },
  "success_metrics": [],
  "problem_addressed": "",
  "prerequisites": [],
  "comparable_approaches": [],
  "real_world_applications": [],
  "evidence_strength": 0.3,
  "practical_applicability": 0.3,
  "extraction_confidence": 0.4,
  "has_code_available": false,
  "has_dataset_available": false,
  "reproducibility_score": null,
  "industry_validation": false
}