{
  "id": "http://arxiv.org/abs/2505.24767v1",
  "title": "A survey of using EHR as real-world evidence for discovering and\n  validating new drug indications",
  "summary": "Electronic Health Records (EHRs) have been increasingly used as real-world\nevidence (RWE) to support the discovery and validation of new drug indications.\nThis paper surveys current approaches to EHR-based drug repurposing, covering\ndata sources, processing methodologies, and representation techniques. It\ndiscusses study designs and statistical frameworks for evaluating drug\nefficacy. Key challenges in validation are discussed, with emphasis on the role\nof large language models (LLMs) and target trial emulation. By synthesizing\nrecent developments and methodological advances, this work provides a\nfoundational resource for researchers aiming to translate real-world data into\nactionable drug-repurposing evidence.",
  "authors": [
    "Nabasmita Talukdar",
    "Xiaodan Zhang",
    "Shreya Paithankar",
    "Hui Wang",
    "Bin Chen"
  ],
  "published": "2025-05-30T16:30:54Z",
  "updated": "2025-05-30T16:30:54Z",
  "categories": [
    "stat.AP",
    "cs.AI"
  ],
  "pdf_url": "http://arxiv.org/pdf/2505.24767v1",
  "full_text": "A survey of using EHR as real-world evidence for discovering and validating new drug indications Nabasmita Talukdar a, Xiaodan Zhang b, Shreya Paithankar b, Hui Wang e, Bin Chen a,b,c,d a Department of Biostatistics & Epidemiology, Michigan State University, East Lansing, Michigan USA b Department of Pediatrics and Human Development, Michigan State University, Grand Rapids, Michigan USA c Department of Pharmacology and Toxicology, Michigan State University, Grand Rapids, Michigan USA d Center for AI-Enabled Drug Discovery, Michigan State University, Grand Rapids, Michigan USA e Lumbrita LLC, Saratoga, California, USA Corresponding Author: Bin Chen (chenbi12@msu.edu) Abstract Electronic Health Records (EHRs) have been increasingly used as real-world evidence (RWE) to support the discovery and validation of new drug indications. This paper surveys current approaches to EHR-based drug repurposing, covering data sources, processing methodologies, and representation techniques. It discusses study designs and statistical frameworks for evaluating drug efficacy. Key challenges in validation are discussed, with emphasis on the role of large language models (LLMs) and target trial emulation. By synthesizing recent developments and methodological advances, this work provides a foundational resource for researchers aiming to translate real-world data into actionable drug-repurposing evidence. Introduction Drug Discovery is expensive and time-consuming, with average costs amounting to $2-3 billion and requiring 13-15 years of development1. In contrast, drug repurposing (or repositioning), discovering new indications for existing drugs, has received considerable attention. Repurposing drugs often have well-studied safety and toxicity profiles, making the process more cost-effective and efficient. Emerging computational and experimental approaches at the preclinical stage have identified numerous potential drug-disease pairs2,3. However, translating these into clinical practice requires real-world evidence (RWE) to ensure the repurposed drug's effectiveness and acceptable safety4. Although randomized controlled trials (RCTs) are the gold standard for confirming drug efficacy and safety, they are costly, slow, and lack generalizability due to strict criteria and controlled settings5. Consequently, RCTs contribute to only 10-20% of clinical decision-making, highlighting the need to utilize RWD as supporting evidence6. With the emergence of large-scale Electronic Health Records (EHRs), retrospective validation of repurposing candidates has become increasingly feasible7. This is especially important for diseases like Alzheimer’s Disease (AD) and COVID-19, where available animal models fail to replicate biology fully. Moreover, many patients present with comorbidities that preclinical models cannot replicate, further underscoring the value of EHRs for drug validation. The recent repurposing of GLP-1 agonists beyond diabetes highlights the role of EHR in identifying new indications8,9. While EHR-based drug validation offers major opportunities, it also faces notable challenges. Firstly, EHRs were initially designed for administrative and billing purposes rather than research, leading to variability across institutions in how health records are defined and recorded. This lack of standardization hinders interoperability and complicates the integration and analysis of data across diverse systems. Moreover, many institutes also lack research-ready databases, often requiring significant effort to build custom datasets. Several factors impact the quality of EHR-based analytics, including data completeness, quality, and cohort size. Low-quality data can introduce biases and reduce the reliability of validation studies. Small patient cohorts limit the statistical power, while unknown confounders may produce false associations. Confirming findings typically requires costly prospective trials, leaving many promising repurposing drugs remain unvalidated. For instance, over 500 drugs have been proposed for AD repurposing in the past decade, yet only 4% have undergone further RWD validation10. Despite these challenges, EHRs have unveiled new opportunities to advance the field. The emergence of LLMs and emulation studies also provide new ways for analyzing EHR data and evaluating drug efficacy. This paper reviews commonly used EHR databases, validation techniques, recent advances, and case studies (Fig 1), with a highlight of the potential of LLMs and emulation in drug repurposing. We aim for this survey to serve as a comprehensive resource for researchers seeking a deeper understanding of computational drug repurposing validation using RWD. Literature Search The literature review followed a structured approach using platforms such as Google Scholar and PubMed. Initial keyword searches (e.g., “Drug Repurposing,” “Observational Studies,” “Real-World Data”) identified relevant papers, followed by a manual review to select those specifically focused on RWD and drug repurposing. Additional studies were sourced through reference lists and iterative searches targeting key aspects of the computational pipeline, including data sources, mining methods, statistical analyses, and selected applications in AD, COVID-19 and cancer. Due to the wide coverage of the field, not all relevant studies could be included. (A) (B) Figure 1: Overview of Survey paper (A) A hierarchical representation of key techniques covered in this paper, outlining the essential steps in drug repurposing using EHR/RWD. (B) Key topics discussed in the paper, include the comparison of RCTs vs emulation trials using RWD for decision-making, recent advancements in drug repurposing, and emerging opportunities and challenges. Data Sources Healthcare providers, such as hospitals, outpatient care centers, rehabilitation centers, insurance companies, laboratories, public health agencies, mental health facilities, and aged care facilities, routinely record patient data digitally during each encounter11. EHRs contain a wide range of patient information, including demographics (e.g., age, race, gender, etc.), healthcare encounters, lab results, vital signs, medication prescriptions and dispensing, diagnosis and procedure codes, socio-economic and lifestyle factors, clinical notes (e.g., visit summaries, pathology reports), and imaging data. They also inherently capture temporal data, which is critical for analyzing long-term treatment effects and disease progression. The widespread availability, large sample sizes, and comprehensive socio-demographic data collectively make EHRs a valuable resource for validating drug repurposing candidates. Table 1 summarized a list of commonly used EHR databases available in the U.S., detailing each database type, modality, population coverage, time span, and accessibility. This comparative analysis enables researchers to identify the most suitable databases for drug repurposing validation. Supplementary Table 1 includes references to example studies that have utilized these databases for validation efforts. Table 1: Comparative overview of primary EHR sources for drug repurposing studies available in U.S., listed alphabetically. Database Type Modality Coverage Access a All of US Research Program dataset Consortium Research EHR, Genomic Data, Surveys, Physical Measurements, Wearable Devices, SDoH As of April 10, 2025, over 848,000+ participants have enrolled with 470,000+ Electronic Health Records12. Available to approved U.S. researchers Cerner Real-World Data (CRWD) Commercial Research EHR 100M+ patient data over 100 healthcare systems across U.S. Initiated in 201913. Available to U.S. researchers after study approval EPIC Cosmos Consortium Research EHR, SDoH, Billing Codes, Linked Parent-Child data14. 217M+ Patients records as of 2023, 1,699 Hospitals, launched in 201815. Restricted to institutional users, and collaborator Flatiron Health Database16 Commercial EHR (including Clinical Notes, Oncology-specific Data) 4 million longitudinal cancer patients from >280 clinics in U.S.17 Licensing and partnership agreement for US researchers Geisinger Refresh18 Commercial Research EHR, Claims & Billing 1.5M+ outpatient data, time coverage of the database spans from 2001 to the present. Restricted HealthVerity Database Commercial Research Linked EMR and claims data. 200M+ patient journeys, 8 years of average data19. Commercially Available IBM Explorys Commercial EHR, Operational data b 63M+ patient’s data from a network of 26 leading healthcare, with an average of 3-4 years per patient. Time coverage – since 199520. Commercially Available IBM MarketScan (earlier known as Truven) Commercial Billing, Claims, Carve-out Services, Demographics Over 250 million patients since 1995. Contains data for patients with continuous insurance enrollment21. Commercially Available Mayo Clinic Platform_Discover22 Institutional EHR, Clinical Notes, Imaging, Radiology Reports 13.6M patients records from Mayo Clinic, including 1.3B+ images, 1.6B lab test results, 10.1M pathology reports, and 698M clinical notes. Restricted to institutional users Mount Sinai Data Warehouse Data Institutional EHR, Clinical and Genetic Research Data 12M+ patient records, most of the data comes from the Epic Clarity and Caboodle databases23. Restricted to institutional users OneFlorida+ Data Trust Consortium Research EHR, Tumor registry, Death and Claims Data24 17M patient’s data, for patients enrolled in Medicaid and from public and private health care systems throughout Florida, Georgia, Alabama25. Restricted to institutional users, and collaborator Oracle Database Commercial EHR, Billing, Operational, Clinical Notes, SDoH 108M patients from 100+ healthcare systems across the US, average patient observation period of 7.6 years26. Commercially Available Premier Health Database27 Commercial Research Hospital-Based, Service-Level, All-Payer. 244M+ unique patients, Time coverage from 2000 to present, 1400 hospitals and healthcare systems. Commercially Available The UK Clinical Practice Research Datalink Consortium Research EHR, Lifestyle, Clinical notes 60M+ patients from over 674 customary practices across the UK, since 198728. Globally accessible TriNetX Datasets Commercial Research EHR, Claims, Mortality and Genomic data 275M+ patients, 70B+ patient specific data on clinical observation spanning around 19 countries29. Licensing and partnership agreement Truveta Data30 Commercial Research EHR, SDOH, Claims, Mortality, Clinical Notes, Imaging. 100M+ patient lives, 8 years of patient history, 5B+ Clinical notes. Licensing and partnership agreement for US researchers UCSF (University of California San Francisco) Clinical Data Institutional EHR, Geocoded address data, California Death Registry data, Images, Clinical notes 6.4M+ patient record. STOR, APeX and Benioff Children’s Hospital Oakland data dating back to 1988, 2012 and 2020 respectively31. Restricted to institutional users Optum Market Clarity data Commercial Research EHR, Claims, Clinic genomics 100M+ unique patient, 4.5B+ free-text medical notes32 Licensing and partnership agreement for US researchers Vanderbilt University Medical Center (VUMC) Institutional EHR, Genetic Data (BioVU), Clinical notes. 2.5M+ patients record, within Vanderbilt Health Synthetic Derivative (SD), dating back to the early 1990s, and over 15 years of longitudinal data33. Restricted to institutional users, and collaborator a. For more details on the accessibility, refer to Supplementary Table 2 b. The patient journey, provider prescribing patterns, disease progression, procedure volumes, and the overall delivery of care are recorded. In addition, research networks have also been formed to aggregate EHRs across institutes. For instance, the Patient-Centered Outcomes Research Network (PCORnet) supports clinical research via two Health Plan and nine Clinical Research Networks, with EHR data from 80 million individuals and claims from 60 million (as of 2020)34. The Electronic Medical Records and Genomics (eMERGE) network, launched in 2007, integrates DNA biorepositories with EHRs across 10 sites, covering over 105,000 participants35,36. The National COVID Cohort Collaborative (N3C) harmonizes EHR data from multiple U.S. sources, with over 15 million patients, including 5.8 million COVID-19 positive cases (as of July 2022)37,38. The Rare Disease Clinical Research Network (RDCRN) focuses on rare diseases, including over 56,000 participants across nearly 200 conditions nationwide39,40. Lastly, many databases, though not constituting EHRs, provide valuable information when linked with EHR databases. For example, DrugBank provides detailed molecular and biological information about pharmaceutical drugs. Medication Indication (MEDI) links drugs with their indications and can be used for preliminary information during the validation process or to extract information regarding medication use and their respective indications for all the subjects. SIDER, a public drug side effect database curating 5,868 side effects for 1,430 drugs or therapies, can be combined with EHR databases for comprehensive side effect studies. FDA Adverse Event Reporting System (FAERS) is a post-marketing safety surveillance program for approved drugs containing information related to drug adverse events submitted by manufacturers, healthcare professionals, and the public. The Surveillance, Epidemiology, and End Results (SEER) program provides information on cancer statistics. Data Representation and Standardization Effective data representation and standardization are vital for implementing computational drug repurposing pipelines using EHRs, as healthcare data are collected for varied purposes, causing variations in logical and physical formats. Uniform and accurate clinical data formatting enables robust analysis, integration of diverse sources, and meaningful insights to identify and validate repurposed drug candidates. The process of data representation and standardization can be categorized into three distinct layers. The first layer consists of unprocessed, raw data from medical records, claims, billing records, patient-reported outcomes (PRO), biobanks or other sources. For instance, the EPIC system is the most widely used system to collect and manage EHR data in health systems. Less expensive systems like Meditech and eClinicalWorks are commonly used in small to medium-sized healthcare systems. REDCap, developed by Vanderbilt University, is a secure, web-based tool for research data collection, scheduling, and surveys. Advanced tools like Clarity, Caboodle (by Epic), and emerging cloud-based platforms like Snowflake support data operations and analysis. The second layer involves transforming and standardizing data to enable seamless analysis across different platforms and organizations. Standardized data formats facilitate efficient analyses, generate reliable evidence, and reduce inconsistencies. This uniformity is essential for linking and exchanging data between sources, accelerating analysis, and ensuring accurate interpretation. For example, the Observational Medical Outcomes Partnership Common Data Model (OMOP CDM) standardizes the structure and content of observational data and is widely adopted by institutes and consortia like All of Us. FHIR (Fast Healthcare Interoperability Resources) is a standard developed by HL7 (Health Level Seven International) to facilitate the exchange of healthcare information electronically. The third layer comprises standardized vocabularies representing specific EHR terms consistently across databases (Table 2). These include uniform definitions for conditions, interventions, and outcomes, enabling accurate comparison and integration across data sources to enhance analytical reliability. Table 2: Standardized data formats and concepts used in real-world medical data. Standardized Data Formats CPT I, CPT II, CPT III Current Procedural Terminology CPT codes provide doctors and healthcare professionals with a standardized language for coding medical services and procedures, aimed at improving reporting accuracy and efficiency. CPT I, CPT II, and CPT III codes are used for reporting medical procedures performed by healthcare professionals, performance measurement and new or developing technology, procedures, and services respectively. CVX Vaccines Administered The CVX code set is a standardized set of codes for vaccines administered in the US. DICOM Digital Imaging and Communications in Medicine A technical international standard for the digital storage and transmission of medical images and related information. ICD International Classification of Diseases For classifying and coding diseases, medical conditions, and other health-related issues. LOINC Logical Observation Identifiers Names and Codes A unified Health Informatics standard for representing laboratory test results and vital signs NDC National Drug Code A unique 10-digit, 3-segment number that provides information about the drug's manufacturer, product, and package size. NUCC National Uniform Claim Committee Provides taxonomy codes which represent healthcare providers based on their specialties, practice areas, and services. OMIM Online Mendelian Inheritance in Man Used for describing symptoms, signs, and features of genetic disorders. RxNorm A standard nomenclature that provides normalized names and unique identifiers for medicines and drugs. SNOMED CT Systematized Nomenclature of Medicine-Clinical Terms A comprehensive clinical terminology system that provides standardized codes for describing and representing clinical concepts such as symptoms, diagnoses, and clinical findings. UCUM Unified Code for Units of Measure A coding system for clearly representing measurement units, covering all units currently used in international science, engineering, and business41. UDI The Unique Device Identification Numeric or alphanumeric code to identify medical devices within the healthcare supply chain. It aims to improve patient safety and facilitate the tracking of medical devices. UMLS Unified Medical Language System For integrating and distributing key terminology, classification, and coding standards for multiple kinds of biomedical related concepts. Data Preprocessing and Integration Data preprocessing and integration are critical steps in the computational drug repurposing pipeline utilizing EHRs, as poor data quality can introduce biases, reduce reliability, and lead to erroneous conclusions. This step involves transforming data into standardized formats, integrating data from multiple sources, and sharing data across units42. Using a combination of machine learning techniques, built-in software, manual handling, and tailored programming, structured and unstructured EHR data can be harmonized and mapped to a standard ontology for downstream analysis2. Structured data (e.g., age, vital signs) is straightforward to retrieve and process. In contrast, unstructured data (e.g., discharge summaries, and clinical notes) pose challenges due to spelling errors, grammatical inconsistencies, and idiosyncrasies, requiring additional tools. Despite this, the unstructured text contains valuable information and is necessary for capturing complex cases, additional clinical details, and clinical reasoning43,44. Extracting meaningful insights from unstructured data typically requires advanced tools and techniques such as Natural Language Processing (NLP) and Machine Learning (ML). Table 3 presents a list of key tools and techniques commonly used for processing medical data in real-world scenarios. Over the past three decades, several clinical NLP tools have been developed for converting unstructured data into machine-readable format. Numerous studies have shown the effectiveness of NLP in performing various clinical tasks45,46. For example, Friedman et al.47 developed a general natural language text processor for clinical oncology. The Clinical Data Collector (CDC) tool was utilized to extract data on metastatic renal cell carcinoma patients48. Deep learning (DL), a subset of ML, has gained significant attention in the field due to its ability to learn abstract representations through deep architectures, often surpassing traditional machine learning approaches49. DL has been applied to various healthcare tasks, including phenotype prediction, drug–target interaction identifications, medical imaging analysis, robotic-assisted surgery, and genomics49,50. For example, Cheng et al.51 used DL networks to discover patient phenotypes, and Geraci et al.52 analyzed unstructured text notes from EHRs to identify youth depression. NLP-based DL methods have shown improved performance in phenotyping compared to traditional techniques and have been applied in information and relation extraction, and event detection53,54,55. Additionally, traditional ML techniques like Naive Bayesian, logistic regression, Random Forest, and Support Vector Machines are also commonly employed for computational phenotype and mining EHR data11,56. While this review does not cover these methods in detail, readers may refer to existing comprehensive reviews for deeper insights into ML techniques for EHR data mining56,57. More advanced techniques like LLMs are discussed in a subsequent section. Table 3: NLP tools and techniques for preparing and transforming medical data in EHR-based drug repurposing Tool/Technique Name Description and Applications MedLEE Medical language extraction and encoding system Extracts information from clinical narrative reports and allows NLP queries. MedLEE was used to identify incidents of adverse events from discharge summaries58 and colorectal cancer concepts from clinical notes59. MedCAT Medical Concept Annotation Toolkit An ML algorithm to automatically annotate medical records, using any concept vocabulary including UMLS/SNOMED-CT60. NegEx Negation Extraction Designed to handle negation cues or negated concepts within clinical text61. MedExtractR To extract medication information like dosage, frequency, timing, and route of administration63. MetaMap A tool for extracting biomedical concepts from UMLS in text. MedEx An open-source existing high-Medication extraction and normalization tool for clinical text standardization. It was used to extract DM2 drug exposure from unstructured clinical text65. performance NLP system63 cTAKES Clinical Text Analysis and Knowledge Extraction System Use to extract clinical data with contextual attributes. Savova et al.65 applied cTAKES to identify cases of peripheral arterial disease from radiology notes, categorizing them into four groups: positive, negative, probable, and unknown cases59. HITEx Health Information Text Extraction HITEx is built on top of Gate framework and used for principal diagnoses extraction, discharge medications extraction, and others66. CLEF Clinical eScience Framework67 Extraction and identification of semantic entities and relationships. SUTime68 A library for recognizing and normalizing time expressions, which can annotate documents with temporal information. GUTime The standard for temporal expression annotation69, and is part of the General Architecture for Text Engineering framework. MedTime An NLP tool for temporal information extraction from clinical text.70 MLP Medical Language Processing This system transforms free-text clinical documents into XML-structured representations. REX Relation Extraction To extract various types of relations drug-drug interactions and medication-attribute relations. SymText/ Mplus A Bayesian Network-based semantic grammar tool It was developed to extract and normalize findings from radiography reports which is now extended to other uses. Fiszman et al. has applied it to extract the interpretations of lung scans71 Methods for Temporal Information and Missing Data Temporal information is extremely valuable for identifying patterns, tracking disease progression, and establishing relationships over time. Sequential models like long short-term memory (LSTM) could be implemented. For example, Baytas et al.72 introduced a novel time-aware unit designed to learn time decay, addressing irregular time intervals in longitudinal patient records by utilizing LSTM. Lipton et al.73 evaluated the performance of LSTM in recognizing patterns using multivariate time series clinical data. Missing values pose challenges due to incomplete entries, follow-up loss, or non-mandatory fields-like lifestyle data-often left blank. Patients may also withhold sensitive information, increasing missingness. Techniques like Last Observation Carried Forward (LOCF), mean/median imputation, Maximum Likelihood Estimation (MLE), ML-based74 methods (e.g. decision tree, k-nearest neighbors (KNN), and Multivariate Imputation by Chained Equations [MICE]) address missingness. Researchers have found that generative adversarial networks (GANs) can effectively deal with missing data by creating realistic covariates or even creating complete synthetic patients while maintaining cause-and-effect relationships75,76. Data Integration Tools The availability of built-in functionalities like Application Programming Interfaces (APIs) allows external applications to access and retrieve EHR data77. For example, OpenEHR78, which is an e-health technology with open specifications, clinical models, and software for standardizing clinical data. It is designed to collect, exchange, and store EHR data using an open standard centered around 'archetypes' for detailed clinical information. Heumos et al.79 recently developed a Python framework \"ehrapy\", which provides an end-to-end exploratory analysis, including quality control, normalization, feature annotation, and feature summarization. The Role of Manual Intervention in EHR Data Preparation Due to the complex structure of healthcare data, machine learning tools or built-in software often fall short. Creating datasets aligned with research objectives frequently requires manual intervention and custom scripting. Custom variables must often be programmatically created to explore data or uncover patterns. Meticulous data cleaning is vital to fix inconsistencies like duplicate entries, varied units, and non-standard date formats. Transformation may involve generating analysis-specific variables, e.g., age at diagnosis from birthdate, BMI from height and weight, or censoring variables. Domain expertise is critical for accurate data transformation and interpretation. Identifying exposures and outcomes usually requires algorithms to define cohorts and test sensitivity and specificity. These steps are essential for managing generic/brand names, varied units, and inconsistent data entry common in EHRs. Addressing these challenges maintains data integrity and ensures the validity of drug repurposing studies. Study Design and Cohort Identification Selecting an appropriate study design and accurately identifying the cohort based on the research question is crucial in database studies to ensure reliable and valid outcomes. In the context of computational drug repurposing using RWD, all studies are observational and use existing data. Observational studies are further categorized into analytical and descriptive types. Analytical studies are primarily employed to examine the exposure-outcome relationship, whereas descriptive studies focus on summarizing frequency distributions. Analytical studies include three main designs: cohort, case-control, and cross-sectional studies80 (Fig 2). Supplementary Figure 1 provides illustrative examples of commonly used designs. Cohort studies are either prospective or retrospective. In prospective designs, subjects are selected based on their exposure status and followed over time to observe and compare the development of outcomes; baseline cases are excluded. Conversely, retrospective studies, often utilizing EHR/RWD, identify subjects based on past exposure and assess later outcomes. A Cohort study design can be employed to determine if drug exposure improves recovery or lowers mortality, provide temporal relationships, assess multiple outcomes, and ensure high internal validity. Limitations include follow-up loss, selection and information bias, and shifting exposure patterns that may reduce result robustness. In case-control studies, cohorts are identified by presence/absence of outcome, multiple exposures are examined retrospectively to identify contributing factors. Incident case-control studies involve newly diagnosed cases and matched controls over a study period, while prevalent case-control studies include all cases during a particular timeframe and controls matched to the cases. Ideally, controls come from the same population, when unclear, controls should match cases on demographics and covariates. Case-control studies require fewer subjects than cohort studies and are suitable to study rare and slow-onset diseases. Limitations include inability to provide accurate information on other covariates, susceptibility to recall bias81, inability to study multiple outcomes, and challenges in choosing appropriate controls. In cross-sectional studies, outcome and exposure are measured simultaneously. Although cross-sectional studies are valuable for initial explorations in computational drug repurposing, they are less commonly used due to their inability to establish temporal relationships, making it difficult to infer causation between drug exposure and therapeutic outcomes. (A) (B) Figure 2: (A) Overview of Study Design, and (B) Prospective and Retrospective Cohort Study, and Case-Control Study Design Propensity Score Analysis Accurate measures of the true effect of exposure are challenging due to significant differences in baseline characteristics between groups and the presence of confounding variables. The Propensity Score Analysis (PSA) is a statistical technique used in observational studies to reduce bias between treatment and control groups. The propensity score (PS) represents the probability of receiving a treatment given the observed baseline characteristic82. Logistic Regression is the most popularly used technique for estimating PS, and the score could be computed using the following formula. ln#!(#$%|'))%*!(#$%|')+$=𝛽, + 𝛽% 𝑋% + ⋯+ 𝛽.𝑋. PS = /01)2! 4 2\" 5\" 4 ⋯4 2$5$+)%4/01)2! 4 2\" 5\" 4 ⋯4 2$5$++ where the exposure is a dependent variable, and the confounding factors are independent variables that may influence treatment assignment. In addition to traditional logistic regression-based PS estimation, advanced ML and DL models, such as LSTM-PS under the Inverse Probability Weighting (IPW) framework, have shown improved covariate balancing in some cases83. Algorithms like Random Forest (RF)84, Gradient Boosting Machines85, KNN, and Support Vector Machines (SVMs) offer alternative approaches, each with specific advantages and limitations. For example, RF performs well with missing data, and boosting methods enhance classification accuracy but lack probabilistic outputs. While neural networks show potential for high-dimensional data. SVMs can handle linearly separable classes and non-linear data using kernel functions and do not assume a parametric relationship between the model predictors and outcome86, while CART is easy to understand and interpret and is suitable for non-linear relationships. However, Zang et al.87 assessed different propensity score models and discovered that deep learning-based propensity score models did not consistently surpass logistic regression-based approaches in achieving covariate balance. Thus, the exploration of multiple models is recommended. After computing the propensity scores for each subject in the cohort, common methods to estimate treatment effect include matching, stratification, inverse probability of treatment weighting, and covariate adjustment88. Propensity Score Matching (PSM) is the most widely used technique to minimize confounding in observational data. It aims to create a pseudo-randomized dataset by matching case and control groups with similar propensity scores, discarding unmatched subjects. Major methods include greedy and optimal matching. Greedy matching selects the untreated subject with the closest score to a randomly chosen treated subject, repeating until all treated subjects are matched. Optimal matching forms pairs minimizing overall score differences across all pairs82. Untreated individuals are selected using methods like nearest-neighbor matching and nearest-neighbor matching within a caliper. In nearest-neighbor matching, the untreated subject with the closest score to the treated individual is paired. If multiple untreated subjects have equal or nearly close propensity scores, a random one is selected. If multiple untreated subjects have similar scores, one is chosen randomly. Caliper matching selects untreated subjects within a defined score threshold. Those without matches are excluded. There is no standard agreed-upon definition of the maximum acceptable distance in caliper matching. Other methods include stratification, which divides treatment and control groups into PS-based strata and compares average outcomes; covariate adjustment, which includes the propensity score as a predictor in a regression model; and Inverse Probability of Treatment Weighting (IPTW), which assigns weights based on the inverse probability of treatment, balancing covariates and making treatment independent of confounding. Effective matching also requires variable selection-identifying covariates strongly associated with outcomes but weakly with treatment89,90. Causal diagrams can aid in confounding factor selection91, but challenges arise while dealing with numerous covariates and incomplete knowledge of causal relationships. It is also important to avoid including variables related to the exposure but not the outcome, as they can increase variance without reducing bias92. Additionally, this approach necessitates a large sample size, and bias may persist due to unobserved covariates. In a study investigating the association between semaglutide and suicidal ideation, Wang et al.8 used 1:1 nearest neighbor greedy matching with a caliper of 0.25 times the standard deviation on covariates that are potential risk factors for suicidal ideation to adjust for confounders in both case and control group. Wang et al.93 also matched cohorts using 1:1 nearest neighbor greedy matching to study the association of GLP-1 receptor agonists and hepatocellular carcinoma incidence and hepatic decompensation in patients with type 2 diabetes. Laifenfeld et al.94 emulated clinical trials using observational RWD to identify two drugs, rasagiline and zolpidem as a repurposing drug candidate for progressive diseases like Parkinson's disease (PD). To address potential confounding and selection biases, two distinct causal inference methods are applied: 1) balancing weights through IPW, and 2) outcome models, using standardization. Statistical Methods After the study design and cohort identification, the final step is to assess drug efficacy using statistical methods tailored to the research question. Kaplan-Meier estimate, log-rank test, and Cox proportional hazards model are widely used, especially for survival analysis, to evaluate time-to-event data and compare survival across treatment groups. Additional statistical methods are also used depending on data complexity and study objectives. Table 4 provides a comparative analysis of these statistical methods, highlighting their strengths, limitations and applications, while Supplementary Table 3 provides detailed mathematical formulations. Method selection depends on factors like research question, study design, and outcome type (e.g., numeric, survival time, or patient counts). For example, Kaplan-Meier estimates survival probability from time-to-event data, whereas Cox models assess covariate effects on hazard rates, allowing multivariate analysis. These techniques enable rigorous evaluation of repurposed drug efficacy, ensuring robust and reliable findings. Table 4: Comparative analysis of statistical methods for drug repurposing validation Statistical Method Strengths Limitations Applications Kaplan–Meier & Log-rank test Kaplan-Meir is used to evaluate the efficacy of a drug by analyzing survival probability at each time point from patients treated with the drugs, the survival curve is a graphical representation of these probabilities, and Log-Rank (LR) test is a hypothesis test to compare the survival curve of two or more different groups (or drugs). • Survival probability of all observations is the same. • Handles censored data. • The risk of an event in one group relative to the other remains constant over time. • Distribution of survival time is not required. • LR test is more appropriate to use when the data is skewed. • Requires sufficient sample size to generate reliable survival curves. • Provides only information about the time of an event of interest, without addressing other important clinical outcomes. • Does not offer an estimate of the magnitude of the difference between groups. • Describes survival based solely on one factor under investigation. The unadjusted cancer survival probabilities of all exposure groups were visualized using Kaplan–Meier plots in Xu et al.64. Kaplan-Meir was used in Rihal et al.95 to analyze the incidence and prognostic implications of acute renal failure in patients undergoing percutaneous coronary intervention. To minimize the effect from confounding factors, Fang et al.96 conducted three drug cohort-based observational studies for AD on collected approved drugs and performed unstratified Kaplan-Meier curves and propensity score stratified log-rank tests for each comparison. Cox proportional-hazards model Evaluate simultaneously the effect of multiple factors on survival and investigate the association between survival time and multiple known variables that potentially affect patient prognosis, adjusting for the effects of confounding factors. • No functional assumptions are made about the shape of the hazard function. • Can handle multiple covariates (predictors) including both continuous and categorical variables. • The model estimates hazard ratios, which provide the relative risk of the outcome. • It assumes a linear relationship between the predictor variables and the log hazard ratio. • It assumes that the hazard ratio remains constant throughout the follow-up period. • Independence of survival times is assumed between distinct individuals in the study population. • Couldn’t determine whether identified biases have been eliminated7. • Tendency to overfit, (Vinzamuri et al. introduces methods on handling correlated features and overfitting97). Wu et al.98 proposed a new data-driven approach for drug repurposing that used large EHR database to identify candidate non-cancer drugs and validated them with the same approach in a second EHR database. To assess the relationship between drug exposure and survival, a Cox proportional hazards regression model was used with covariates including patient demographics and tumor information. Similarly, Xu et al.64 estimated the HRs for all-cause mortalities based on stratified Cox proportional hazard models and evaluated the effects of metformin on survival across multiple cancers. Chi-square test Evaluate the independence between different treatment groups, by comparing the frequency of outcome in patients treated with the drug versus those who are not. • Suitable for categorical data which is commonly encountered in EHR-based drug repurposing validation. • Can handle large sample sizes. • Can analyze multiple outcomes or events. • Does not provide sufficient statistical power to detect minor differences in small sample sizes. • Does not consider confounding factors. • Subject to the problem of multiple comparisons when analyzing multiple outcomes. Wang et al.99 searched public pharmacological databases, genomic databases, and private EHRs for information about drugs and genes associated with glaucoma disease. P-values derived from chi-square tests were used to identify drugs associated with glaucoma-related genes and diseases. Wilcoxon signed rank test Use to compare if the difference in two paired groups (before and after drug exposure) is statistically significant. OR • Does not require assumptions about the distribution of the data (Nonparametric test) • Suitable for small sample sizes. • Sensitive to ties or data points with the same rank. • Less efficient than parametric tests when the underlying data is normally distributed. To validate the drug repurposing candidates, Wu et al.100 applied the Wilcoxon signed-rank test to assess drug efficacy by comparing the difference in median biomarker measurements taken before and after drug exposure. Wilcoxon rank sum test (Mann-Whitney U test) Use for 2 independent groups OR Kruskal Wallis test Use for more than 2 independent groups • Can be used for both continuous and ordinal data. • Robust for outliers • It does not consider the magnitude of the difference. Linear mixed model Incorporate fixed and random effects and is used to analyze longitudinal data with continuous repeated measurements from individual subjects over time. • Useful in hierarchical or longitudinal data structure. • Considers the variability within and between subjects. • Can handle missing data through Maximum Likelihood Estimation. • And accounts for repeated measures. • Several assumptions need to be held, including normality, linearity, and independence. • Complexity in computation and interpretation Wu et al.100 used linear mixed model to assess whether individuals exposed to a repurposing candidate experienced significant biomarker changes.Loucera et al.101 performed Linear Mixed Effects analysis to determine whether there was an increasing linear trend in the log-transformed lymphocyte progression as a result of receiving treatment for COVID-19. Logistic regression To model the relationship between a categorical binary dependent variable and one or more independent variables and can be also used for developing predictive models for dichotomous outcomes in medicine102 • LR is used in PSA to estimate PS and account for potential confounding. • Can be used in cases of binary outcome. • Typically requires large sample size. • Requires meeting a few of the assumptions in linear regression. • Proneness to overfitting, which can lead to poor generalizations of the model. As a method of adjusting for potential confounders, Cheng et al.103 used multivariate LR to predict the likelihood of receiving treatment versus a comparator based on patient covariates. Shao et al.104 used an LR model to develop dementia prediction scores. Petrakis et al. used LR to analyze the association between receiving antiviral treatment and clinical outcomes in COVID-19 patients105. Fisher’s exact test Use to determine the significance of the association between a drug and outcome for small cohorts. • Determine the significance of the association. • Use when sample size is small. • It can only analyze the association between two categorical variables. • Due to its small size the chance of such a sample being representative of a population is low. In this retrospective case-control study validating predicted drugs with RWD, baseline characteristics of patients on the drugs during testing are compared between case and control groups. The Fisher's exact test is applied to nominal categorical data to assess proportions and calculate p-values106. Randomized Controlled Trials vs. Target Trial Emulation Using RWD in Decision Making Target trial emulation is a methodological approach in epidemiology and clinical research that replicates target randomized trials to estimate the causal effects of interventions using observational data. It mimics the structure and rigor of RCTs, simulating randomization and treatment assignment as if it were an actual RCT. Once eligibility criteria are met and subjects are assigned to trial strategies based on baseline data, outcomes are assessed within a defined period. This method is especially useful for causal inference when a true RCT is not feasible Though promising for drug repurposing, target trial emulation faces challenges due to RWD’s limitations. Caution is needed due to random variation, emulation differences, and biases affecting comparability between RCTs and database studies. A key challenge is defining baseline inclusion/exclusion criteria, often hindered by incomplete histories, inconsistent labs, poorly recorded symptoms, vague investigator criteria, or unidentified confounders. Replicating RCT treatment strategies in RWD is difficult, requiring medication adherence, dosing schedules, and identifying patients on standard care107. Emulation also lacks blinding, as patients and providers usually know the treatments108. As observational studies are prone to confounding, effective confounding control is crucial. A successful emulation of the target trial's random assignment cannot be achieved if the observational database lacks adequate information on baseline confounders, as it relies on a strong assumption regarding unmeasured confounding108. Great care is needed when comparing RCT and RWD findings due to differences in outcome definitions, study populations, selection bias, follow-up lengths, and measured effects. For example, an RCT measuring effect at 2 weeks may not match flexible follow-up in RWD. Emulation discrepancies can reveal whether variations in treatment effect stem from design or randomization differences109. Several studies have successfully employed target trial emulation to leverage RWD for drug repurposing. Zang et al.87 emulated trials for thousands of medications from two large-scale RWD warehouses to identify new indications of approved drugs for AD and perform validation after adjusting for required confounding effects. Hernán et al.108 introduced the concept of emulating a target trial with big data when a randomized trial is not feasible, emphasizing the importance of evaluating observational data for causal inference. This paper outlined a framework for comparative effectiveness research using big data that explicitly described the target trial and channels existing counterfactual theory110. Manuel et al.111 used a retrospective case-control design with two claims datasets to emulate RCTs assessing montelukast’s effect on MS relapses. Chen et al. used RWD to simulate AD clinical trials, results indicated higher serious adverse event rates in the simulated trials compared to the original, demonstrating the feasibility of using real-world data for safety evaluation in Alzheimer's trials112. Jeon et al.113 created an external control arm for COVID-19 patients, showing RWD’s potential to replace RCT control arms during emergencies. Daphna et al.94 identified candidate drugs for PD by emulating phase IIb Clinical Trials from Longitudinal RWD. These findings demonstrate the potential of emulation in validating repurposed drug candidates for conditions lacking disease-modifying treatments. The role of RWD continues to be debated in drug regulation, health tech assessments, and clinical guidelines114. A comparison of 30 completed and 2 ongoing RCTs with insurance claims studies showed strong but imperfect agreement (Pearson correlation = 0.82), with 72% achieving statistical significance115. However, cross-sectional review of 220 clinical trials found that only 15% could feasibly be replicated using existing RWD sources116. This suggests that while RWD can supplement or replace some clinical trials, observational methods cannot entirely replace traditional clinical trials. A Japanese database replicated three diabetes RCTs and found no agreement with the originals117. Collins et al.118 highlighted RCT strengths and RWD limitations, noting observational studies alone may not reliably ensure effective, safe treatments. Conversely, Raphael et al.119 presented three successful instances where the FDA used RWE to support regulatory drug approval and highlights that while RWE can aid in conditional drug approvals, RCTs remain essential to confirm treatment efficacy. This work discussed how both can inform decision-making and highlighted that the unique design of RWD, which does not always emulate RCTs, can be seen as a strength because it may better capture the realities of clinical care. It is essential to refine or reject hypotheses based on conflicting results to enhance the validity of both types of studies. Differences between RCT and RWD outcomes, though concerning, are informative and stress the importance of careful emulation and attention to unmeasured confounding. Ultimately, while RWD-based target trial emulation enriches drug repurposing by offering broader insight, RCTs remain critical for internal validity. The integration of RWD and RCTs in decision-making processes offers a balanced approach, leveraging the strengths of both methods while addressing the respective limitations. Recent Advances in Drug Repurposing Validation In the past 5 years, significant progress has been made in identifying and validating repurposed drugs for several diseases using RWD. To provide an overview of these recent advancements, some selected disease-drug pairs for AD, COVID-19 and cancer were showcased in Table 5. The comprehensive list of identified disease-drug pairs using EHR/RWD over the past five years is available in Supplementary Table 4, organized chronologically for each disease category. We conducted a systematic search on Google Scholar and PubMed for studies over the past five years (2019–2024) with a focus on AD, COVID-19 and cancer. Our search included English-language observational studies, including cohort, case-control, retrospective, and drug-repurposing studies, without geographical restrictions. Specific search terms such as \"Disease Name\", \"Real-World\", \"Electronic Health Record\", \"drug repurposing\" along with their synonym were employed, using Boolean operators to refine the results as needed. Eligible studies were those that either validated a particular hypothesis or predicted new drug-disease associations. Additionally, we reviewed meta-analyses and systematic reviews to identify relevant retrospective studies and potential drugs showing effects. Studies were excluded if they showed no association, had contradictory responses or negative associations, were prospective studies, used clinical trial data instead of RWD, or focused on other predictive factors or safety rather than efficacy. Each entry in the table includes the disease-drug pair, a summary of the findings, and the corresponding reference. Table 5: Highlights of the recent drug repurposing candidates for AD, COVID-19 and cancer, identified over the last 5 years using RWD Disease-Drug Pair Summary Ref, Year AD - Metformin & Losartan In this meta-analysis using generative AI and EHR data from VUMC and the All of Us Research Program, metformin and losartan were associated with a reduced risk of AD. Metformin showed a Hazard Ratio (HR) of 0.67 (95% CI: 0.55-0.81), while losartan had an HR of 0.76, (95% CI: 0.6-0.95). Chao Yan et al.120, 2024 AD - Pioglitazone & Febuxostats & Atenolol A pharmacoepidemiology study using the MarketScan Medicare Supplementary database (2012–2017) identified pioglitazone, febuxostat, and atenolol as significantly associated with a reduced AD risk. The HRs were 0.916 (95% CI: 0.861–0.974) for pioglitazone, 0.815 (95% CI: 0.710–0.936) for febuxostat, and 0.949 (95% CI: 0.923–0.976) for atenolol. Jiansong Fang et al.121, 2022 AD - Sildenafil This study developed an AD drug repurposing methodology based on endophenotype disease modules and identified sildenafil as a potential modifier of AD risk. A retrospective case-control analysis of insurance claims for 7.23 million people showed a 69% reduction in AD risk with sildenafil use (HR 0.31, CI 0.25–0.39, p < 1 × 10−8) after 6 years, using Cox regression. Jiansong Fang et al.96, 2021 COVID-19 - Nirmatrelvir/Ritonavir or Molnupiravir A retrospective cohort of COVID-19 patients not requiring supplemental oxygen at admission, treatment with nirmatrelvir–ritonavir (n = 890) or molnupiravir (n = 1856) significantly reduced risks of all-cause mortality and disease progression compared to controls. Crude incidence rate per 10,000 person-days for nirmatrelvir–ritonavir is26.47 [CI 21.34-32.46] and for molnupiravir is 38.07 [CI 33.85-42.67]. The HR and CI for nirmatrelvir–ritonavir is (HR 0.34, CI 0.23–0.50, p<0.0001) and for molnupiravir is (HR 0.48, CI 0.40–0.59, p < 0.0001). Carlos K H Wong et al.122, 2022 COVID-19 - Melatonin This study combined network-based prediction with a propensity score matching observational study of 26,779 individuals to explore drug-outcome relationships. Data from the Cleveland Clinic COVID-19 registry showed that melatonin use was linked to a 28% lower likelihood of a positive SARS-CoV-2 test (OR 0.72, CI 0.56–0.91). Yadi Zhou et al.106, 2021 COVID-19 - (Multiple Drug) This study used a deep graph neural network to derive drug representations based on biological interactions, validating them with genetic profiles, in vitro efficacy, and population-level treatment effects. Analyzing the Optum de-identified EHR database for COVID-19 patients, six drugs were identified with ATT > 0 and p-value < 0.05: acetaminophen (ATT = 0.25), azithromycin (ATT = 0.18), atorvastatin (ATT = 0.17), albuterol (ATT = 0.14), aspirin (ATT = 0.14), and hydroxychloroquine (ATT = 0.08). Kanglin Hsieh et al.123, 2021 Cancer (Epithelial ovarian) - Statin This large case-control study evaluated the effect of statin use on epithelial ovarian cancer (EOC) risk, analyzing data from 2,040 EOC cases and 2,100 frequency-matched controls in the New England Case Control study. Statin users had a 32% lower ovarian cancer risk (OR = 0.68, CI 0.54–0.85), after adjusting for matching factors and covariates. Babatunde Akinwunmi et al.124, 2019 Cancer (Endometrial) - Aspirin A multi-center retrospective study of 1,687 stage I-IV endometrial cancer patients post-hysterectomy showed a 10% improvement in 5-year disease-free survival with low-dose aspirin use (90.6% vs. 80.9%; adjusted HR = 0.46, CI 0.25–0.86), particularly among patients under 60 years old and with a BMI over 30. Koji Matsuo et al.125, 2020 Cancer (Liver) - Statin In this nested case-control study using data from the Scottish Primary Care Clinical Informatics Unit (PCCIU) database, statin use was linked to a lower risk of hepatocellular carcinoma (adjusted HR = 0.48, CI 0.24–0.94). Kim Tu Tran et at.126, 2019 Discussion and Perspectives Data Access and Privacy Concerns Access to EHR data is often restricted due to commercial interests, confidentiality agreements, and stringent access criteria, posing challenges for researchers and academic institutions. The lack of publicly available EHR databases or their extremely high costs prevent many researchers from utilizing these valuable resources. Pharmaceutical companies may further regulate access to safety profiles of approved drugs or data on failed or patented drugs, limiting the academic use of data127. Moreover, public concerns about using personal health data raise the risk of privacy breaches and unauthorized access, emphasizing the need for robust privacy-preserving measures. Xu et al.1 proposed privacy-preserving analytics frameworks that bring models directly to the data, avoiding centralized transfers128. Techniques such as encryption129, data de-identification130, access controls131, federated learning132, and audit logs133 are used to safeguard patient privacy. Legal frameworks like the Health Insurance Portability and Accountability Act (HIPAA) set national standards to protect sensitive patient health information, adding complexity data access and use. Emerging commercial databases such as Truveta offer viable alternatives for researchers lacking institutional access. Initiatives like NIH's All of Us program, which provides researchers with credits to access its database at minimal cost, further prompt equitable access to research resources. Data Quality and Integration EHR data are diverse and heterogeneous, leading to inconsistencies in data representation that complicate integration and timely extraction. While data standardization and data mining tools help address this issue, correcting errors caused by inaccurate entries, software limitations, or poor documentation remains difficult. For instance, time-dependent analyses can be hindered by inaccurate recording of drug start/end dates or disease onset. Often, recorded dates reflect documentation rather than actual events, and medication dispensation or request dates do not guarantee administration. This uncertainty in exposure status reduces analytical reliability. Training and supporting data entry personnel may help to reduce such errors. Furthermore, health conditions are influenced by factors such as lifestyle, environment, social interactions, or work environment, which are challenging to collect and incorporate but essential for reducing confounding and ensuring a more reliable assessment of drug effects. Prioritizing proper documentation of these factors in EHRs can strengthen drug evaluation. Additionally, challenges in handling missing data, entry errors, and integrating lifestyle or social factors in drug re-purposing validation warrant further exploration. Small Sample Size Small sample size is another common challenge in achieving statistical significance when evaluating drug efficacy. Validating rare disease-drug pairs is often infeasible due to insufficient data. Additionally, small sample sizes hinder the construction of matched control cohorts. To address this, researchers may pool data from multiple sources134 or apply Bayesian approaches135, which incorporate prior knowledge and handle small datasets. Relaxing inclusion/exclusion criteria or using meta-analysis, which combines results from multiple studies, can also help increase statistical power. Inconsistent Results and Drug-Drug Interactions While preparing this survey on recent findings in AD, COVID-19 and cancer, we identified several studies with contradictory results136,137,138,139,140, where some indicated positive effects, others showed no significant association, and some even suggested increased mortality or risk. Such discrepancies raise concerns about the accuracy and reliability of the EHR-based drug repurposing studies. Differences in follow-up periods, study populations, designs, database structures, and statistical methods may contribute to these inconsistent findings. Sharing de-identifiable data and analysis protocols would enhance reproducibility. Most studies evaluating repurposed drugs did not sufficiently account for drug-drug interactions (DDIs) and side effects, which can lead to unexpected outcomes. Patients often take multiple medications, and interactions among them may compound adverse effects, complicating the assessment of drug efficacy and safety. Yee et al.141 studied DDIs in COVID-19 treatment, highlighting the importance of rigorous DDI analysis. Gerhart et al.142 analyzed the top 100 most prescribed drugs in high-risk COVID-19 patients to examine interactions with nirmatrelvir-ritonavir. To further improve the analysis of drug effects, Tatonetti et al.143 used a data-driven approach to develop two comprehensive databases, one for drug effects and another for DDIs. Other Applications of EHR in Drug Studies Recent studies have demonstrated that combining EHRs with other modalities, such as gene expression data, can significantly enhance drug repurposing efforts by corroborating discoveries and revealing mechanistic insights144. Zhou et al.145 developed a network-based prediction model for disease-target interactions by analyzing phenotypic and genetic links between drugs, side effects, diseases, and genes to identify potential drug repositioning candidates for AD. EHRs also enable the identification of rare or long-term side effects8, which is critical for evaluating the effectiveness and toxicities of marketed drugs. Side effect data help clarify the correlation between drug targets and adverse events and can support personalized medications. Evaluating efficacy alongside side- effect profiles and comparing repurposed drugs with existing treatments can enhance the robustness of repurposing studies. The FAERS database can be used to compare adverse events between investigational and approved drugs for the same condition. This helps measure the likelihood of adverse events reporting, enhancing the understanding of drug’s safety profile. Smith et al.146 evaluated the risk of adverse drug events for five repurposed COVID-19 regimens in a population of approximately 525,000 Medicare and commercially insured individuals. Moreover, EHRs also support subgroup analyses, offering personalized insights into drug performance across specific patient populations. This underscores the importance of integrating diverse data sources and advanced analytics to ensure the safety and efficacy of repurposed drugs. Prospects of Using Large Language Models in Drug Repurposing LLMs are transforming clinical informatics and medicine147,148. Built on the Transformer architecture, these models employ billions, sometimes trillions, of parameters to perform tasks ranging from question answering to complex reasoning. Driven by the scaling laws, which show performance improves with more parameters, companies have rapidly developed LLMs using proprietary datasets and substantial computing resources. While GPT-series models like ChatGPT are the most widely used, their closed-source nature raises significant privacy concerns, particularly in EHR applications. In contrast, open-source models such as DeepSeek, LLaMA, Qwen, and Mistral are evolving rapidly and narrowing the performance gap. Notably, DeepSeek-R1 has achieved performance comparable to GPT-4o in several reasoning tasks, highlighting the feasibility of applying open-source LLMs to EHR data. The entire field of NLP has evolved rapidly with the release of LLMs. Researchers are now evaluating LLMs for tasks such as summarization149, reasoning150, and entity/phenotype recognition151. One study discovered that pretraining on clinical tokens enables smaller and more parameter-efficient models to match or outperform larger ones trained on general text152. GatorTron trained on >80 billion words of de-identified clinical text, demonstrated strong performance across multiple clinical NLP tasks. Other efforts, like Med-PaLM (a fine-tuned model of PaLM), have shown solid biomedical performance but continue to underperform compared to human clinicians in complex scenarios153. GPT-3.5 and GPT-4 have shown promise in semantic similarity and reasoning tasks but remain less effective in information extraction and classification154. Ranjani155 explored LLMs for pediatric Acute Myeloid Leukemia (AML) repurposing and found them useful for structuring clinical trial registry data. Several recent studies have demonstrated that GPT models perform well in clinical information extraction156,157,158. For example, Marco et al.159 assess LLMs for extracting key Social Determinants of Health (SDoH) factors, such as employment status, housing issues, transportation issues, parental status, and social support from clinical data. Liu et al.160 compared BERT variations for identifying patients with metastatic cancer, finding PubMedBERT fine-tuning most effective. As closed-source models continue to advance, an increasing number of applications are emerging to identify patient cohorts and extract EHR variables for drug validation studies. Beyond data processing, LLMs show potential for reasoning tasks, including inferring drug-disease associations when trained on EHR data. Studies have shown that GPT-4 performs well in zero-shot settings and remains robust even when keywords or half the input tokens are removed161. Using AD as a case study, Yan et al.120 demonstrated ChatGPT as an AI-driven hypothesis generator for repurposing. Of the drugs suggested, three showed significantly reduced AD risk in real-world datasets. Techniques such as chain-of-thought prompting (CoT), multi-step reasoning, retrieval-augmented generation (RAG), and automated prompt tuning could significantly enhance interpretability, robustness, and performance in complex reasoning tasks162. Despite this promise, LLMs raise security and privacy concerns, especially when used with sensitive patient data. Uploading such data to open LLM platforms can risk privacy breaches and unauthorized data access, and the security of closed-source models remains unclear. Robust privacy-preserving analytics and stringent adherence to data protection regulations are essential. Another limitation of LLMs is their reliance on predefined training data, which can pose challenges for underrepresented populations or highly specialized tasks. Additionally, LLMs are prone to issues such as hallucinations, the dissemination of false information, and reasoning errors163. Furthermore, EHR databases such as Truveta or All of Us workbenches have proprietary interfaces and external use of LLMs for analysis is currently unsupported, restricting their utility in certain workflows. However, with the feasibility of running open-source models like DeepSeek locally, clinical applications may soon become more practical. Declaration of Generative AI and AI-assisted Technologies in the Writing Process During the preparation of this work, the author(s) used ChatGPT to enhance the readability and language of the manuscript, as well as to ensure compliance with English spelling and grammar. The intellectual content, structure, comparative synthesis of the literature, and all substantive writing were developed entirely by the authors. After utilizing this tool, the author(s) reviewed and edited the content as needed and take(s) full responsibility for the published article's content. Declaration of Interest All authors declare no financial or non-financial conflicts of interest. Author Contributions N.T.: Writing – Original draft, Data curation, Investigation. X.Z., S.P.: Writing - Review & Editing. H.W.: Review. B.C.: Writing - Review & Editing, Supervision, Conceptualization. Data Availability No data was used for the research described in the article. Acknowledgment The authors extend their gratitude to Martin Witteveen-Lane, Data Engineer at Corewell Health; Zhehui Luo, PhD, Professor in the Department of Epidemiology and Biostatistics at Michigan State University; and Zeshui(Dominic) Yu, from the University of Pittsburgh School of Pharmacy, for their valuable feedback and suggestions on earlier versions of this manuscript Funding This work is funded by NIH R01GM134307, NIH R01GM145700, and Corewell Health-MSU Alliance. Appendix A. Supplementary Material References 1. Xu H, Li J, Jiang X, Chen Q. Electronic Health Records for Drug Repurposing: Current Status, Challenges, and Future Directions. Clin Pharmacol Ther. 2020;107(4):712-714. doi:10.1002/cpt.1769 2. Pushpakom S, Iorio F, Eyers PA, et al. Drug repurposing: progress, challenges and recommendations. Nat Rev Drug Discov. 2019;18(1):41-58. doi:10.1038/nrd.2018.168 3. Tanoli Z, Fernández-Torras A, Özcan UO, et al. Computational drug repurposing: approaches, evaluation of in silico resources and case studies. Nat Rev Drug Discov. Published online March 18, 2025:1-22. doi:10.1038/s41573-025-01164-x 4. Zong N, Wen A, Moon S, et al. Computational drug repurposing based on electronic health records: a scoping review. npj Digit Med. 2022;5(1):1-8. doi:10.1038/s41746-022-00617-6 5. Sanson-Fisher RW, Bonevski B, Green LW, D’Este C. Limitations of the Randomized Controlled Trial in Evaluating Population-Based Health Interventions. American Journal of Preventive Medicine. 2007;33(2):155-161. doi:10.1016/j.amepre.2007.04.007 6. Zhang C, Nigo M, Patel S, Yu D, Septimus E, Wu H. Use of Real-World EMR Data to Rapidly Evaluate Treatment Effects of Existing Drugs for Emerging Infectious Diseases: Remdesivir for COVID-19 Treatment as an Example. Stat Biosci. Published online January 2, 2024. doi:10.1007/s12561-023-09411-8 7. Ozery-Flato M, Goldschmidt Y, Shaham O, Ravid S, Yanover C. Framework for identifying drug repurposing candidates from observational healthcare data. JAMIA Open. 2020;3(4):536-544. doi:10.1093/jamiaopen/ooaa048 8. Wang W, Volkow ND, Berger NA, Davis PB, Kaelber DC, Xu R. Association of semaglutide with risk of suicidal ideation in a real-world cohort. Nat Med. 2024;30(1):168-176. doi:10.1038/s41591-023-02672-2 9. Xie Y, Choi T, Al-Aly Z. Mapping the effectiveness and risks of GLP-1 receptor agonists. Nat Med. Published online January 20, 2025:1-12. doi:10.1038/s41591-024-03412-w 10. Grabowska ME, Huang A, Wen Z, Li B, Wei WQ. Drug repurposing for Alzheimer’s disease from 2012–2022—a 10-year literature review. Front Pharmacol. 2023;14:1257700. doi:10.3389/fphar.2023.1257700 11. Sarwar T, Seifollahi S, Chan J, et al. The Secondary Use of Electronic Health Records for Data Mining: Data Characteristics and Challenges. ACM Comput Surv. 2023;55(2):1-40. doi:10.1145/3490234 12. Data Sources – All of Us Research Hub. 2024. Accessed October 8, 2024. https://www.researchallofus.org/data-tools/data-sources/ 13. Ehwerhemuepha L, Carlson K, Moog R, et al. Cerner real-world data (CRWD) - A de-identified multicenter electronic health records database. Data in Brief. 2022;42:108120. doi:10.1016/j.dib.2022.108120 14. Noel A, Bartelt K. Cosmos: Real-World Data Powered by the Healthcare Community. Journal of the Society for Clinical Data Management. 2023;3(S1). doi:10.47912/jscdm.246 15. Epic Cosmos: Transforming Healthcare Data into Actionable Insights. Accessed March 21, 2025. https://www.suretysystems.com/insights/epic-cosmos-transforming-healthcare-data-into-actionable-insights/ 16. Accelerating Precision Oncology Research: Applications of Linked Clinical & Multiomics Real World Data. Accessed March 14, 2025. https://resources.flatiron.com/real-world-evidence/accelerating-precision-oncology-research-applications-of-linked-clinical-multiomics-real-world-data 17. Patt D, Liu X, Li B, McRoy L, Layman RM, Brufsky A. Real-World Treatment Patterns and Outcomes of Palbociclib Plus an Aromatase Inhibitor for Metastatic Breast Cancer: Flatiron Database Analysis. Clinical Breast Cancer. 2022;22(6):601-610. doi:10.1016/j.clbc.2022.05.002 18. profile-geisinger-health-system.pdf. Accessed March 15, 2025. https://www.healthit.gov/sites/default/files/cds/profile-geisinger-health-system.pdf 19. HealthVerity taXonomy. HealthVerity. Accessed March 14, 2025. https://healthverity.com/taxonomy/ 20. IBM Explorys Electronic Health Record (EHR) Database Data Sheet. Docslib. Accessed January 21, 2025. https://docslib.org/doc/2297651/ibm-explorys-electronic-health-record-ehr-database-data-sheet 21. IBM MarketScan Description_11.21.19.pdf. 2019. Accessed March 14, 2025. https://pophealth.ucsf.edu/sites/g/files/tkssra4556/f/IBM%20MarketScan%20Description_11.21.19.pdf 22. Discover. Mayo Clinic Platform. Accessed October 8, 2024. https://www.mayoclinicplatform.org/discover/ 23. Data Contents | Mount Sinai Data Warehouse. February 5, 2020. Accessed October 8, 2024. https://labs.icahn.mssm.edu/msdw/data-sources/ 24. Hogan WR, Shenkman EA, Robinson T, et al. The OneFlorida Data Trust: a centralized, translational research data infrastructure of statewide scope. Journal of the American Medical Informatics Association. 2022;29(4):686-693. doi:10.1093/jamia/ocab221 25. OneFlorida+ Clinical Research Network » Clinical and Translational Science Institute » University of Florida. Accessed October 8, 2024. https://www.ctsi.ufl.edu/ctsa-consortium-projects/oneflorida-clinical-research-network/ 26. Oracle EHR Real-World Data. Published online 2024. https://www.oracle.com/a/ocom/docs/industries/life-sciences/factsheet-oracle-ehr-real-world-data.pdf 27. PremierHealthcareDatabaseWhitepaper.pdf. 2020. Accessed March 11, 2025. https://offers.premierinc.com/rs/381-NBB-525/images/PremierHealthcareDatabaseWhitepaper.pdf 28. Clinical Practice Research Datalink | CPRD. Accessed May 3, 2023. https://www.cprd.com/node/120 29. Real-world data for the life sciences and healthcare. TriNetX. Accessed October 8, 2024. https://trinetx.com/ 30. Truveta Data - EHR data. Truveta. Accessed March 11, 2025. https://www.truveta.com/truveta-data/ 31. UCSF Clinical Data. UCSF Data. Accessed October 8, 2024. https://data.ucsf.edu/research/ucsf-data 32. Electronic Health Records (EHR) Data | Optum. Accessed October 8, 2024. https://www.optum.com/en/business/life-sciences/real-world-data/ehr-data.html 33. iLab Organizer:: VUMC Integrated Data Access and Services Core (IDASC). Accessed March 14, 2025. https://my.ilabsolutions.com/service_center/show_external/3668/vanderbilt-integrated-data-access-and-services-core-idasc 34. Forrest CB, McTigue KM, Hernandez AF, et al. PCORnet® 2020: current state, accomplishments, and future directions. Journal of Clinical Epidemiology. 2021;129:60-67. doi:10.1016/j.jclinepi.2020.09.036 35. welcome to eMerge. Accessed October 8, 2024. https://emerge-network.org/faq/ 36. dbGaP Study. Accessed January 21, 2025. https://www-ncbi-nlm-nih-gov.proxy1.cl.msu.edu/projects/gap/cgi-bin/study.cgi?study_id=phs001584.v2.p2 37. National COVID Cohort Collaborative Data Enclave. Accessed October 8, 2024. https://datacatalog.med.nyu.edu/dataset/10384 38. Sidky H, Young JC, Girvin AT, et al. Data quality considerations for evaluating COVID-19 treatments using real world data: learnings from the National COVID Cohort Collaborative (N3C). BMC Med Res Methodol. 2023;23(1):46. doi:10.1186/s12874-023-01839-2 39. Consortia Directory. Accessed October 8, 2024. https://www.rarediseasesnetwork.org/consortia-directory 40. Rare Diseases Clinical Research Network - Wikipedia. Accessed March 20, 2025. https://en.wikipedia.org/wiki/Rare_Diseases_Clinical_Research_Network 41. UCUM. 2024. Accessed October 11, 2024. https://ucum.org/ 42. Mohan R, Nguyen HB, Ho P, Dalton L, Chan F. Deriving a De-Identified Dataset from EPIC-Derived Data for Use in Clinical Research: Pearls and Pitfalls in Database Creation and Analysis. Pediatrics. 2021;147(3_MeetingAbstract):7-8. doi:10.1542/peds.147.3MA1.7 43. Kharrazi H, Anzaldi LJ, Hernandez L, et al. The Value of Unstructured Electronic Health Record Data in Geriatric Syndrome Case Identification: Geriatric Syndrome Identification and Free-Text EHRs. J Am Geriatr Soc. 2018;66(8):1499-1507. doi:10.1111/jgs.15411 44. Vest JR, Grannis SJ, Haut DP, Halverson PK, Menachemi N. Using structured and unstructured data to identify patients’ need for services that address the social determinants of health. International Journal of Medical Informatics. 2017;107:101-106. doi:10.1016/j.ijmedinf.2017.09.008 45. Zeng Z, Deng Y, Li X, Naumann T, Luo Y. Natural Language Processing for EHR-Based Computational Phenotyping. IEEE/ACM Transactions on Computational Biology and Bioinformatics. 2019;16(1):139-153. doi:10.1109/TCBB.2018.2849968 46. Shah AD, Bailey E, Williams T, Denaxas S, Dobson R, Hemingway H. Natural language processing for disease phenotyping in UK primary care records for research: a pilot study in myocardial infarction and death. J Biomed Semantics. 2019;10(Suppl 1):20. doi:10.1186/s13326-019-0214-4 47. Friedman C, Alderson PO, Austin JH, Cimino JJ, Johnson SB. A general natural-language text processor for clinical radiology. J Am Med Inform Assoc. 1994;1(2):161-174. Accessed May 22, 2023. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC116194/ 48. van Laar SA, Gombert-Handoko KB, Guchelaar HJ, Zwaveling J. An Electronic Health Record Text Mining Tool to Collect Real-World Drug Treatment Outcomes: A Validation Study in Patients With Metastatic Renal Cell Carcinoma. Clinical Pharmacology & Therapeutics. 2020;108(3):644-652. doi:10.1002/cpt.1966 49. Yu JL, Dai QQ, Li GB. Deep learning in target prediction and drug repositioning: Recent advances and challenges. Drug Discovery Today. 2022;27(7):1796-1814. doi:10.1016/j.drudis.2021.10.010 50. Zhang D, Yin C, Zeng J, Yuan X, Zhang P. Combining structured and unstructured data for predictive models: a deep learning approach. BMC Med Inform Decis Mak. 2020;20:280. doi:10.1186/s12911-020-01297-6 51. Cheng Y, Wang F, Zhang P, Hu J. Risk Prediction with Electronic Health Records: A Deep Learning Approach. In: Proceedings of the 2016 SIAM International Conference on Data Mining (SDM). Proceedings. Society for Industrial and Applied Mathematics; 2016:432-440. doi:10.1137/1.9781611974348.49 52. Geraci J, Wilansky P, Luca V de, Roy A, Kennedy JL, Strauss J. Applying deep neural networks to unstructured text notes in electronic medical records for phenotyping youth depression. BMJ Ment Health. 2017;20(3):83-87. doi:10.1136/eb-2017-102688 53. Zeng Z, Deng Y, Li X, Naumann T, Luo Y. Natural Language Processing for EHR-Based Computational Phenotyping. IEEE/ACM transactions on computational biology and bioinformatics. 2019;16(1):139. doi:10.1109/TCBB.2018.2849968 54. Han S, Zhang RF, Shi L, et al. Classifying social determinants of health from unstructured electronic health records using deep learning-based natural language processing. Journal of Biomedical Informatics. 2022;127:103984. doi:10.1016/j.jbi.2021.103984 55. Annapragada AV, Donaruma-Kwoh MM, Annapragada AV, Starosolski ZA. A natural language processing and deep learning approach to identify child abuse from pediatric electronic medical records. PLOS ONE. 2021;16(2):e0247404. doi:10.1371/journal.pone.0247404 56. Yang S, Varghese P, Stephenson E, Tu K, Gronsbell J. Machine learning approaches for electronic health records phenotyping: a methodical review. J Am Med Inform Assoc. 2022;30(2):367-381. doi:10.1093/jamia/ocac216 57. Shickel B, Tighe PJ, Bihorac A, Rashidi P. Deep EHR: A Survey of Recent Advances in Deep Learning Techniques for Electronic Health Record (EHR) Analysis. IEEE J Biomed Health Inform. 2018;22(5):1589-1604. doi:10.1109/JBHI.2017.2767063 58. Melton GB, Hripcsak G. Automated Detection of Adverse Events Using Natural Language Processing of Discharge Summaries. J Am Med Inform Assoc. 2005;12(4):448-457. doi:10.1197/jamia.M1794 59. Xu H, Fu Z, Shah A, et al. Extracting and Integrating Data from Entire Electronic Health Records for Detecting Colorectal Cancer Cases. AMIA Annu Symp Proc. 2011;2011:1564-1572. Accessed March 22, 2025. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3243156/ 60. Kraljevic Z, Searle T, Shek A, et al. Multi-domain clinical natural language processing with MedCAT: The Medical Concept Annotation Toolkit. Artificial Intelligence in Medicine. 2021;117:102083. doi:10.1016/j.artmed.2021.102083 61. Chapman WW, Bridewell W, Hanbury P, Cooper GF, Buchanan BG. A simple algorithm for identifying negated findings and diseases in discharge summaries. J Biomed Inform. 2001;34(5):301-310. doi:10.1006/jbin.2001.1029 62. Weeks HL, Beck C, McNeer E, et al. medExtractR: A targeted, customizable approach to medication extraction from electronic health records. Journal of the American Medical Informatics Association. 2020;27(3):407-418. doi:10.1093/jamia/ocz207 63. Xu H, Stenner SP, Doan S, Johnson KB, Waitman LR, Denny JC. MedEx: a medication information extraction system for clinical narratives. Journal of the American Medical Informatics Association. 2010;17(1):19-24. doi:10.1197/jamia.M3378 64. Xu H, Aldrich MC, Chen Q, et al. Validating drug repurposing signals using electronic health records: a case study of metformin associated with reduced cancer mortality. Journal of the American Medical Informatics Association. 2015;22(1):179-191. doi:10.1136/amiajnl-2014-002649 65. Savova GK, Masanz JJ, Ogren PV, et al. Mayo clinical Text Analysis and Knowledge Extraction System (cTAKES): architecture, component evaluation and applications. J Am Med Inform Assoc. 2010;17(5):507-513. doi:10.1136/jamia.2009.001560 66. HITEx Manual. Accessed October 13, 2024. https://www.i2b2.org/software/projects/hitex/hitex_manual.html 67. Roberts A, Gaizauskas R, Hepple M, et al. The CLEF Corpus: Semantic Annotation of Clinical Text. AMIA Annu Symp Proc. 2007;2007:625-629. Accessed February 16, 2024. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2655900/ 68. Chang AX, Manning CD. SUTIME: A Library for Recognizing and Normalizing Time Expressions. 69. Verhagen M, Pustejovsky J. Temporal Processing with the TARSQI Toolkit. In: Ramsay A, Bontcheva K, eds. Coling 2008: Companion Volume: Demonstrations. Coling 2008 Organizing Committee; 2008:189-192. Accessed February 16, 2024. https://aclanthology.org/C08-3012 70. Lin YK, Chen H, Brown RA. MedTime: A temporal information extraction system for clinical narratives. Journal of Biomedical Informatics. 2013;46:S20-S28. doi:10.1016/j.jbi.2013.07.012 71. Fiszman M, Haug PJ, Frederick PR. Automatic extraction of PIOPED interpretations from ventilation/perfusion lung scan reports. Proc AMIA Symp. Published online 1998:860-864. Accessed May 15, 2023. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2232386/ 72. Baytas IM, Xiao C, Zhang X, Wang F, Jain AK, Zhou J. Patient Subtyping via Time-Aware LSTM Networks. In: Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM; 2017:65-74. doi:10.1145/3097983.3097997 73. Lipton ZC, Kale DC, Elkan C, Wetzel R. Learning to Diagnose with LSTM Recurrent Neural Networks. CoRR. Published online November 11, 2015. Accessed October 10, 2024. https://www.semanticscholar.org/paper/8f2182846d5d4cfbc216b5e4c00411e021dc4776 74. Rahman MM, Davis DN. Machine Learning-Based Missing Value Imputation Method for Clinical Datasets. In: Yang GC, Ao S long, Gelman L, eds. IAENG Transactions on Engineering Technologies: Special Volume of the World Congress on Engineering 2012. Springer Netherlands; 2013:245-257. doi:10.1007/978-94-007-6190-2_19 75. Tang AS, Woldemariam SR, Miramontes S, Norgeot B, Oskotsky TT, Sirota M. Harnessing EHR data for health research. Nat Med. 2024;30(7):1847-1855. doi:10.1038/s41591-024-03074-8 76. Yoon J, Jordon J, Schaar M. GAIN: Missing Data Imputation using Generative Adversarial Nets. ArXiv. Published online June 7, 2018. Accessed September 2, 2024. https://www.semanticscholar.org/paper/a89f0a78f86077864e108a1bd2c4e670c85907f8 77. DD&T Developer Guide for Web - HOLDER.pdf. 2017. Accessed May 31, 2023. https://ddandt.ucsf.edu/sites/g/files/tkssra3386/f/wysiwyg/DD&T%20Developer%20Guide%20for%20Web%20-%20HOLDER.pdf 78. Beale SH Thomas. openEHR-Home. Accessed November 18, 2024. https://openehr.org/ 79. Heumos L, Ehmele P, Treis T, et al. An open-source framework for end-to-end analysis of electronic health record data. Nat Med. Published online September 12, 2024:1-12. doi:10.1038/s41591-024-03214-0 80. Yadav P, Steinbach M, Kumar V, Simon G. Mining Electronic Health Records (EHRs): A Survey. ACM Comput Surv. 2018;50(6):1-40. doi:10.1145/3127881 81. Sedgwick P. Bias in observational study designs: case-control studies. BMJ. 2015;350:h560. doi:10.1136/bmj.h560 82. Austin PC. An Introduction to Propensity Score Methods for Reducing the Effects of Confounding in Observational Studies. Multivariate Behavioral Research. 2011;46(3):399-424. doi:10.1080/00273171.2011.568786 83. Weberpals J, Becker T, Davies J, et al. Deep Learning-based Propensity Scores for Confounding Control in Comparative Effectiveness Research: A Large-scale, Real-world Data Study. Epidemiology. 2021;32(3):378. doi:10.1097/EDE.0000000000001338 84. Zhao P, Su X, Ge T, Fan J. Propensity Score and Proximity Matching Using Random Forest. Contemporary clinical trials. 2016;47:85. doi:10.1016/j.cct.2015.12.012 85. Friedman JH. Greedy function approximation: A gradient boosting machine. Ann Statist. 2001;29(5). doi:10.1214/aos/1013203451 86. Westreich D, Lessler J, Funk MJ. Propensity score estimation: machine learning and classification methods as alternatives to logistic regression. J Clin Epidemiol. 2010;63(8):826-833. doi:10.1016/j.jclinepi.2009.11.020 87. Zang C, Zhang H, Xu J, et al. High-throughput target trial emulation for Alzheimer’s disease drug repurposing with real-world data. Nat Commun. 2023;14(1):8180. doi:10.1038/s41467-023-43929-1 88. Lalani N, Jimenez RB, Yeap B. Understanding Propensity Score Analyses. International Journal of Radiation Oncology*Biology*Physics. 2020;107(3):404-407. doi:10.1016/j.ijrobp.2020.02.638 89. VanderWeele TJ. Principles of confounder selection. Eur J Epidemiol. 2019;34(3):211-219. doi:10.1007/s10654-019-00494-6 90. Brookhart MA, Schneeweiss S, Rothman KJ, Glynn RJ, Avorn J, Stürmer T. Variable Selection for Propensity Score Models. American Journal of Epidemiology. 2006;163(12):1149-1156. doi:10.1093/aje/kwj149 91. PEARL J. Causal diagrams for empirical research. Biometrika. 1995;82(4):669-688. doi:10.1093/biomet/82.4.669 92. Kelcey BM. Improving and Assessing Propensity Score Based Causal Inferences in Multilevel and Nonlinear Settings by. 93. Wang L, Berger NA, Kaelber DC, Xu R. Association of GLP-1 Receptor Agonists and Hepatocellular Carcinoma Incidence and Hepatic Decompensation in Patients With Type 2 Diabetes. Gastroenterology. 2024;0(0). doi:10.1053/j.gastro.2024.04.029 94. Laifenfeld D, Yanover C, Ozery-Flato M, et al. Emulated Clinical Trials from Longitudinal Real-World Data Efficiently Identify Candidates for Neurological Disease Modification: Examples from Parkinson’s Disease. Front Pharmacol. 2021;12. doi:10.3389/fphar.2021.631584 95. Rihal CS, Textor SC, Grill DE, et al. Incidence and Prognostic Importance of Acute Renal Failure After Percutaneous Coronary Intervention. Circulation. 2002;105(19):2259-2264. doi:10.1161/01.CIR.0000016043.87291.33 96. Fang J, Zhang P, Zhou Y, et al. Endophenotype-based in silico network medicine discovery combined with insurance record data mining identifies sildenafil as a candidate drug for Alzheimer’s disease. Nat Aging. 2021;1(12):1175-1188. doi:10.1038/s43587-021-00138-z 97. Vinzamuri B, Reddy C. Cox Regression with Correlation Based Regularization for Electronic Health Records. In:; 2013:757-766. doi:10.1109/ICDM.2013.89 98. Wu Y, Warner JL, Wang L, et al. Discovery of Noncancer Drug Effects on Survival in Electronic Health Records of Patients With Cancer: A New Paradigm for Drug Repurposing. JCO Clin Cancer Inform. 2019;3:1-9. doi:10.1200/CCI.19.00001 99. Wang H, Deng Y, Wan L, Huang L. A comprehensive map of disease networks and molecular drug discoveries for glaucoma. Sci Rep. 2020;10(1):9719. doi:10.1038/s41598-020-66350-w 100. Wu P, Feng Q, Kerchberger VE, et al. Integrating gene expression and clinical data to identify drug repurposing candidates for hyperlipidemia and hypertension. Nat Commun. 2022;13(1):46. doi:10.1038/s41467-021-27751-1 101. Loucera C, Carmona R, Esteban-Medina M, et al. Real-world evidence with a retrospective cohort of 15,968 COVID-19 hospitalized patients suggests 21 new effective treatments. Virol J. 2023;20:226. doi:10.1186/s12985-023-02195-9 102. Tu JV. Advantages and disadvantages of using artificial neural networks versus logistic regression for predicting medical outcomes. Journal of Clinical Epidemiology. 1996;49(11):1225-1231. doi:10.1016/S0895-4356(96)00002-9 103. Cheng F, Desai RJ, Handy DE, et al. Network-based approach to prediction and population-based validation of in silico drug repurposing. Nat Commun. 2018;9(1):2691. doi:10.1038/s41467-018-05116-5 104. Shao Y, Zeng QT, Chen KK, Shutes-David A, Thielke SM, Tsuang DW. Detection of probable dementia cases in undiagnosed patients using structured and unstructured electronic health records. BMC Medical Informatics and Decision Making. 2019;19(1):128. doi:10.1186/s12911-019-0846-4 105. Petrakis V, Rafailidis P, Trypsianis G, Papazoglou D, Panagopoulos P. The Antiviral Effect of Nirmatrelvir/Ritonavir during COVID-19 Pandemic Real-World Data. Viruses. 2023;15(4):976. doi:10.3390/v15040976 106. Zhou Y, Hou Y, Shen J, et al. A network medicine approach to investigation and population-based validation of disease manifestations and drug repurposing for COVID-19. PLOS Biology. 2020;18(11):e3000970. doi:10.1371/journal.pbio.3000970 107. Franklin JM, Glynn RJ, Suissa S, Schneeweiss S. Emulation differences versus biases when calibrating RWE findings against RCTs. Clin Pharmacol Ther. 2020;107(4):735-737. doi:10.1002/cpt.1793 108. Hernán MA, Robins JM. Using Big Data to Emulate a Target Trial When a Randomized Trial Is Not Available. Am J Epidemiol. 2016;183(8):758-764. doi:10.1093/aje/kwv254 109. Sheldrick RC. Randomized Trials vs Real-world Evidence: How Can Both Inform Decision-making? JAMA. 2023;329(16):1352-1353. doi:10.1001/jama.2023.4855 110. Hernán MA, Robins JM. Using Big Data to Emulate a Target Trial When a Randomized Trial Is Not Available. Am J Epidemiol. 2016;183(8):758-764. doi:10.1093/aje/kwv254 111. Manuel AM, Gottlieb A, Freeman L, Zhao Z. Montelukast as a repurposable additive drug for standard-efficacy multiple sclerosis treatment: Emulating clinical trials with retrospective administrative health claims data. Mult Scler. 2024;30(6):696-706. doi:10.1177/13524585241240398 112. Chen Z, Zhang H, Guo Y, et al. Exploring the feasibility of using real-world data from a large clinical data research network to simulate clinical trials of Alzheimer’s disease. npj Digit Med. 2021;4(1):1-9. doi:10.1038/s41746-021-00452-1 113. Jeon JY, Kim MJ, Im YJ, et al. Development of an External Control Arm Using Electronic Health Record-Based Real-World Data to Evaluate the Efficacy of COVID-19 Treatment. Clinical Pharmacology & Therapeutics. 2023;113(6):1274-1283. doi:10.1002/cpt.2882 114. Boyle JM, Hegarty G, Frampton C, et al. Real-world outcomes associated with new cancer medicines approved by the Food and Drug Administration and European Medicines Agency: A retrospective cohort study. European Journal of Cancer. 2021;155:136-144. doi:10.1016/j.ejca.2021.07.001 115. Wang SV, Schneeweiss S, Franklin JM, et al. Emulation of Randomized Clinical Trials With Nonrandomized Database Analyses. JAMA. 2023;329(16):1376-1385. doi:10.1001/jama.2023.4221 116. Bartlett VL, Dhruva SS, Shah ND, Ryan P, Ross JS. Feasibility of Using Real-World Data to Replicate Clinical Trial Evidence. JAMA Netw Open. 2019;2(10):e1912869. doi:10.1001/jamanetworkopen.2019.12869 117. Wakabayashi R, Hirano T, Koga T, Kuwatsuru R. An Attempt to Replicate Randomized Trials of Diabetes Treatments Using a Japanese Administrative Claims and Health Checkup Database: A Feasibility Study. Drugs Real World Outcomes. 2023;10(2):235-247. doi:10.1007/s40801-023-00353-7 118. Collins R, Bowman L, Landray M, Peto R. The Magic of Randomization versus the Myth of Real-World Evidence. New England Journal of Medicine. 2020;382(7):674-678. doi:10.1056/NEJMsb1901642 119. Raphael MJ, Gyawali B, Booth CM. Real-world evidence and regulatory drug approval. Nat Rev Clin Oncol. 2020;17(5):271-272. doi:10.1038/s41571-020-0345-7 120. Yan C, Grabowska ME, Dickson AL, et al. Leveraging generative AI to prioritize drug repurposing candidates for Alzheimer’s disease with real-world clinical validation. npj Digit Med. 2024;7(1):1-6. doi:10.1038/s41746-024-01038-3 121. Fang J, Zhang P, Wang Q, et al. Artificial intelligence framework identifies candidate targets for drug repurposing in Alzheimer’s disease. Alz Res Therapy. 2022;14(1):1-23. doi:10.1186/s13195-021-00951-z 122. Wong CKH, Au ICH, Lau KTK, Lau EHY, Cowling BJ, Leung GM. Real-world effectiveness of early molnupiravir or nirmatrelvir–ritonavir in hospitalised patients with COVID-19 without supplemental oxygen requirement on admission during Hong Kong’s omicron BA.2 wave: a retrospective cohort study. The Lancet Infectious Diseases. 2022;22(12):1681-1693. doi:10.1016/S1473-3099(22)00507-2 123. Hsieh K, Wang Y, Chen L, et al. Drug repurposing for COVID-19 using graph neural network and harmonizing multiple evidence. Sci Rep. 2021;11(1):23179. doi:10.1038/s41598-021-02353-5 124. Akinwunmi B, Vitonis AF, Titus L, Terry KL, Cramer DW. Statin Therapy and Association with Ovarian Cancer risk in the New England Case Control (NEC) Study. Int J Cancer. 2019;144(5):991-1000. doi:10.1002/ijc.31758 125. Matsuo K, Cahoon SS, Yoshihara K, et al. Association of Low-Dose Aspirin and Survival of Women With Endometrial Cancer. Obstet Gynecol. 2016;128(1):127-137. doi:10.1097/AOG.0000000000001491 126. Tran KT, McMenamin ÚC, Coleman HG, et al. Statin use and risk of liver cancer: Evidence from two population-based studies. International Journal of Cancer. 2020;146(5):1250-1260. doi:10.1002/ijc.32426 127. Cha Y, Erez T, Reynolds IJ, et al. Drug repurposing from the perspective of pharmaceutical companies. British Journal of Pharmacology. 2018;175(2):168-180. doi:10.1111/bph.13798 128. Wu Y, Jiang X, Kim J, Ohno-Machado L. Grid Binary LOgistic REgression (GLORE): building shared models without sharing data. Journal of the American Medical Informatics Association. 2012;19(5):758-764. doi:10.1136/amiajnl-2012-000862 129. Data Encryption In Healthcare: An In-Depth Guide To Securing Patient Data - ExpertBeacon. November 4, 2023. Accessed March 20, 2025. https://expertbeacon.com/data-encryption-in-healthcare/ 130. Data De-identification: Definition, Importance, Benefits, and Limitations. November 7, 2023. Accessed March 20, 2025. https://www.shaip.com/blog/everything-you-need-to-know-about-data-de-identification/ 131. HIPAA Compliance in EHRs: The Critical Role of Access Control – Xpio Health. Accessed March 20, 2025. https://xpiohealth.com/hipaa-compliance-in-ehrs-the-critical-role-of-access-control/ 132. Dang TK, Lan X, Weng J, Feng M. Federated Learning for Electronic Health Records. ACM Trans Intell Syst Technol. 2022;13(5):72:1-72:17. doi:10.1145/3514500 133. Adler-Milstein J, Adelman JS, Tai-Seale M, Patel VL, Dymek C. EHR audit logs: A new goldmine for health services research? Journal of Biomedical Informatics. 2020;101:103343. doi:10.1016/j.jbi.2019.103343 134. Dedman D, Cabecinha M, Williams R, Evans SJW, Bhaskaran K, Douglas IJ. Approaches for combining primary care electronic health record data from multiple sources: a systematic review of observational studies. BMJ Open. 2020;10(10):e037405. doi:10.1136/bmjopen-2020-037405 135. McNeish D. On Using Bayesian Methods to Address Small Sample Problems. Structural Equation Modeling: A Multidisciplinary Journal. 2016;23(5):750-773. doi:10.1080/10705511.2016.1186549 136. Liu P, McMenamin ÚC, Spence AD, Johnston BT, Coleman HG, Cardwell CR. Furosemide use and survival in patients with esophageal or gastric cancer: a population-based cohort study. BMC Cancer. 2019;19(1):1-12. doi:10.1186/s12885-019-6242-8 137. Choi M, Han J, Yang BR, et al. Association of Insulin, Metformin, and Statin with Mortality in Breast Cancer Patients. Cancer Res Treat. 2020;53(1):65-76. doi:10.4143/crt.2020.430 138. Rosenberg ES, Dufort EM, Udo T, et al. Association of Treatment With Hydroxychloroquine or Azithromycin With In-Hospital Mortality in Patients With COVID-19 in New York State. JAMA. 2020;323(24):2493-2502. doi:10.1001/jama.2020.8630 139. Kim J, Bae YJ, Kang HT. Metformin Use May Increase Risk of Pancreatic Cancer in Diabetic Women: An Analysis of the Korean National Health Insurance Service-National Health Screening Cohort Database. Korean J Fam Med. 2022;43(5):327-333. doi:10.4082/kjfm.22.0005 140. He Q, Chen X, Wu T, Li L, Fei X. Risk of Dementia in Long-Term Benzodiazepine Users: Evidence from a Meta-Analysis of Observational Studies. Journal of Clinical Neurology. 2019;15(1):9-19. doi:10.3988/jcn.2019.15.1.9 141. Yee SW, Vora B, Oskotsky T, et al. Drugs in COVID-19 Clinical Trials: Predicting Transporter-Mediated Drug-Drug Interactions Using In Vitro Assays and Real-World Data. Clinical Pharmacology & Therapeutics. 2021;110(1):108-122. doi:10.1002/cpt.2236 142. Gerhart J, Draica F, Benigno M, et al. Real-World Evidence of the Top 100 Prescribed Drugs in the USA and Their Potential for Drug Interactions with Nirmatrelvir; Ritonavir. AAPS J. 2023;25(5):73. doi:10.1208/s12248-023-00832-3 143. Tatonetti NP, Ye PP, Daneshjou R, Altman RB. Data-Driven Prediction of Drug Effects and Interactions. Science Translational Medicine. 2012;4(125):125ra31-125ra31. doi:10.1126/scitranslmed.3003377 144. Low YS, Daugherty AC, Schroeder EA, et al. Synergistic drug combinations from electronic health records and gene expression. Journal of the American Medical Informatics Association. 2017;24(3):565-576. doi:10.1093/jamia/ocw161 145. Zhou M, Zheng C, Xu R. Combining phenome-driven drug-target interaction prediction with patients’ electronic health records-based clinical corroboration toward drug discovery. Bioinformatics. 2020;36(Supplement_1):i436-i444. doi:10.1093/bioinformatics/btaa451 146. Smith MK, Bikmetov R, Al Rihani SB, et al. Adverse drug event risk assessment by the virtual addition of COVID-19 repurposed drugs to Medicare and commercially insured patients’ drug regimens: A drug safety simulation study. Clin Transl Sci. 2021;14(5):1799-1809. doi:10.1111/cts.13025 147. Zhao WX, Zhou K, Li J, et al. A Survey of Large Language Models. Published online June 29, 2023. doi:10.48550/arXiv.2303.18223 148. Thirunavukarasu AJ, Ting DSJ, Elangovan K, Gutierrez L, Tan TF, Ting DSW. Large language models in medicine. Nat Med. 2023;29(8):1930-1940. doi:10.1038/s41591-023-02448-8 149. Tang L, Sun Z, Idnay B, et al. Evaluating large language models on medical evidence summarization. npj Digit Med. 2023;6(1):1-8. doi:10.1038/s41746-023-00896-7 150. Huang J, Chang KCC. Towards Reasoning in Large Language Models: A Survey. arXiv.org. December 20, 2022. Accessed September 24, 2023. https://arxiv.org/abs/2212.10403v2 151. Yang J, Liu C, Deng W, et al. Enhancing Phenotype Recognition in Clinical Notes Using Large Language Models: PhenoBCBERT and PhenoGPT. Published online August 10, 2023. doi:10.48550/arXiv.2308.06294 152. Lehman E, Hernandez E, Mahajan D, et al. Do We Still Need Clinical Language Models? Published online February 16, 2023. doi:10.48550/arXiv.2302.08091 153. Singhal K, Azizi S, Tu T, et al. Large Language Models Encode Clinical Knowledge. Published online December 26, 2022. doi:10.48550/arXiv.2212.13138 154. Chen Q, Du J, Hu Y, et al. Large language models in biomedical natural language processing: benchmarks, baselines, and recommendations. Published online 2023. doi:10.48550/ARXIV.2305.16326 155. Ramamurthy R. Using LLMs for drug repurposing. llmed.ai. July 13, 2023. Accessed March 17, 2024. https://medium.com/llmed-ai/using-llms-for-drug-repurposing-a57c462a8ad3 156. Agrawal M, Hegselmann S, Lang H, Kim Y, Sontag D. Large Language Models are Few-Shot Clinical Information Extractors. Published online November 30, 2022. Accessed August 28, 2024. http://arxiv.org/abs/2205.12689 157. Caufield JH, Hegde H, Emonet V, et al. Structured Prompt Interrogation and Recursive Extraction of Semantics (SPIRES): a method for populating knowledge bases using zero-shot learning. Bioinformatics. 2024;40(3):btae104. doi:10.1093/bioinformatics/btae104 158. Wei CH, Peng Y, Leaman R, et al. Assessing the state of the art in biomedical relation extraction: overview of the BioCreative V chemical-disease relation (CDR) task. Database (Oxford). 2016;2016:baw032. doi:10.1093/database/baw032 159. Guevara M, Chen S, Thomas S, et al. Large language models to identify social determinants of health in electronic health records. npj Digit Med. 2024;7(1):1-14. doi:10.1038/s41746-023-00970-0 160. Liu K, Kulkarni O, Witteveen-Lane M, Chen B, Chesla D. MetBERT: a generalizable and pre-trained deep learning model for the prediction of metastatic cancer from clinical notes. AMIA Jt Summits Transl Sci Proc. 2022;2022:331-338. Accessed April 11, 2025. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9285138/ 161. Zhang X, Talukdar N, Vemulapalli S, et al. Comparison of Prompt Engineering and Fine-Tuning Strategies in Large Language Models in the Classification of Clinical Notes. AMIA Jt Summits Transl Sci Proc. 2024;2024:478-487. Accessed August 28, 2024. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11141826/ 162. Sahoo P, Singh AK, Saha S, Jain V, Mondal S, Chadha A. A Systematic Survey of Prompt Engineering in Large Language Models: Techniques and Applications. Published online February 5, 2024. doi:10.48550/arXiv.2402.07927 163. Xue J, Wang YC, Wei C, Liu X, Woo J, Kuo CCJ. Bias and Fairness in Chatbots: An Overview. Published online December 10, 2023. doi:10.48550/arXiv.2309.08836 Glossary AD Alzheimer's Disease AHR Adjusted Hazard Ratio ARR Adjusted Risk Ratio CI Confidence Interval CRC Colorectal Cancer DL Deep Learning DM2 Type 2 Diabetes Mellitus EHR Electronic Health Records HR Hazard Ratio LLM Large Language Model NHIS National Health Insurance Service NLP Natural Language Processing OR Odds Ratio OS Overall Survival RCT Randomized Clinical Trial RWD Real-World Data RWE Real World Evidence SDoH Social Determinants of Health (A) (B) (C) Supplementary Figure 1: Examples of different study designs and statistical tests implemented in real-world scenarios. Supplementary Table 1: References to examples of studies using the following database. Database Name References All of US 1, 25/30/25 12:24:00 PM Cerner Real-World 3, 4 Epic Cosmos 5 Flatiron Health Database 6, 7, 8, 9, 10, 11, 12, 135/30/25 12:24:00 PM Geisinger Refresh 14, 15, 16 HealthVerity 17, 18 IBM EXPLORYS 19, 20, 21 IBM MarketScan 22, 20, 23, 21, 24 Mayo Clinic 25, 26, 27, 28, 2 Mount Sinai Health System 29, 30, 31, 32 OneFlorida+ 33, 22, 34, 355/30/25 12:24:00 PM Oracle 36 Premier Health Database 37 The UK Clinical Practice Research Datalink 38, 39, 40, 41, 42, 435/30/25 12:24:00 PM TriNetX 44, 45, 46 Truveta 47 UCSF (University of California San Francisco) Clinical Data 3, 32, 29 US Optum EHR database 48, 49, 50 Vanderbilt University Medical Center 26, 25, 2, 51 Supplementary Table 2: Additional Details on Data sources and Accessibility Database Access Information All of US The Public Tier is accessible to everyone through the Data Browser. Access to the Registered and Controlled Tiers requires institutional agreements, researcher registration, and adherence to data use policies52. Cerner Real-World Data (CRWD) Currently limited to U.S. researchers (1) Researchers from non-contributing entities can license the database for a research project that is granted approval by CRWD (2) Access available to organizations contributing data to CRWD. Epic Cosmos Direct access to Cosmos is available for those affiliated with and approved by a Cosmos participating organization. Access to Cosmos and Cosmos data cannot be purchased. Flatiron Health Database University of Colorado Cancer Center investigators can access the data, and curated data sets are made available following submission and approval of a project proposal. Access to all datasets is via a proposal-based process via Flatiron Explore that involves collaborating with Flatiron Health and adherence to data privacy and security protocols53. IBM Explorys Can be used by authenticated researcher with a cost (Free for COVID-19 research) IBM MarketScan (earlier known as Truven) The database can be licensed for research purposes, and the requests can be initiated at the company website: https://www.ibm.com/watson-health. Access for use by UCSF affiliates is free for unpublished or internally funded/nonfunded research. For extramurally funded projects there is an incremental fee of $30,000/study for non-profit funded research and $60,000/study for industry sponsored research54. Mayo Clinic Platform Mayo Clinic researchers can use the database free of cost, through a data science environment created by Mayo Clinic. Partners can access through a subscription to Mayo Clinic Platform_Discover55 Mount Sinai Data Warehouse (MSDW) Available only to Mount Sinai-affiliated researchers and clinicians. Users must have a Mount Sinai School account to log in and have their own ATLAS account. Any researcher planning to use the Mount Sinai Data Warehouse (MSDW) must follow all the data use agreements and policies by MSDW and should have an IRB approval letter. For Data Warehouse programming (custom reports, data marts, data extracts, data re-identification, new data sources, or other programming) there is a charge of $236/hour56. OneFlorida+ The Data Trust is made of HIPAA Limited Data Set (LDS) to ensure patient privacy and simplify regulatory compliance. Regulatory compliance for an LDS only requires a data-use agreement (DUAs) between the University of Florida and each data provider, eliminating the need for Business Associate Agreements. The Data Trust is accessible to investigators by contacting the OneFlorida+ Coordinating Center. Oracle EHR Real-World Data Oracle ensures data access through the use of industry-standard technologies like HTML, JavaScript, and Java for rendering user interfaces. Researchers can request access to Oracle's RWD via the official Oracle Health Real-World Data webpage. The UK Clinical Practice Research Datalink (CPRD) Globally accessible with a cost and subject to protocol approval via CPRD’s Research Data Governance (RDG) Process. Researchers interested in utilizing CPRD data should submit their protocols via the Electronic Research Applications Portal (eRAP) and adhere to the RDG process requirements. TriNetX Access to the TriNetX platform is provided to healthcare organizations (and their researchers) who become “members” of the TriNetX network. TriNetX offers a self-service, HIPAA, GDPR, and LGPD-compliant platform. Researchers can query, license, and download the data. The terms grant you rights to the data for one year, with the option to receive refreshed data on your cohort quarterly during that time. UCSF (University of California San Francisco) Clinical Data Access to the UCSF EHR data can be requested for research purposes. Identified data requires an IRB approved protocol and typically requires funding to work with centralized data experts to extract data on your behalf. De-identified (DeID) data does not require IRB approval and is self-serve via SQL server or point-and-click tools. US Optum EHR Database Optum Labs Data Warehouse (OLDW) is not available for direct academic research but can be accessed only under a partnership model, at the following rates: 1-year studies range from 50k-70k. For multi-year studies add 20k for each additional year Vanderbilt University Medical Center (VUMC) IRB approval for studies involving human subjects, a complete DUA and an online application are needed. VUMC provides Synthetic Derivative (SD) Record Counter and Research Derivative (RD) Discover for data exploration and research planning, cohort exploration and full dataset exploration. The access to these tools is provided at no cost, data extraction services may incur fees. Supplementary Table 3: Mathematical Expression for Each Statistical Method Method Expression Kaplan–Meir & Log-Rank Test Survival probability at time ti S\" (t)= ∏(1−!!\"!)#:%! &% • ni is the number of individuals at risk at time ti, • di is the number of events (deaths, failures) at time ti Log-rank statistic for 2 groups Control vs Treatment (for e.g. j=1,2) χ'= ∑(∑*#$+ ∑-#$)%∑-#$ • ΣOjt represents the sum of the observed number of events in the jth group over time • ΣEjt represents the sum of the expected number of events in the jth group over time. Cox proportional-Hazards Model Hazard at time t for subject i λ (t|X#)=λ/(t)exp3β0X#0+⋯+ β1X#17 • Xi = (Xi1, …, X ip) values of the p covariates for subject i • β1, β2... βp are the coefficient for the covariates • 𝜆o (t) is the baseline hazard function Chi-square Test The test statistic to test for independence of treatment and outcome is given by: χ'= ∑∑(*!#+-!#)%-!# • Oij is the observed frequency in the cell at row i and column j, • Eij is the expected frequency in the cell at row i and column j, • The summation is taken over all rows i and columns j. • Eij = (Row total of i) × (Column total of j) / Grand Total • For e.g i=1,2(Recovered vs Not Recovered); j=1,2(Control vs Treated) Wilcoxon Signed Rank Test The test statistic for paired difference of median is: W = min (T+, T-) • For paired data points (Xi, Yi) i=1, 2..., n. The test is performed on the differences di =Xi −Yi • Calculate the absolute differences ∣di∣ and assign ranks Ri • T+, T- is the sum of the ranks Ri of the positive and negative difference Linear Mixed Models Y = Xβ + Zb + € • Y is the vector of observations (for e.g. lab measurement value). • X is the known fixed effects design matrix (age, gender, another demographic). • β is the coefficient vector of fixed effects. • Z is the known random effects design matrix (Patient specific measurement, for e.g. blood pressure). • b is the coefficient vector of random effects. • € is the error term. Logistic Regression log=2(340)0+2(340)>= β5+ β0X0+⋯+ β1X1 • P (y = 1) is the probability of the event (getting treated, survival etc.), • β1, β2... βp are the coefficient for the predictors, • βo is the intercept, • X1... Xp are the covariates Fisher’s Exact Test The probability of observing the given contingency table under the null hypothesis is: P= 67897:(;8!;)(\"78;) • a,b,c,d are the cell counts in a 2x2 contingency table. • n is the total number of observations. • For example, to test drug exposure A and B and 2 outcome “recovered(R)” “not recovered (NR)” after 5 years for independence; a is the number of subjects receiving A and R, b is the number of subjects receiving A and NR, c is the number of subjects receiving B and R, and d is the number of subjects receiving B and NR. Supplementary Table 4: Drug-Disease Pair Drug Disease Summary Ref, Year Anticholinesterases - Opioid Cancer (Colorectal) In this hypothesis-free study, two drugs linked to colorectal cancer prognosis has been identified to have a protective effect against both all-cause mortality (ACM) and colorectal cancer-specific mortality (CCSM) using data from Korean National Health Insurance Service-National Sample Cohort database. Anticholinesterases (N07AA) [ACM: 0.47 (0.33-0.66), CCSM: 0.42 (0.28-0.62)] and opioid anesthetics (N01AH) [ACM: 0.54 (0.38-0.77), CCSM: 0.44 (0.29-0.67)]. Hyeong-Taek Woo et al.57, 2023 Statin Cancer (Head & Neck) This study performed a survival analysis and found that Statin medication improves Five-Year Survival Rates and lower risk of death, in patients with Head and Neck Cancer (HNC) with a retrospective case-control study of about 100,000 Patients from TriNetX. Cohort I received Statins, and cohort II did not, both cohorts contained about 50,000 patients. During the five-year observation period after the initial diagnosis of HNC, the risk of death is 15.9% (cohort I) and 17.2% (cohort II). The survival probability at the end of the time window was 75.19% for cohort I and 70.48% for cohort II. Jonas Wüster et al.58, 2023 Statin Cancer (Liver) 25,853 Patients from National Health Insurance Research Database in Taiwan were studied to see the association between statin against liver cancer in patients with heart failure. The liver cancer risk decreased in statin users versus non-users (adjusted hazard ratio (aHR) = 0.26, 95% CI: 0.20–0.33) in the entire cohort in the multivariate regression analysis. Meng-Chuan Lu et al.59, 2023 FOLFIRINOX Cancer This retrospective, nonrandomized comparative effectiveness study used data from the AIM Specialty Health-Anthem Cancer Care Quality Program and from administrative claims of commercially insured patients, spanning 388 outpatient centers and clinics for medical oncology located in 44 states across the US. Patients treated with FOLFIRINOX had a median overall survival of 9.27 months, and was also associated with fewer post treatment complications, whereas those treated with gemcitabine plus nab-paclitaxel had a median overall survival of 6.87 months. Avital Klein-Brill et al.60, 2022 Proton pump inhibitors-histamine-2 receptor antagonists Cancer (Lung) This study used data from the National Health Insurance Service (NHIS)–National Sample Cohort released by the KNHIS in 2015, and the cohort comprised (n = 1,031,392) from the entire South Korean population in 2002 for which dose administration between January 2006 and December 2010 was recorded. In the multivariable analysis, Antacid exposure before the diagnosis of lung cancer was independently associated with a reduced incidence of lung cancer (hazard ratio: 0.64; 95% confidence interval: 0.55–0.74; P <.001). A total of Subin Go et al.61, 2022 1230 (0.28%) antacid-exposed patients developed lung cancer. Metformin Cancer (Colorectal) Metformin use was found to be associated with a reduced risk of Colorectal cancer (CRC) incidence and improved overall survival in patients with diabetes mellitus using a common data model of the Korean NHIS database from 2002 to 2013. In the PS matched cohort, the risk of CRC incidence in metformin users was significantly lower than in non-users (HR, 0.58; 95% CI, 0.47–0.71). Seung In Seo et al.62, 2022 Statin Cancer (Brain Metastasis) Data for cancer patients with brain metastasis were selected from the linked electronic medical care records of the West China Hospital between October 2010 and July 2019. 4,510 brain metastatic patients were included in this retrospective study. The overall Statin use rate in patients was 5.28% (219 cases/4510 cases). After adjusting for baseline patient characteristics, metabolism indicators, and cancer-specific factors, Statin use was shown to have a significant protective role, aiding the survival of the cancer patients with brain metastasis (Adjusted HR = 0.82, 95% CI: 0.69–0.99, p = 0.034) Yu Min et al.63, 2022 Aspirin Cancer To assess the association between low-dose aspirin and the incidence of CRC, gastric cancer (GC), oesophageal cancer (EC) and gastrointestinal bleeding (GIB) in adults without established atherosclerotic cardiovascular disease, 49 679 aspirin and non-aspirin users were included from Clinical Data Analysis and Reporting System (CDARS), Hong Kong. HRs for low-dose aspirin compared with non-aspirin users were 0.83 for CRC (95% CI, 0.76 to 0.91), 0.77 for GC (95% CI, 0.65 to 0.92) and 0.88 for EC (95% CI, 0.67 to 1.16). Jessica J P Shami et al.64, 2022 Crizotinib Cancer (Lung) This study assessed real-world clinical outcomes among patients with ROS1-positive advanced NSCLC treated with Crizotinib from iKnowMed EHR data, maintained by McKesson Specialty Health (MSH). The median treatment discontinuation (TTD), time to next treatment (TTNT), and overall survival (OS) time were 25.2 months [95% confidence interval (CI): 5.2–not reached (NR)], 25.0 months David Waterhouse et. al.65, 2022 (95% CI 5.2–61.0), and 36.2 months (95% CI 15.9–NR), respectively. DPP-4 Inhibitors Cancer (Colorectal) To investigate the association between DPP4-inhibitor treatment and the prognosis of CRC patients, Clinical data of CRC patients with diabetes and the prescription of DPP4-inhibitors who had undergone curative surgery from the Hong Kong Hospital Authority (HA) between January 2006 and December 2015 were retrieved. The DPP4-inhibitor patient group showed a significantly better 5-year disease-free survival (median DFS = 1733 days, 95% CI = 1596 to 1870 days) when compared to the metformin group (p = 0.030, median DFS = 1382 days, 95% CI = 1246 to 1518 days). Lui Ng et al.66, 2021 Statin Cancer 4236 individuals in the Statin group and 8472 individuals in the Statin nonuser group were included from the Longitudinal Health Insurance Database (LHID) of Taiwan to study whether Statins reduce the risk of cancer in susceptible dialysis populations. Statin users are significantly less likely to develop cancer than Statin nonusers (aHR) 0.81, 95% CI 0.78–0.90), especially with a longer treatment duration, and certain types of cancer. Po-Huang Chen et al.67, 2021 Metformin Cancer (Lung) The Norwegian Prescription Database was used to assess the association between metformin use and overall survival (OS) and LC-specific survival (LCSS) in 22,324 lung cancer (LC) patients diagnosed between 2005-2014 from the Cancer Registry of Norway. Post-diagnostic metformin treatment was associated with improved LCSS in all patients (HR = 0.83; 95% CI 0.73–0.95), in patients with SCC (HR = 0.75; 95% CI 0.57–0.98), regional stage LC (HR = 0.74; 95% CI 0.59–0.94), and regional stage SCC (HR = 0.57; 95% CI 0.38–0.86). Suzan Brancher et al.68, 2021 Statin Cancer (Thyroid) This study investigated the association of previous Statin use with thyroid cancer in the ≥ 40-year-old population in the Korean National Health Insurance Service-Health Screening Cohort. The 5501 patients in the thyroid cancer group were matched with the 22,004 patients in the non-thyroid cancer group for age, sex, income, and region of residence. Thyroid cancer was negatively associated with Statin use in the previous 2 years in the adjusted model OR = 0.89, 95% CI 0.82–0.95, p= 0.001). So Young Kim et al.69, 2021 Statin Cancer (Lung) The association between Statin exposure and lung cancer risk in a population-based cohort of chronic obstructive pulmonary disease (COPD) among 39,879 patients from linked, administrative data for the province of British Columbia (BC), Canada, indicated a reduced risk from Statin exposure (HR: 0.85 (95% CI: 0.73–1.00) in COPD patients. However, this result is not statistically significant. But (recency-weighted cumulative dose, HR: 0.85 (95% CI: 0.77–0.93) and recency-weighted cumulative duration of use, HR: 0.97 (95% CI: 0.96–0.99) are significant. AJN Raymakers et al.70, 2020 Aspirin Cancer (Colorectal) Data was collected from Taiwan National Health Insurance and Taiwan Cancer Registry from 2000 through 2015. In this nested case-control study among 4,710,504 participants in Taiwan, low-dose aspirin use was associated with 11% lower risk of CRC among those aged 40 years or older, regardless of duration and recency of drug use. A 30% lower CRC risk was observed when low-dose aspirin was initiated between age 40 and 59 years. Hui-Min Diana Lin, et al.71, 2020 Statin Cancer (Gastric) This is a retrospective cohort study based on data retrieved from the territory-wide EHR, Clinical Data Analysis and Reporting System (CDARS), of the Hong Kong Hospital Authority to provide evidence on the additional benefits of Statins as chemopreventive agents against gastric cancer among H. pylori–eradicated patients. Statins were associated with a lower gastric cancer risk (SHR = 0.34; 95% CI, 0.19–0.61), in a duration– and dose–response manner (Ptrend < 0.05) among 22,870 PS-matched subjects. Ka Shing Cheung et al.72, 2020 Statin Cancer (Stomach) To investigate the association between Statin, use and stomach cancer incidence in individuals with hypercholesterolemia. Data from HEALS Database provided by the Korean NHIS on 17,737 Statin users and 13,412 Statin non-users were included. Compared to non-users, hazard ratios (95% confidential intervals) for stomach cancer of low users and high users were 0.953 (0.755–1.203) and 0.526 (0.399–0.693) in men and 0.629 (0.457–0.865) and 0.370 (0.256–0.535) in women, respectively, after adjusting for possible confounders. Hyo-Sun You et al.73, 2020 Aspirin Cancer (Gastrointestinal) A cohort of 223 640 new users of low-dose aspirin (75-300 mg/day) patients from The Health Improvement Network (THIN) were studied to see the association between low-dose aspirin use against various gastrointestinal cancers. Results indicate that use of low-dose aspirin is associated with a 54% reduced risk of gastric cancer and a 41% reduced risk of oesophageal cancer Luis A. García Rodríguez et al.74, 2020 Aspirin Endometrial Cancer Evaluation of survival outcomes in a multi-center retrospective study of 1687 patients with stage I–IV endometrial cancer, post-hysterectomy, reported improved 5-year disease-free survival by 10% with low-dose aspirin use (90.6% versus 80.9%, adjusted HR: 0.46, 95% CI: 0.25–0.86), particularly in those aged younger than 60 years and with a BMI over 30 kg/m Koji Matsuo et al.75, 2020 Digitalis (Digoxin) Cancer (Prostate) Digoxin was associated with a significantly decreased risk of developing Prostate cancer (PC) (HR, 0.74; 95% CI, 0.548-0.993; p = 0.045). Moreover, the risk of PC decreased with a longer duration of digoxin use during the study period compared to those who had never used digoxin (p = 0.043) Lin, Tzu-Ping et al.76, 2020 Aspirin Cancer (Uterine) Population-based cohort study among Taiwanese women from Longitudinal Health Insurance Database 2000 (LHID 2000) suggests that aspirin (ASA) use was associated with a decreased risk of uterine cancer (UC). 23,342 women received ASA treatment between 2000 and 2010, and a comparison group of same sample size randomly selected from the same database matched by the propensity score. The incidence of UC in the ASA cohort was 10% of that in Pei-Chen Li et al.77, 2020 the comparison group and the adjusted incidence rate ratio (IRR) was 0.10 (95% CI = 0.09–0.11) for ASA users relatives to comparisons after controlling for covariates. Statin Cancer (Colorectal) This study included 238 patients ≥70 years and 227 patients <70 years old, from the Southeast Health Care Region of Sweden, who were diagnosed with rectal adenocarcinoma between 2004 and 2013. In the older group (patients ≥70 years), Statin use at the time of diagnosis was related to better cancer-specific survival (CSS) and OS, compared to non-use (CSS: Hazard Ratio (HR), 0.37; 95% CI, 0.19–0.72; P =.003; OS: HR, 0.62; 95% CI, 0.39–0.96; P =.032). Angeliki Kotti et al.78, 2019 Statin Cancer (Liver) This is a nested case–control study within the Scottish Primary Care Clinical Informatics Unit (PCCIU) database. Statin use was associated with lower risk of hepatocellular carcinoma (HCC; adjusted HR, 0.48; 95% CI, 0.24–0.94) Kim Tu Tran et al.79, 2019 Metformin Cancer (Colorectal) Patients with colorectal cancer and T2DM during 2000–2012 period were identified form Lithuanian Cancer Registry and the National Health Insurance Fund database. Metformin users were observed to have significantly lower risk in colorectal cancer-specific mortality (HR 0.77, 95% CI 0.64–0.93). Audrius Dulskas et al.80, 2019 5α-reductase inhibitors Gastro-Oesophageal (GO) cancer To assess 5α-reductase inhibitors in GO cancer risk, the study included 2003 GO cancer cases and 9650 controls from the Scottish Primary Care Clinical Information Unit Research database. There was evidence of reduced GO cancer risk among 5AR inhibitor users (adjusted OR = 0.75; 95% CI, 0.56-1.02), particularly for finasteride (adjusted OR = 0.68; 95% CI, 0.50-0.94). John Busby et al.81, 2019 Antipsychotic Cancer (Gastric) Using a nested case-control design, a total of 34470 gastric cancer patients and 163430 non-gastric cancer controls were identified from Taiwan's National Health Insurance to study the association between antipsychotic use and gastric cancer risk. Antipsychotic use was inversely associated with gastric cancer risk, and dose-dependent effects against gastric cancer were also seen with several individual antipsychotic compounds. Yi-Hsuan Hsieh et al.82, 2019 Statin Cancer (Epithelial ovarian) This is a large case–control study to assess whether Statin use can lower the risk for epithelial ovarian cancer (EOC). The data was for 2,040 cases with EOC and 2,100 frequency-matched controls without the disease from New England Case Control study. Overall, women who used Statins had 32% lower risk of ovarian cancer compared to non-users OR 0.68, 95% CI: 0.54–0.85), adjusting for the matching factors and other covariates. Babatunde Akinwunmi et al.83, 2019 Statin Cancer Pancreatic Ductal Adenocarcinoma (PDAC) This is a nested case-control study, to study the association between use of Statin or aspirin and (PDAC). The data originated from deidentified secondary data released by the National Health Insurance Service (NHIS) for research purposes in Korea. Statin use (odds ratio [OR], 0.92; 95% [CI] 0.76-1.11; P =.344; adjusted OR [AOR], 0.70; 95% CI 0.56-0.87; P =.001) was associated with a reduced risk of PDAC after correction of the confounding factors, but aspirin use was not. Jin Ho Choi et al.84, 2019 Multiple Drug Cancer This study establishes a new model for mining EHRs to identify drug repurposing signals by linking cancer registry data to EHRs. It included 43,310 cancer patients treated at VUMC and 98,366 treated at the Mayo Clinic. The analysis identified 22 drugs from six classes—Statins, proton pump inhibitors, angiotensin-converting enzyme inhibitors, β-blockers, nonsteroidal anti-inflammatory drugs, and α-1 blockers—associated with improved overall cancer survival (false discovery rate < 0.1) at VUMC. Of these, nine drug associations were successfully replicated at the Mayo Clinic. Yonghui Wu et al.85, 2019 Rosuvastatin Associated with 19% improved cancer survival (HR 0.81, 95% CI 0.69 - 0.95) from VUMC and 32% improved cancer survival (HR 0.68, 95% CI 0.5 - 0.92) from Mayo Clinic. Simvastatin Associated with 16% improved cancer survival (HR 0.84, 95% CI 0.79 - 0.90) from VUMC and 18% improved cancer survival (HR 0.82, 95% CI 0.76 - 0.87) from Mayo Clinic. Amlodipine Associated with 16% improved cancer survival (HR 0.84, 95% CI 0.79 - 0.90) from VUMC and 15% improved cancer survival (HR 0.85, 95% CI 0.78 - 0.93) from Mayo Clinic. Tamsulosin Associated with 13% improved cancer survival (HR 0.87, 95% CI 0.8 - 0.96) from VUMC and 29% improved cancer survival (HR 0.71, 95% CI 0.59 - 0.85) from Mayo Clinic. Metformin Associated with 12% improved cancer survival (HR 0.88, 95% CI 0.80 - 0.97) from VUMC and 13% improved cancer survival (HR 0.87, 95% CI 0.80 - 0.95) from Mayo Clinic. Omeprazole Associated with 11% improved cancer survival (HR 0.89, 95% CI 0.84 - 0.94) from VUMC and 10% improved cancer survival (HR 0.90, 95% CI 0.85 - 0.96) from Mayo Clinic. Warfarin Associated with 10% improved cancer survival (HR 0.90, 95% CI 0.85 - 0.96) from VUMC and 10% improved cancer survival (HR 0.90, 95% CI 0.84 - 0.96) from Mayo Clinic. Lisinopril Associated with 9% improved cancer survival (HR 0.91, 95% CI 0.86 - 0.97) from VUMC and 7% improved cancer survival (HR 0.93, 95% CI 0.89 - 0.97) from Mayo Clinic. Metoprolol Associated with 8% improved cancer survival (HR 0.92, 95% CI 0.86 - 0.98) from VUMC and 31% improved cancer survival (HR 0.69, 95% CI 0.61 - 0.77) from Mayo Clinic. Nirmatrelvir/ Ritonavir COVID-19 To study the effectiveness against all-cause mortality, intensive care unit (ICU) admission, or use of ventilatory support (VS) within 28 days. The trial included hospitalized patients with COVID-19 aged 18 years or older (n = 7119) from electronic health databases in Hong Kong. The use was associated with a lower risk for all-cause mortality nirmatrelvir–ritonavir: HR, 1.08 [CI, 0.58 to 2.02]; but no significant risk reduction in terms of ICU admission or VS. Eric Yuk Fai Wan et al.86, 2023 Molnupiravir COVID-19 To study the effectiveness against all-cause mortality, intensive care unit (ICU) admission, or use of ventilatory support (VS) within 28 days. The trial included hospitalized patients with COVID-19 aged 18 years or older (n = 16 495) from EHR in Hong Kong. The use was associated with a lower risk for all-cause mortality Molnupiravir:[HR], 0.87 [95% CI, 0.81 to 0.93]; but no significant risk reduction in terms of ICU admission or VS. Eric Yuk Fai Wan et al86, 2023 Remdesivir (RDV) COVID-19 A retrospective real-world study conducted in two hospitals in Spain (Dr. Balmis General University Hospital (HGUA) and Vega Baja Hospital of Orihuela (HVB), Alicante) on 211 patients found that RDV has the effectiveness and good safety profile in vaccinated patients at considerable risk for disease progression. It was associated with a low rate of all-cause hospitalization or death, regardless of immunocompetence status José Manuel Ramos-Rincón et al. 87, 2023 Molnupiravir, Nirmatrelvir-Ritonavir, Sotrovimab COVID-19 Based on the Secure Anonymized Information Linkage (SAIL) Databank, higher-risk non-hospitalized adult patients who received treatment were at a lower risk of hospitalization or death than those who did not receive treatment. However, patients in the treatment group were younger (mean age 53 vs 57 years), had fewer comorbidities, and a higher proportion had received four or more doses of the COVID-19 vaccine (36.3% vs 17.6%) Andrew Evans et al.88, 2023 Azvudine COVID-19 EHR patients with COVID-19 were retrieved from the inpatient system of Xiangya Hospital. Azvudine was associated with lower risks of composite disease progression outcome (HR: 0.55; 95% CI: 0.32–0.94) and all-cause death (HR: 0.40; 95% CI: 0.16–1.04) compared with nirmatrelvir–ritonavir in terms of composite disease progression outcome. Guangtong Deng el at.89, 2023 Multiple drug COVID-19 Using data from a central registry of EHR (the Andalusian Population Health Database), the effect of prior consumption of drugs for other indications previous to the hospitalization with respect to patient outcomes, including survival and lymphocyte progression, was studied on a retrospective cohort of 15,968 individuals, comprising all COVID-19 patients hospitalized in Andalusia between January and November 2020.Covariate-adjusted hazard ratios and analysis of lymphocyte progression curves support a significant association between consumption of 21 different drugs and better patient survival. Carlos Loucera el at.90, 2023 Multiple drug COVID-19 Based on Optum claims data from over 3 million US patients, this study has constructed a simulated drug study cohort and conducted a series of RWD-driven analyses to simulate a clinical trial observational study design utilizing Optum ERG® risk adjustment to quickly determine which FDA-approved small molecule oral drugs have promising RWE efficacy (odds reduction rate (ORR)) comparable to or comparable to the COVID-19 vaccine in reducing severe disease. The top performing drugs identified include emtricitabine, tenofovir, folic acid, progesterone, estradiol, epinephrine, disulfiram, nitazoxanide and some drug combinations including aspirin-celecoxib. Yun Liao50, 2023 Nirmatrelvir/ Ritonavir COVID-19 This was a retrospective study conducted in the Clinic of Infectious Diseases of the University General Hospital of Alexandroupolis (Greece). Data from routine care patient charts during the period from 1 March 2022 to 1 March 2023 were retrospectively analyzed. Multivariable logistic regression models for all patients showed that treatment with nirmatrelvir/ritonavir (OR: 0.34; 95% CI: 0.29–0.55, p < 0.001) and a complete vaccination scheme against SARS-CoV-2 (OR: 0.24; 95% CI: 0.19–0.29, p < 0.001) were significantly associated with a lower probability of severe clinical progress of COVID-19. Vasilios Petrakis et. al.91, 2023 Steroid COVID-19 A total of 1100 severe COVID-19 cases from electronic patient record (EPR), was analyzed using multivariable cox proportional hazards model. Steroid > 3 days was found to have association between decreased hazard of in-hospital mortality (HR: 0.47; 95% CI: 0.31–0.72). Wenjuan Wang et al.92, 2022 Statin COVID-19 An analysis of the impact of Statin therapy on the outcomes of patients with non-small-cell lung cancer receiving anti-PD-1 monotherapy using PS matching. At Helsinki, 390 patients with advanced or recurrent NSCLC treated with anti-programmed cell death-1 (PD-1) monotherapy between January 2016 and December 2019 were enrolled. The Kaplan–Meier curves of the propensity score-matched cohort showed that the overall survival (OS) (P = 0.0433), but not the progression-free survival (PFS) Kazuki Takada et al.93, 2022 (P = 0.2251), was significantly longer in patients receiving Statin therapy. Casirivimab, Imdevimab COVID-19 Komodo Health closed claims database was explored to assess the real-world effectiveness of casirivimab and imdevimab (CAS+IMD) versus no COVID-19 antibody treatment among patients diagnosed with COVID-19. The 30-day risk of the composite outcome was 2.1% and 5.2% in the CAS+IMD-treated and CAS+IMD-untreated patients, respectively; equivalent to a 60% lower risk (aHR: 0.40; 95% CI: 0.38 - 0.4) Mohamed Hussein et al.94, 2022 Metformin COVID-19 Data from National COVID Cohort Collaborative (N3C) was used to find association between metformin use was associated with a lower rate of COVID-19 with severity of mild ED or worse (OR: 0.630, 95% CI 0.450 – 0.882, p < 0.05) and a lower rate of COVID-19 with severity of moderate or worse (OR: 0.490, 95% CI 0.336 – 0.715, p < 0.001) in the prediabetes cohort(n = 3136). Lauren E. Chan et al.95, 2022 Nirmatrelvir/ Ritonavir COVID-19 In this retrospective cohort of patients with COVID-19 not requiring supplemental oxygen on admission, initiation of nirmatrelvir–ritonavir is associated or Molnupiravir is significantly lower risks of all-cause mortality and disease progression versus matched controls: Crude incidence rate per 10 000 person-days or mean (95% CI) of nirmatrelvir–ritonavir [(26·47 events [21·34–32·46] HR 0·34 [0·23–0·50], p < 0·0001) and for Molnupiravir [33·85–42·67]; HR 0·48 [95% CI 0·40–0·59], p < 0·0001) respectively. Carlos K H Wong et. al.96, 2022 Monoclonal antibody (mAb) therapy: Casirivimab/ imdevimab/ bamlanivimab COVID-19 There was a significant reduction in hospitalizations in the mAb group compared with the control (1.7% vs 24%; p < 0.005, there were no COVID-19–related deaths in the mAb group compared with 12 (2.7%) in controls (p = 0.024) Jeffrey D Jenks et al.97, 2022 Calcifediol COVID-19 Survival study on a retrospective cohort of 15,968 patients, comprising all COVID-19 patients based on a central registry of EHR (the Andalusian Population Health Database, BPS). Association was stronger for calcifediol (HR: 0.67; 95% CI: 0.50–0.91) than for cholecalciferol (HR: 0.75; 95% CI: 0.61 – 0.91), when prescribed 15 days prior hospitalization. Carlos Loucera et al.98, 2021 mRNA-1273 (Moderna) COVID-19 This analysis included 352,878 recipients of 2 doses of mRNA-1273 matched to 352,878 unvaccinated individuals from Kaiser Permanente Southern California. Vaccine Effectiveness (VE) (99·3% CI) against COVID-19 infection was 87·4% (84·8–89·6%). VE against COVID-19 hospitalization and hospital death was 95·8% (90·7–98·1%) and 97·9% (66·9-99·9%), respectively. Katia J Bruxvoort et al.99, 2021 Bamlanivimab COVID-19 A retrospective case-control study across a healthcare system with 10 hospitals and over 200 inpatient and outpatient sites in the greater Chicago area. Patients who received bamlanivimab had a lower 30-day hospitalization rate compared to those who did not receive the drug: 7.3% of patients who received bamlanivimab compared to 20.0% of patients who did not receive bamlanivimab (RR 0.37, 95% CI: 0.21– 0.64, p <.001 Rebecca N Kumar et al.100, 2021 Bamlanivimab COVID-19 2,335 patients who received single-dose bamlanivimab infusion were compared with a propensity-matched control of 2,335 untreated patients with mild to moderate COVID-19 at Mayo Clinic facilities across 4 states. Treatment with bamlanivimab was associated with a statistically significant lower rate of hospitalization among patients with mild to moderate COVID-19. At day 14 (1.5% vs 3.5%; OR: 0.38), day 21 (1.9% vs 3.9%; OR:0.46), and day 28 (2.5% vs 3.9%; OR: 0.61) Ravindra Ganesh et al.101, 2021 Monoclonal antibody (mAb) therapy: Casirivimab/ imdevimab/ bamlanivimab COVID-19 A total of 2879 infused patients and matched controls were included in the analysis from 6 infusion clinics and multiple emergency departments within the 8 Houston Methodist Hospitals in Houston, Texas. Treatment with Bamlanivimab, Bamlanivimab-Etesevimab, or casirivimab-imdevimab significantly decreased the number of patients who progressed to severe COVID-19 disease and required hospitalization. Among the infused cohort, those who received casirivimab-imdevimab had a significantly decreased rate of admission relative to the other 2 mAb therapy groups (aRR,0.51; p = 0.001). Megan H Cooper, et al.102, 2021 Lopinavir/ Ritonavir COVID-19 Comparing 42 patients admitted in Rui'an People's Hospital who were treated with LPV-r to 5 patients in the control group has shown a significant reduction in time for body temperature normalization, 4.8 days in X.-T. YE et al.103, 2020 the LPV-r group compared to 7.3 days in the control group (p=0.0364). LPV/r-combined therapy helped patients turn negative for nCoV-RNA faster compared to the control group (test group: 7.8±3.09 days vs. control group: 12.0±0.82 days, p = 0.0219) Arbidol-Lopinavir/ Ritonavir (LPV/r) COVID-19 This is a single-center, retrospective cohort study analyzing 33 patients who were diagnosed with laboratory-confirmed COVID-19 at The Fifth Affiliated Hospital of Sun Yat-Sen University. The chest CT scans were improving for 11(69%) of 16 patients in the combination group (Arbidol combined with LPV/r) after seven days, compared with 5(29%) of 17 in the monotherapy (LPV/r alone) group (p < 0.05) Lisi Deng et al.104, 2020 Memantine-Donepezil AD The combined use of Donepezil and Memantine significantly elevates the probability of five-year survival by 0.050 (0.021- 0.078) (6.4%), 0.049 (0.012,-0.085), (6.3%), 0.065 (0.035-0.095) (8.3%) compared to no drug treatment, the Memantine monotherapy, and the Donepezil monotherapy respectively using one of the largest high-quality medical databases, the Oracle RWD. Ehsan Yaghmaei et al.105, 2024 Metformin AD Using generative AI and EHR data from Vanderbilt University Medical Center and the All of Us Research. Metformin is associated with lower AD risk in meta-analysis with (HR: 0.67; CI:0.55-0.81) and Losartan with HR: 0.76; CI: 0.6 - 0.95) Chao Yan et al.106, 2024 Hydroxychloroquine (HCQ) AD Using Medicare claims data for 54,562 propensities score matched cohort, it has been demonstrated that exposure to HCQ reduces risk of incident ADRD in RA patients relative to the active comparator, methotrexate (MTX); HCQ initiators had an 8% lower rate of ADRD compared to MTX initiators (HR 0.92 95% CI: 0.83–1.00) Vijay R. Varma et al.107, 2023 Losartan AD Claims data from Blue Cross Blue Shield Axis suggested Losartan(n=78), Valacyclovir(n=37) and Montelukast(n=42) have been associated with AD incidence and claim frequency with HR: 0.727: CI: 0.54 - 0.97; CI: 0.560 0.37-0.84; CI:0.617, 0.42-0.91, respectively Eric Hu et al.108, 2023 Pioglitazone AD The pharmacoepidemiology study utilized the MarketScan Medicare Supplementary database from 2012 to 2017 and found that pioglitazone uses are Jiansong Fang et al.23, 2022 significantly associated with decreased risk of AD HR: 0.916; 95% CI 0.861–0.974 Dexamethasone AD Two independent EMR systems UCSF and Mount Sinai were used to perform deep clinical phenotyping and network analysis to gain insight into clinical characteristics and sex-specific clinical associations in AD. Dexamethasone has been identified as enriched in control patients(non-AD), suggesting a potential protective role in Alzheimer's disease Alice S. Tang et al.109, 2022 Multiple drug AD This study identified 8 new indications of approved drugs for AD by emulating 430,000 trials from two large-scale RWD warehouses (one Florida and MarketScan), covering both EHR and general claims, spanning more than 10 years. Chengxi Zang et al.110, 2022 Pantoprazole AD Associated with a 43% reduced risk of AD [hazard ratio (HR) 0.57, 95% confidence interval (CI) 0.56-0.59] in OneFlorida compared with an 8% reduced risk of AD (HR 0.92; 95% CI 0.89-0.94) in MarketScan. Gabapentin AD Associated with a 24% reduced risk of AD (HR 0.76, 95% CI 0.73-0.78) in OneFlorida and a 22% reduced risk of AD (HR 0.78; 95% CI 0.76-0.81) in MarketScan Atorvastatin AD Associated with a 21% reduced risk of AD (HR 0.79, 95% CI 0.77-0.81) in OneFlorida and a 12% reduced risk of AD (HR 0.88; 95% CI 0.85-0.90) in MarketScan Albuterol AD The albuterol was associated with a consistent 22% reduced risk of AD (HR 0.78, 95% CI 0.74-0.83) in OneFlorida and a 22% reduced risk of AD (HR 0.78;95% CI 0.76-0.80) in MarketScan Fluticasone AD Fluticasone was associated with a consistent 10% reduced risk of AD (HR 0.90, 95% CI 0.84-0.94) in OneFlorida and a 14% reduced risk of AD (HR 0.86; 95% CI 0.83-0.90) in MarketScan Amoxicillin AD Associated with a 12% reduced risk of AD (HR 0.88, 95% CI 0.82-0.95) in OneFlorida and a 7% reduced risk of AD (HR 0.93;95% CI 0.90-0.96) in MarketScan Omeprazole AD Associated with a 12% reduced risk of AD (HR 0.88, 95% CI 0.85-0.91) in OneFlorida+ and an 8% reduced risk of AD (HR 0.92; 95% CI 0.88-0.94) in MarketScan Bumetanide AD This study conducted Experimental and computational drug repurposing to treat apolipoprotein (apo) E4-related AD using data from UCSF and MSHS. Bumetanide exposure is associated with a significantly lower AD prevalence in individuals over the age of 65. Alice Taubes et al.29, 2021 Statin AD Claims from 288,515 patients, aged 45 years and older, without prior history of NDD or neurological surgery, were surveyed, 144,214 patients exposed to Statin therapies showed lower incidence of Alzheimer's disease (1.10% vs 2.37%; relative risk (RR): 0.4643; 95% CI: 0.44-0.49; p <.001) Torrandell-Haro, G. et al.111, 2020 References: 1. Wei, W.-Q. et al. Leveraging Generative AI to Prioritize Drug Repurposing Candidates: Validating Identified Candidates for Alzheimer’s Disease in Real-World Clinical Datasets. Res Sq rs.3.rs-3125859 (2023) doi:10.21203/rs.3.rs-3125859/v1. 2. Wu, P. et al. Integrating gene expression and clinical data to identify drug repurposing candidates for hyperlipidemia and hypertension. Nat Commun 13, 46 (2022). 3. Yee, S. W. et al. Drugs in COVID-19 Clinical Trials: Predicting Transporter-Mediated Drug-Drug Interactions Using In Vitro Assays and Real-World Data. Clinical Pharmacology & Therapeutics 110, 108–122 (2021). 4. Shuey, M. M. et al. A genetically supported drug repurposing pipeline for diabetes treatment using electronic health records. eBioMedicine 94, 104674 (2023). 5. Deputy, N. P. et al. Vaccine Effectiveness of JYNNEOS against Mpox Disease in the United States. N Engl J Med 388, 2434–2443 (2023). 6. Deligiorgi, M. V. & Trafalis, D. T. Repurposing denosumab in lung cancer beyond counteracting the skeletal related events: an intriguing perspective. Expert Opinion on Biological Therapy 20, 1331–1346 (2020). 7. Minchom, A. et al. Amivantamab compared with real-world therapies in patients with advanced non-small cell lung cancer harboring EGFR exon 20 insertion mutations who progressed after platinum-based chemotherapy. Lung Cancer 168, 74–82 (2022). 8. Ling, A. Y. et al. Transporting observational study results to a target population of interest using inverse odds of participation weighting. PLOS ONE 17, e0278842 (2022). 9. Waterhouse, D. et al. Real-world outcomes of immunotherapy–based regimens in first-line advanced non-small cell lung cancer. Lung Cancer 156, 41–49 (2021). 10. Roeker, L. E. et al. Real-world comparative effectiveness of acalabrutinib and ibrutinib in patients with chronic lymphocytic leukemia. Blood Advances 7, 4291–4301 (2023). 11. Tan, K. et al. Emulating Control Arms for Cancer Clinical Trials Using External Cohorts Created From Electronic Health Record-Derived Real-World Data. Clinical Pharmacology & Therapeutics 111, 168–178 (2022). 12. George, D. J. et al. Treatment Patterns and Outcomes in Patients With Metastatic Castration-resistant Prostate Cancer in a Real-world Clinical Practice Setting in the United States. Clinical Genitourinary Cancer 18, 284–294 (2020). 13. Khozin, S. et al. Real-world progression, treatment, and survival outcomes during rapid adoption of immunotherapy for advanced non–small cell lung cancer. Cancer 125, 4019–4032 (2019). 14. Abstract 4137570: Atherosclerotic Cardiovascular Disease Risks in Children: An electronic health record data analytics approach | Circulation. https://www-ahajournals-org.proxy1.cl.msu.edu/doi/abs/10.1161/circ.150.suppl_1.4137570. 15. Underberger, D., Boell, K., Orr, J., Siegrist, C. & Hunt, S. Collaboration to Improve Colorectal Cancer Screening Using Machine Learning. NEJM Catalyst 3, CAT.21.0170 (2022). 16. Smelser, D. T. et al. Population risk factor estimates for abdominal aortic aneurysm from electronic medical records: a case control study. BMC Cardiovasc Disord 14, 1–8 (2014). 17. Fazio-Eynullayeva, E. et al. Real-world healthcare resource utilization of Alzheimer’s disease in the early and advanced stages: a retrospective cohort study. Journal of Medical Economics 28, 81–88 (2025). 18. Prajapati, G., Das, A., Sun, Y. & Fonseca, E. Hospitalization Among Patients Treated With Molnupiravir: A Retrospective Study of Administrative Data. Clinical Therapeutics 45, 957–964 (2023). 19. Zhou, M., Zheng, C. & Xu, R. Combining phenome-driven drug-target interaction prediction with patients’ electronic health records-based clinical corroboration toward drug discovery. Bioinformatics 36, i436–i444 (2020). 20. Ozery-Flato, M., Goldschmidt, Y., Shaham, O., Ravid, S. & Yanover, C. Framework for identifying drug repurposing candidates from observational healthcare data. JAMIA Open 3, 536–544 (2020). 21. Laifenfeld, D. et al. Emulated Clinical Trials from Longitudinal Real-World Data Efficiently Identify Candidates for Neurological Disease Modification: Examples from Parkinson’s Disease. Front. Pharmacol. 12, (2021). 22. Zang, C. et al. High-throughput target trial emulation for Alzheimer’s disease drug repurposing with real-world data. Nat Commun 14, 8180 (2023). 23. Fang, J. et al. Artificial intelligence framework identifies candidate targets for drug repurposing in Alzheimer’s disease. Alz Res Therapy 14, 1–23 (2022). 24. Liu, R., Wei, L. & Zhang, P. A deep learning framework for drug repurposing via emulating clinical trials on real-world patient data. Nature machine intelligence 3, 68 (2021). 25. Xu, H. et al. Validating drug repurposing signals using electronic health records: a case study of metformin associated with reduced cancer mortality. Journal of the American Medical Informatics Association 22, 179–191 (2015). 26. Wu, Y. et al. Discovery of Noncancer Drug Effects on Survival in Electronic Health Records of Patients With Cancer: A New Paradigm for Drug Repurposing. JCO Clin Cancer Inform 3, 1–9 (2019). 27. Ryu, A. J. et al. Artificial intelligence-enabled screening strategy for drug repurposing in monoclonal gammopathy of undetermined significance. Blood Cancer J. 13, 1–6 (2023). 28. Ganesh, R. et al. Association of Intravenous Bamlanivimab Use with Reduced Hospitalization, Intensive Care Unit Admission, and Mortality in Patients with Mild to Moderate COVID-19. medRxiv 2021.05.23.21257670 (2021) doi:10.1101/2021.05.23.21257670. 29. Taubes, A. et al. Experimental and real-world evidence supporting the computational repurposing of bumetanide for APOE4-related Alzheimer’s disease. Nat Aging 1, 932–947 (2021). 30. Shameer, K. et al. Systematic analyses of drugs and disease indications in RepurposeDB reveal pharmacological, biological and epidemiological factors influencing drug repositioning. Briefings in Bioinformatics 19, 656–678 (2018). 31. Eskandari, A. et al. Retrospective analysis of demographic factors in COVID-19 patients entering the Mount Sinai Health System. PLOS ONE 16, e0254707 (2021). 32. Tang, A. S. et al. Deep phenotyping of Alzheimer’s disease leveraging electronic medical records identifies sex-specific clinical associations. Nat Commun 13, 675 (2022). 33. Chen, Z. et al. Exploring the feasibility of using real-world data from a large clinical data research network to simulate clinical trials of Alzheimer’s disease. npj Digit. Med. 4, 1–9 (2021). 34. Duan, R. et al. Leverage Real-world Longitudinal Data in Large Clinical Research Networks for Alzheimer’s Disease and Related Dementia (ADRD). AMIA Annu Symp Proc 2020, 393–401 (2021). 35. Prosperi, M. et al. Causal AI with Real World Data: Do Statins Protect from Alzheimer’s Disease Onset? ICMHI 2021 (2021) 2021, 296–303 (2021). 36. Yaghmaei, E. et al. Combined use of Donepezil and Memantine increases the probability of five-year survival of Alzheimer’s disease patients. Commun Med 4, 1–8 (2024). 37. DeCuir, J. et al. Identification and description of patients with multisystem inflammatory syndrome in adults associated with SARS-CoV-2 infection using the Premier Healthcare Database. Epidemiology & Infection 150, e26 (2022). 38. McGuinness, L. A. et al. Association of lipid-regulating drugs with dementia and related conditions: an observational study of data from the Clinical Practice Research Datalink. 2021.10.21.21265131 Preprint at https://doi.org/10.1101/2021.10.21.21265131 (2021). 39. Walker, V. M., Davies, N. M., Jones, T., Kehoe, P. G. & Martin, R. M. Can commonly prescribed drugs be repurposed for the prevention or treatment of Alzheimer’s and other neurodegenerative diseases? Protocol for an observational cohort study in the UK Clinical Practice Research Datalink. BMJ Open 6, e012044 (2016). 40. Long-Term Metformin Use Is Associated With Decreased Risk of Breast Cancer | Diabetes Care | American Diabetes Association. https://diabetesjournals-org.proxy1.cl.msu.edu/care/article/33/6/1304/27526/Long-Term-Metformin-Use-Is-Associated-With. 41. Cardwell, C. R., Mc Menamin, Ú., Hughes, C. M. & Murray, L. J. Statin Use and Survival from Lung Cancer: A Population-Based Cohort Study. Cancer Epidemiology, Biomarkers & Prevention 24, 833–841 (2015). 42. Karasneh, R. A., Murray, L. J., Hughes, C. M. & Cardwell, C. R. Digoxin Use After Diagnosis of Colorectal Cancer and Survival: A Population-Based Cohort Study. Cancer Epidemiology, Biomarkers & Prevention 24, 1804–1807 (2015). 43. Statin use and risk of pancreatic cancer: Results from a large, clinic-based case-control study - Walker - 2015 - Cancer - Wiley Online Library. https://acsjournals-onlinelibrary-wiley-com.proxy1.cl.msu.edu/doi/full/10.1002/cncr.29256. 44. Wang, W., Wang, C.-Y., Wang, S.-I. & Wei, J. C.-C. Long-term cardiovascular outcomes in COVID-19 survivors among non-vaccinated population: A retrospective cohort study from the TriNetX US collaborative networks. eClinicalMedicine 53, 101619 (2022). 45. Wang, L., Berger, N. A., Kaelber, D. C. & Xu, R. Association of GLP-1 Receptor Agonists and Hepatocellular Carcinoma Incidence and Hepatic Decompensation in Patients With Type 2 Diabetes. Gastroenterology 0, (2024). 46. Wang, W. et al. Association of semaglutide with risk of suicidal ideation in a real-world cohort. Nat Med 30, 168–176 (2024). 47. Rodriguez, P. J. et al. Comparative Effectiveness of Semaglutide and Tirzepatide for Weight Loss in Adults with Overweight and Obesity in the US: A Real-World Evidence Study. 2023.11.21.23298775 Preprint at https://doi.org/10.1101/2023.11.21.23298775 (2023). 48. Hsieh, K. et al. Drug repurposing for COVID-19 using graph neural network and harmonizing multiple evidence. Sci Rep 11, 23179 (2021). 49. Bai, L. et al. Computational drug repositioning of atorvastatin for ulcerative colitis. Journal of the American Medical Informatics Association 28, 2325–2335 (2021). 50. Liao, Y. Identification of potential new COVID-19 treatments via RWD-driven drug repurposing. Sci Rep 13, 14586 (2023). 51. Bejan, C. A. et al. DrugWAS: Drug-wide Association Studies for COVID-19 Drug Repurposing. Clinical Pharmacology & Therapeutics 110, 1537–1546 (2021). 52. The “All of Us” Research Program. N Engl J Med 381, 668–676 (2019). 53. Flatiron. https://medschool.cuanschutz.edu/colorado-cancer-center/research/flatiron. 54. IBM MarketScan Research Databases Access. Population Health and Health Equity https://pophealth.ucsf.edu/ibm-marketscan-research-databases-access. 55. Discover. Mayo Clinic Platform https://www.mayoclinicplatform.org/discover/. 56. Chargeback Policy | Mount Sinai Data Warehouse. https://labs.icahn.mssm.edu/msdw/chargeback-policy/. 57. Woo, H.-T., Jeong, S.-Y. & Shin, A. The association between prescription drugs and colorectal cancer prognosis: a nationwide cohort study using a medication-wide association study. BMC Cancer 23, 1–11 (2023). 58. Wüster, J., Heiland, M., Nahles, S., Preissner, R. & Preissner, S. Statin Medication Improves Five-Year Survival Rates in Patients with Head and Neck Cancer: A Retrospective Case-Control Study of about 100,000 Patients. Cancers 15, 3093 (2023). 59. Lu, M.-C. et al. The Association between Statins and Liver Cancer Risk in Patients with Heart Failure: A Nationwide Population-Based Cohort Study. Cancers 15, 2959 (2023). 60. Klein-Brill, A., Amar-Farkash, S., Lawrence, G., Collisson, E. A. & Aran, D. Comparison of FOLFIRINOX vs Gemcitabine Plus Nab-Paclitaxel as First-Line Chemotherapy for Metastatic Pancreatic Ductal Adenocarcinoma. JAMA Netw Open 5, e2216199 (2022). 61. Go, S., Lee, D. Y., Choi, W.-I. & Jeong, J. Association between use of antacid medications (proton pump inhibitors and histamine-2 receptor antagonists) and the incidence of lung cancer: A population-based cohort analysis. Medicine 101, e30399 (2022). 62. Seo, S. I. et al. Incidence and Survival Outcomes of Colorectal Cancer in Long-Term Metformin Users with Diabetes: A Population-Based Cohort Study Using a Common Data Model. Journal of Personalized Medicine 12, 584 (2022). 63. Min, Y. et al. Association between Statin Use and Survival in Cancer Patients with Brain Metastasis: Retrospective Analysis from the Chinese Population. Pharmaceuticals 15, 1474 (2022). 64. Shami, J. J. P. et al. Safety and effectiveness of low-dose aspirin for the prevention of gastrointestinal cancer in adults without atherosclerotic cardiovascular disease: a population-based cohort study. BMJ Open 12, e050510 (2022). 65. Waterhouse, D. et al. Real-World Outcomes Among Crizotinib-Treated Patients with ROS1-Positive Advanced Non-Small-Cell Lung Cancer: A Community Oncology-Based Observational Study. Target Oncol 17, 25–33 (2022). 66. Ng, L. et al. Repurposing DPP-4 Inhibitors for Colorectal Cancer: A Retrospective and Single Center Study. Cancers 13, 3588 (2021). 67. Chen, P.-H. et al. The Effect of Statins in Cancer Risk Reduction in Patients on Dialysis: A Population-Based Case-Control Study. Journal of Clinical Medicine 10, 5602 (2021). 68. Brancher, S. et al. Metformin use and lung cancer survival: a population-based study in Norway. Br J Cancer 124, 1018–1025 (2021). 69. Kim, S. Y. et al. Evaluation of the relationship between previous statin use and thyroid cancer using Korean National Health Insurance Service-Health Screening Cohort data. Sci Rep 11, 7912 (2021). 70. Raymakers, A. J. N. et al. Statin use and lung cancer risk in chronic obstructive pulmonary disease patients: a population-based cohort study. Respiratory Research 21, (2020). 71. Lin, H.-M. D., Vora, P., Soriano-Gabarró, M. & Chan, K. A. Association Between Low-Dose Aspirin Use and Colorectal Cancer Incidence in Taiwan. JAMA Network Open 3, e2026494 (2020). 72. Cheung, K. S. et al. Statins Were Associated with a Reduced Gastric Cancer Risk in Patients with Eradicated Helicobacter Pylori Infection: A Territory-Wide Propensity Score Matched Study. Cancer Epidemiology, Biomarkers & Prevention 29, 493–499 (2020). 73. You, H.-S. et al. Inverse Association between Statin Use and Stomach Cancer Incidence in Individuals with Hypercholesterolemia, from the 2002–2015 NHIS-HEALS Data. International Journal of Environmental Research and Public Health 17, 1054 (2020). 74. García Rodríguez, L. A., Soriano-Gabarró, M., Vora, P. & Cea Soriano, L. Low-dose aspirin and risk of gastric and oesophageal cancer: A population-based study in the United Kingdom using The Health Improvement Network. International Journal of Cancer 147, 2394–2404 (2020). 75. Matsuo, K. et al. Association of Low-Dose Aspirin and Survival of Women With Endometrial Cancer. Obstetrics & Gynecology 128, 127 (2016). 76. Lin, T.-P., Fan, Y.-H., Chen, Y.-C. & Huang, W. J. S. Digoxin lowers the incidence of prostate cancer: A nationwide population-based study. Journal of the Chinese Medical Association 83, 377 (2020). 77. Li, P.-C. et al. Aspirin associated with a decreased incidence of uterine cancer: A retrospective population-based cohort study. Medicine 99, e21446 (2020). 78. Survival benefit of statins in older patients with rectal cancer: A Swedish population-based cohort study - ScienceDirect. https://www-sciencedirect-com.proxy1.cl.msu.edu/science/article/pii/S1879406818302327?via%3Dihub. 79. Tran, K. T. et al. Statin use and risk of liver cancer: Evidence from two population-based studies. International Journal of Cancer 146, 1250–1260 (2020). 80. Dulskas, A. et al. Metformin increases cancer specific survival in colorectal cancer patients-National cohort study. Cancer Epidemiol 62, 101587 (2019). 81. Busby, J. et al. The role of 5α-reductase inhibitors in gastro-oesophageal cancer risk: A nested case-control study. Pharmacoepidemiology and Drug Safety 29, 48–56 (2020). 82. Hsieh, Y.-H. et al. Antipsychotic use is inversely associated with gastric cancer risk: A nationwide population-based nested case-control study. Cancer Medicine 8, 4484–4496 (2019). 83. Akinwunmi, B., Vitonis, A. F., Titus, L., Terry, K. L. & Cramer, D. W. Statin Therapy and Association with Ovarian Cancer risk in the New England Case Control (NEC) Study. Int J Cancer 144, 991–1000 (2019). 84. Choi, J. H. et al. The association between use of statin or aspirin and pancreatic ductal adenocarcinoma: A nested case-control study in a Korean nationwide cohort. Cancer Medicine 8, 7419–7430 (2019). 85. Wu, Y. et al. Discovery of Noncancer Drug Effects on Survival in Electronic Health Records of Patients With Cancer: A New Paradigm for Drug Repurposing. JCO Clinical Cancer Informatics 1–9 (2019) doi:10.1200/CCI.19.00001. 86. Wan, E. Y. F. et al. Effectiveness of Molnupiravir and Nirmatrelvir–Ritonavir in Hospitalized Patients With COVID-19. Ann Intern Med 176, 505–514 (2023). 87. Ramos-Rincón, J. M. et al. A retrospective real-world study of early short-course remdesivir in non-hospitalized COVID-19 patients at high risk for progression: low rate of hospitalization or death, regardless of immunocompetence status. Front Pharmacol 14, 1218650 (2023). 88. Evans, A. et al. Real-world effectiveness of molnupiravir, nirmatrelvir-ritonavir, and sotrovimab on preventing hospital admission among higher-risk patients with COVID-19 in Wales: A retrospective cohort study. Journal of Infection 86, 352–360 (2023). 89. Zeng, G., Wang, L., Li, J. & Zhang, Z. Real-world effectiveness of Azvudine versus nirmatrelvir-ritonavir in hospitalized patients with COVID-19. Journal of Medical Virology 95, e28836 (2023). 90. Loucera, C. et al. Real-world evidence with a retrospective cohort of 15,968 COVID-19 hospitalized patients suggests 21 new effective treatments. Virol J 20, 226 (2023). 91. Petrakis, V., Rafailidis, P., Trypsianis, G., Papazoglou, D. & Panagopoulos, P. The Antiviral Effect of Nirmatrelvir/Ritonavir during COVID-19 Pandemic Real-World Data. Viruses 15, 976 (2023). 92. Wang, W. et al. Real-world effectiveness of steroids in severe COVID-19: a retrospective cohort study. BMC Infect Dis 22, 1–7 (2022). 93. Takada, K. et al. A propensity score-matched analysis of the impact of statin therapy on the outcomes of patients with non-small-cell lung cancer receiving anti-PD-1 monotherapy: a multicenter retrospective study. BMC Cancer 22, 1–10 (2022). 94. Hussein, M. et al. Real-world effectiveness of casirivimab and imdevimab among patients diagnosed with COVID-19 in the ambulatory setting: a retrospective cohort study using a large claims database. BMJ Open 12, e064953 (2022). 95. Chan, L. E. et al. Metformin is associated with reduced COVID-19 severity in patients with prediabetes. Diabetes Research and Clinical Practice 194, 110157 (2022). 96. Wong, C. K. H. et al. Real-world effectiveness of early molnupiravir or nirmatrelvir–ritonavir in hospitalised patients with COVID-19 without supplemental oxygen requirement on admission during Hong Kong’s omicron BA.2 wave: a retrospective cohort study. The Lancet Infectious Diseases 22, 1681–1693 (2022). 97. Jenks, J. D. et al. Early Monoclonal Antibody Administration Can Reduce Both Hospitalizations and Mortality in High-Risk Outpatients with COVID-19. Clin Infect Dis ciab522 (2021) doi:10.1093/cid/ciab522. 98. Loucera, C. et al. Real world evidence of calcifediol or vitamin D prescription and mortality rate of COVID-19 in a retrospective cohort of hospitalized Andalusian patients. Sci Rep 11, 23380 (2021). 99. Bruxvoort, K. J. et al. Real-world effectiveness of the mRNA-1273 vaccine against COVID-19: Interim results from a prospective observational cohort study. The Lancet Regional Health - Americas 6, 100134 (2022). 100. Kumar, R. N. et al. Real-World Experience of Bamlanivimab for Coronavirus Disease 2019 (COVID-19): A Case-Control Study. Clinical Infectious Diseases 74, 24–31 (2022). 101. Ganesh, R. et al. Association of Intravenous Bamlanivimab Use with Reduced Hospitalization, Intensive Care Unit Admission, and Mortality in Patients with Mild to Moderate COVID-19. 2021.05.23.21257670 Preprint at https://doi.org/10.1101/2021.05.23.21257670 (2021). 102. Cooper, M. H. et al. Real-world Assessment of 2879 COVID-19 Patients Treated With Monoclonal Antibody Therapy: A Propensity Score–Matched Cohort Study. Open Forum Infectious Diseases 8, ofab512 (2021). 103. gianni. Clinical efficacy of lopinavir/ritonavir in the treatment of Coronavirus disease 2019. European Review https://www.europeanreview.org/article/20706 (2020). 104. Deng, L. et al. Arbidol combined with LPV/r versus LPV/r alone against Corona Virus Disease 2019: A retrospective cohort study. Journal of Infection 81, e1–e5 (2020). 105. Yaghmaei, E. et al. Combined use of Donepezil and Memantine increases the probability of five-year survival of Alzheimer’s disease patients. Commun Med 4, 1–8 (2024). 106. Yan, C. et al. Leveraging generative AI to prioritize drug repurposing candidates for Alzheimer’s disease with real-world clinical validation. npj Digit. Med. 7, 1–6 (2024). 107. Varma, V. R. et al. Hydroxychloroquine lowers Alzheimer’s disease and related dementias risk and rescues molecular phenotypes related to Alzheimer’s disease. Mol Psychiatry 28, 1312–1326 (2023). 108. Hu, E., Li, T. S., Wineinger, N. E. & Su, A. I. Association study between drug prescriptions and Alzheimer’s disease claims in a commercial insurance database. Alz Res Therapy 15, 1–9 (2023). 109. Tang, A. S. et al. Deep phenotyping of Alzheimer’s disease leveraging electronic medical records identifies sex-specific clinical associations. Nat Commun 13, 675 (2022). 110. Zang, C. et al. High-Throughput Clinical Trial Emulation with Real World Data and Machine Learning: A Case Study of Drug Repurposing for Alzheimer’s Disease. 2022.01.31.22270132 Preprint at https://doi.org/10.1101/2022.01.31.22270132 (2022). 111. Torrandell-Haro, G. et al. Statin therapy and risk of Alzheimer’s and age-related neurodegenerative diseases. Alzheimers Dement (N Y) 6, e12108 (2020).",
  "text_length": 165277
}