{
  "id": "http://arxiv.org/abs/2505.24724v1",
  "title": "Talking Transactions: Decentralized Communication through Ethereum Input\n  Data Messages (IDMs)",
  "summary": "Can you imagine, blockchain transactions can talk! In this paper, we study\nhow they talk and what they talk about. We focus on the input data field of\nEthereum transactions, which is designed to allow external callers to interact\nwith smart contracts. In practice, this field also enables users to embed\nnatural language messages into transactions. Users can leverage these Input\nData Messages (IDMs) for peer-to-peer communication. This means that, beyond\nEthereum's well-known role as a financial infrastructure, it also serves as a\ndecentralized communication medium.\n  We present the first large-scale analysis of Ethereum IDMs from the genesis\nblock to February 2024 (3134 days). We filter IDMs to extract 867,140\ntransactions with informative IDMs and use LLMs for language detection. We find\nthat English (95.4%) and Chinese (4.4%) dominate the use of natural languages\nin IDMs. Interestingly, English IDMs center on security and scam warnings (24%)\nwith predominantly negative emotions, while Chinese IDMs emphasize emotional\nexpression and social connection (44%) with a more positive tone. We also\nobserve that longer English IDMs often transfer high ETH values for\nprotocol-level purposes, while longer Chinese IDMs tend to involve symbolic\ntransfer amounts for emotional intent. Moreover, we find that the IDM\nparticipants tend to form small, loosely connected communities (59.99%). Our\nfindings highlight culturally and functionally divergent use cases of the IDM\nchannel across user communities. We further examine the security relevance of\nIDMs in on-chain attacks. Many victims use them to appeal to attackers for fund\nrecovery. IDMs containing negotiations or reward offers are linked to higher\nreply rates. We also analyze IDMs' regulatory implications. Their misuse for\nabuse, threats, and sexual solicitation reveals the urgent need for content\nmoderation and regulation in decentralized systems.",
  "authors": [
    "Xihan Xiong",
    "Zhipeng Wang",
    "Qin Wang",
    "Endong Liu",
    "Pascal Berrang",
    "William Knottenbelt"
  ],
  "published": "2025-05-30T15:47:13Z",
  "updated": "2025-05-30T15:47:13Z",
  "categories": [
    "cs.CR"
  ],
  "pdf_url": "http://arxiv.org/pdf/2505.24724v1",
  "full_text": "arXiv:2505.24724v1 [cs.CR] 30 May 2025Talking Transactions: Decentralized Communication through Ethereum Input Data Messages (IDMs) Xihan Xiong Imperial College LondonZhipeng Wang/enve♀e Imperial College LondonQin Wang CSIRO Data61 Endong Liu University of BirminghamPascal Berrang University of BirminghamWilliam Knottenbelt Imperial College London ABSTRACT Can you imagine, blockchain transactions can talk! In this paper, we empirically study how they talk and what they talk about. We focus on the input data field of Ethereum transactions, which is designed to allow external callers to interact with smart contracts. In practice, this field also enables users to embed natural language messages into transactions. Users can leverage these Input Data Messages (IDMs) for peer-to-peer communication. This means that, beyond Ethereum’s well-known role as a financial infrastruc- ture, it also serves as a decentralized communication medium. We present the first large-scale and systematic analysis of Ethereum IDMs from the genesis block to February 2024 (3134 days, cover- ing 87%+ historical transactions to date). We filter IDMs to extract 867,140 transactions with informative text messages and use LLMs for language detection. We find that English ( 95.4%) and Chinese (4.4%) dominate the use of natural languages in IDMs. Interestingly, English IDMs center on security and scam warnings ( 24%) with predominantly negative emotions, while Chinese IDMs emphasize emotional expression and social connection ( 44%) with a more pos- itive tone. We also observe that longer English IDMs often transfer high ETH values for protocol-level purposes, while longer Chinese IDMs tend to involve symbolic transfer amounts for emotional in- tent. Moreover, we find that, unlike traditional social networks, the IDM participants tend to form small, loosely connected commu- nities ( 59.99%). Our findings highlight culturally and functionally divergent use cases of the IDM channel across user communities. We further examine the security relevance of IDMs in on-chain attacks. Many victims use them to appeal to attackers for fund recovery. IDMs containing negotiations or reward offers are linked to higher reply rates. We also analyze IDMs’ moderation and reg- ulation implications. Their misuse for abuse, threats, and sexual solicitation reveals the urgent need for content moderation, regula- tion, and governance in decentralized systems. 1 INTRODUCTION The Bitcoin whitepaper [ 1] originally framed blockchain technol- ogy as a peer-to-peer electronic payment system. This foundational vision was significantly extended by Ethereum [ 2], which is a quasi-Turing-complete blockchain that enables smart contracts. Smart contracts are self-executing programs that operate on the blockchain when predefined conditions are met. Ethereum allows users to interact with these contracts by specifying parameters in theinput data field of transactions, thereby supporting a wide range of decentralized applications beyond simple payments. /enve♀eCorresponding author, zhipeng.wang0x01@gmail.com.Interestingly, in practice, this inputdata field can be repurposed by users to embed arbitrary natural language messages directly into the transactions. This allows the Ethereum blockchain to function as a decentralized communication medium. Much like traditional messaging platforms, users can send messages, convey opinions, and exchange information via Input Data Messages (IDMs). A notable example is the Bybit Exploiter [ 5], one of the most notorious actors in blockchain history, who stole over 1.4b USD from Bybit in February 2025. Since then, the exploiter ad- dress received more than 4,100IDMs from the public, where angry victims demand the return of stolen funds and oppor- tunistic bystanders plead for a share of the stolen assets. The Etherem IDM volume has increased significantly since 2018 (see Figure 3). Blockchain users’ active adoption of IDMs signals a paradigm shift – blockchain is no longer merely a “value internet” where users engage in financial activities, but also a socio-technical infrastructure for users to talk in a decentralized manner. Although IDMs have been introduced and widely used since the inception of Ethereum in 2015, this beyond-finance functionality of blockchains has remained underexplored in academia during the last decade. To address this gap, this paper presents the first large-scale and systematic study of Ethereum IDMs (see Figure 1). By adopting a “transaction-as-communication” perspective, we empirically ana- lyze how users are talking and what they are talking about. We summarize our main contributions as follows: •Large-Scale IDMs Analysis (§3 and §4). We conduct the first large-scale analysis of Ethereum IDMs from the inception of Ethereum in July 2015 to February 2024, covering 87%+ of histor- ical transactions as of May 2025. We then filter IDMs to extract 867,140 transactions with informative text messages. These in- volve 59,795 senders and 154,411 receivers. We find that these IDMs occupy 0.12GB of an Ethereum full node storage. Our descriptive analysis shows that 51.3%of IDMs contain only struc- tured tokens (e.g., wallet address), 42.2%contain only natural language, and 6.5%contain both. We find that Chinese and Eng- lish together represent 99.8%of all IDMs with natural languages. •Semantic Analysis (§5). Our topic analysis identifies 12 main topics with 48 subtopics. We find that English IDMs are concen- trated in Security & Incidents (24%), while Chinese IDMs center onSocial & Emotional Expression (44%). For sentiment analysis, we develop a taxonomy with three polarities and 16 emotion cat- egories. We discover that negative emotions (e.g., Fear) dominate the English IDMs, while positive emotions (e.g., Joy) dominate Chinese IDMs. This reflects two contrasting communicative log- ics: one driven by risk and alert, the other by social presence. Ethereum Node crawl Raw Input Data0x756e646566696e... 0x686f7477616c6c6... 0x524544204e564c... 0x20180721082157... 0xe69c89e69588e8... 0x686f7477616c6c7... 0x00500072006500...hotwallet drain fee... ^{o:!... 恭喜！您的区块链版权认证已成功... C'est La V ie... Hey! 🦊... LIFE is Short,but LOVE... %'#...hotwallet drain fee... Hi, I'll give you money... 恭喜！您的区块链版权认证已成功... C'est La V ie... Hey! 🦊... LIFE is Short,but LOVE... Hello. My friend. You...Semantic Analysis Network Analysis Cost Analysisfilter Decoded IDM Informative IDMLLM decodeFigure 1: Pipeline of Ethereum IDM analysis. •Cost Analysis (§6). We analyze IDM transaction value and cost. We find that longer English IDMs are often associated with higher ETH transfers for functional or protocol-level purposes. In con- trast, longer Chinese IDMs tend to involve symbolic transfer amounts (e.g., 5.20 ETH) for emotional intent. We also find that gas costs per byte fell sharply after EIP-2028, yet IDM volume did not rise until mid-2023. This suggests that IDM adoption is more likely driven by social usage than by cost efficiency. •Network Analysis (§7). We conduct a network analysis of IDM participants and identify 26,048communities. Most communities (59.99%) are small and loosely connected, with low reciprocity and clustering coefficient. Only a few large communities dom- inate message traffic, often driven by promotional or warning- oriented broadcasters. The largest community accounts for 34.9% of all IDMs issued. In contrast, small communities prefer self- expression and social connection. This highlights the coexistence of information hubs and peripheral emotional expression. •Security Relevance (§8). We examine the relevance of IDMs to on-chain security incidents. Many victims use IDMs to reach out to attackers: pleading for fund returns, issuing threats, offering rewards, or proposing negotiations. Our analysis suggests that negotiation and reward offers are more likely to increase the reply rate. Beyond victim communication, IDMs are also used to broadcast warnings about scams. This suggests that IDMs help enable collective safeguarding in the Ethereum community. •Regulation and Moderation Implications (§9). We analyze IDMs classified under the topic of Toxic/Abusive Content. English IDMs contain significantly more toxic content than Chinese ones, particularly concentrated in Verbal Abuse & Profanity. Most of these messages are linked to negative emotions, especially Hostil- ityandAnger. Our findings reveal that blockchain messaging can be misused for severe forms of abuse and harassment. While such content would typically be removed in Web2 platforms through content moderation systems, blockchain ecosystems lack such mechanisms. This underscores the need for regulatory attention and content governance in decentralized environments. 2 SYSTEM MODEL IDM Transaction Metadata. We consider the transactions in Ethereum, a Virtual Machine (EVM)-compatible blockchain. A stan- dard Ethereum transaction includes a variety of fields that enableboth coin transfers and smart contract interactions. We list the transaction fields that are relevant to IDMs analysis as follows: •Transaction Hash: A 32-byte unique ID derived from a transac- tion’s contents, used for referencing or retrieval. •Block Number: The height of the block in which the transaction was confirmed and executed. This provides the timestamp for events or messages in the transaction. •From Address: The Externally Owned account (EOA) that initiates the transaction. This address is the sender of a transaction and is responsible for paying the gas fees to execute the transaction. •To Address: The recipient address, which may be either another EOA or a smart contract. In the context of IDMs, we focus solely on cases where the recipient address is an EOA. •Value: The amount of ETHtransferred from the transaction sender to the recipient when the transaction is confirmed. •Input Data: Theinput data is an optional field that enables encoding function calls and parameters for smart contracts. In our context, it is often repurposed by IDM senders to embed human-readable messages in hexadecimal or UTF-8 format. IDM Transaction Workflow. To issue a transaction containing an IDM, the sender follows the same process as sending a typical Ethereum transaction, with a key distinction: instead of adding the parameters in the inputdata field to interact with a smart contract, the sender includes a message. This IDM is typically formatted in hexadecimal or UTF-8 encoding and can be decoded to human- readable messages. The transaction is then broadcast to the network, executed and confirmed by validators, and permanently recorded on the blockchain once included in a block. The transaction recipient, and anyone who has access to the blockchain data, can extract and decode the IDM content from the transaction input data. Challenges of IDM Analysis. Ethereum IDMs present unique analytical challenges due to the following features. •Domain-specific: IDM content often reflects blockchain-specific concepts or operations. However, general-purpose NLP tools are not trained to handle such specialized vocabulary and syntax. •Mixed modality: IDMs often embed structured tokens (e.g., wallet addresses, see §3) within natural languages. These heterogeneous inputs complicate tokenization and downstream semantic tasks. •Code-switching: Some IDMs mix languages within a single mes- sage (e.g., English with Chinese). This challenges monolingual models and language-specific pre-processing pipelines. 2 •Noisy: IDMs are often ungrammatical, abbreviated, or informal. They may include typos, slang, and inconsistent punctuation. This noise reduces the effectiveness of traditional NLP tools. LLM-assisted Analysis. Given IDMs’ unique features and analyti- cal challenges, we use an LLM, GPT-4o, to assist several stages of our analysis. First, it helps refine language detection (§3). Second, we use the LLM to assign IDM topics based on a predefined taxon- omy (§5.1). It also identifies the emotional tone of each message using a structured set of sentiment categories (§5.2). Finally, we apply the LLM to classify fund recovery requests by strategy type (§8.1). An example LLM prompt is provided in Appendix A. 3 DATA COLLECTION AND PREPROCESSING We first crawl Ethereum transactions within the time frame of our empirical analysis. We then extract a decodable IDM dataset that includes transactions whose inputdata can be decoded using UTF- 8. Finally, we filter this set to obtain an informative IDM dataset. Raw Dataset. We collect Ethereum transactions from the genesis block (Block#0) to Block#19,314,987 ( 3,132days, from Jul 30,2015 to Feb 26,2024). This covers the majority of Ethereum’s history up to a recent snapshot (over 87% as of May 2025). For each transaction, we extracted the inputdata field. In trans- actions where an EOA interacts with a smart contract, this field typically contains ABI-encoded function names and parameters for contract execution. The semantic content of such data is weak in terms of human interpretability, as its structure and meaning are de- fined by contract logic rather than natural language. Therefore, our focus is on transactions between two EOAs, where the input data is unconstrained by ABI standards and may carry natural language content beyond basic transaction metadata. Decodable IDM Dataset. To identify text messages embedded in theinputdata field, we attempted to decode the inputdata using UTF-8 encoding. If the decoding was successful, we treated the transaction as a candidate for IDMs. For each candidate transaction, we stored its transaction hash, block number, block timestamp, from and to addresses, gas used, gas limit, gas price, original hexadecimal input data, input data length, and decoded UTF-8 text. In total, we have identified 5,238,336 transactions with decodable IDMs, with a total data size of 480,932,992bytes ( ≈0.48GB). Informative IDM Dataset. After collecting all UTF-8 decodable IDM transactions, we performed a filtering step to identify messages that carry meaningful information. We first extracted structured to- kens from the decoded text. These included URLs, wallet addresses, transaction hashes, emojis, references to on-chain operations (e.g., cross-chain bridging, exchange operations), and embedded Base64- encoded media (e.g., images in JPEG formats). Then we use FastText for language detection. We cleaned the decoded text by removing structured tokens. This ensured that theFastText model operated on the remaining natural language content. However, FastText exhibits limitations when applied to domain-specific messages that contain noisy, mixed-modality, and code-switching text [ 6]. Therefore, we used GPT-4o as a secondary step to refine IDM language detection (see Figure 1). The detected language was then stored for further analysis. A transaction was considered to contain an informative IDM if it met either of the two criteria: (i)the text contained any recognizablestructured tokens, regardless of whether natural language was present; (ii)if the text contained human-readable natural language, even without structured tokens. Transaction text that contained neither was considered as noise and discarded. After this, we obtain a dataset with informative IDMs. The size of the IDM data is 121,237,387bytes ( ≈0.12GB). 4 DESCRIPTIVE ANALYSIS This section provides a descriptive analysis of our IDM dataset. Table 1: IDM types by content and language variety. IDM Type Contain NL Contain ST Language Variety Count Total ST Only ✗ ✓ None 444,753 444,753 NL Only ✓ ✗Monolingual 365,529366,338Multilingual 809 Mixed Type ✓ ✓Monolingual 50,96356,049Multilingual 5,086 NLfor natural language; STfor structured token. After data preprocessing, we obtain 867,140 transactions with in- formative IDMs. Among these, 444,753 transactions (51.3%) contain only structured tokens, 366,338 transactions (42.2%) contain only natural languages, and 56,049 transactions (6.5%) contain both (see Table 1). The composition of informative IDMs reveals that struc- tured token dominates. This suggests that many on-chain messages lack explicit communicative intent. Nevertheless, a substantial por- tion contains natural language (422,387, 48.7%). This indicates that users do leverage transactions for linguistic expression. Table 2: Top languages in IDMs and their usage types. Language # Monolingual # Multilingual Language # Monolingual # Multilingual English 396,953 5848 Chinese 17,731 826 German 222 44 Korean 212 41 French 186 17 Japanese 157 73 Spanish 142 18 Russian 106 75 Monolingual indicates IDMs containing only one language; Multilingual indicates IDMs containing the target language as part of a multilingual message. Top Languages. Table 2 shows the most common languages in IDMs and their distribution across monolingual and multilingual contexts. English dominates the linguistic content of IDMs, appear- ing in 402,801 instances ( 95.4%). Chinese appears as the second most frequent language (18,557, 4.4%), though with a substantially lower count. Together, English and Chinese are present in 99.8% of the IDMs that contain natural languages. Other languages (1,029, 0.2%), such as German, French, Spanish, Korean, Japanese, and Russian, occur at much smaller scales, typically in the hundreds. Across all listed languages, the number of IDMs containing the language as a monolingual message consistently exceeds the number of instances where the language is part of a multilingual message. Structured Tokens. Figure 2 illustrates the evolution of structured tokens embedded in Ethereum IDMs. The sharp increase of the URL element in 2023 likely reflects the rise of Web3 project promotions and community invitations (e.g., Telegram links) embedded directly in on-chain messages. These promotional and invitational messages often also include emojis to enhance visibility and engagement. The spike in exchange operation elements in 2021 may be attributed 3 2015-Q32015-Q42016-Q12016-Q22016-Q32016-Q42017-Q12017-Q22017-Q32017-Q42018-Q12018-Q22018-Q32018-Q42019-Q12019-Q22019-Q32019-Q42020-Q12020-Q22020-Q32020-Q42021-Q12021-Q22021-Q32021-Q42022-Q12022-Q22022-Q32022-Q42023-Q12023-Q22023-Q32023-Q42024-Q1010k20k30k40k50k# IDMs with Structured T okens<url> <address> <txhash><emoji> <media> <bridge operation><exchange operation> <other operation>Figure 2: Temporal trends of IDM with structured tokens. to the surge in DEX activity and the increased use of on-chain aggregators and trading bots, many of which embed structured indicators or routing metadata directly within transaction messages. In addition, bridge-related operations saw a significant increase in2023. This trend is likely driven by the growing adoption of on-chain interoperability and cross-chain DeFi protocols [7, 8]. 15-08 16-02 16-08 17-02 17-08 18-02 18-08 19-02 19-08 20-02 20-08 21-02 21-08 22-02 22-08 23-02 23-08 24-020k10k20k30k40k50k60k70kCount# Tx with IDM # Unique IDM Figure 3: Temporal trends of transactions with IDMs. IDM Volume Trends. Figure 3 illustrates the monthly trends of Ethereum transactions containing IDMs and the number of unique IDMs from 2015 to 2024. Early in the timeline, the on-chain mes- saging activity was very low. Before May 2017, fewer than 1,000 transactions per month contained IDMs. Starting in the second half of2017, the volume began to rise steadily. A major spike is observed in August 2018, with 61,678transactions containing IDMs. However, only 4,595of these are unique, suggesting a high degree of repe- tition. After 2018, activity drops but remains lively, with smaller peaks at irregular intervals. In general, IDM usage on Ethereum follows no fixed cycle. Its volume may be influenced by various events, such as social movements or security incidents. 101102103104105 T ext Length (Bytes), Log Scale050k100k150k# Unique IDM Structured T oken Only Natural Language Only Mixed Type 020406080100 Cumulative Percentage (%) Figure 4: Text length distribution by IDM types. IDM Text Length. Figure 4 shows the distribution of unique IDMs by text length. The distribution is highly skewed with a long-tailpattern. Most IDMs are short. The majority fall between 10 and 100 bytes. This suggests that many messages are concise. About 80%of all unique IDMs are shorter than 100 bytes. Very few exceed 1,000 bytes. These long messages likely contain encoded data or media. Furthermore, IDMs that contain only structured tokens (green) tend to concentrate around 60to80bytes. In contrast, natural language messages (blue) are concentrated at shorter lengths, often 20bytes. Mixed-type messages (orange) are relatively sparse but more evenly distributed across the mid-range. 5 IDM SEMANTIC ANALYSIS This section presents a semantic analysis of IDMs, focusing on the subset containing English and Chinese natural language. We examine their topical composition and sentiment characteristics. 5.1 Topic Analysis 5.1.1 Methods.Given the domain-specific and noisy nature of on-chain messages, we found that unsupervised topic modeling methods were insufficient to generate coherent and meaningful topics. Therefore, we applied a semi-supervised, taxonomy-driven approach to topic classification. A predefined set of main topics and subtopics was constructed based on domain knowledge and the initial exploration of the dataset. We then utilized a large language model,GPT-4o, to map each IDM to the most suitable main-subtopic pair, or to propose a new topic pair when necessary. Human re- view and iterative prompting adjustments were also employed to refine model outputs and ensure consistent labeling quality. This human-in-the-loop strategy ensured both consistency with domain expertise and adaptability to emerging topics. Security & IncidentPromotion & Marketing Social & Emotional ExpressionOn-Chain RequestsSp a m/ O b f usca t i o n Toxic/Abusive Content Financial ContentCultural/Political Expression Technical/Developer Message Li t er ar y /Ar t i s t i c /Ac ad em i c E d u c a t i o nOther main topicWarnings 17% Attack-related 7%Public Apology 0.263%Project Promotion 14%Community Invite 3% Token Hype 2%Airdrop Promotion 1% Referral Campaign 0.121% D es p ai r 4 %G r e e t i n g s 4 %Daily Life Record 2% M e m o r i a l / T r i b u t e 2 %Philosophical Expression 1%L o v e / C o n f e s s i o n 1 % B i r t h d a y / C e l e b r a t i o n 1 % E n c o u r a g e m e n t / G r a t i t u d e 0. 2 0 8 %Social Interaction 0.0795%Fund Related Request 11%Technical Help Request 1% Social Support Request 1%Ambiguous Content 7% Garbage Content 0.245%Unreadable content 0.104%Hidden Channel Links 0.0729%Emoji Flood 0.0243% Verbal Abuse & Profanity 4%Threats, Harassment, and Psych 0.475% Financial Activity 4%Financial Data 0.21% Financial Analysis 0.0751% Financial Transaction 0.0618%Ideological Messaging 2% Religious Expression 1%Geopolitical Statement 1% Political Slogans 0.0618%On-chain Records 2% Deployment notice 1% Testing notice 0.431% Code Snippets 0.289% Figure 5: Topic distribution for unique English IDMs. Social & Emotional Expression On-Chain Certificate Sp am /O b fu s c at i o nFinancial Content Cultural/Political Expression E d uca t i o nOther main topic On-Chain Requests Toxic/Abusive Content L i t e r a r y / Ar t i s t i c / Ac a d e m i cSecurity & Incident Promotion & Marketing Technical/Developer MessageD o n a t i o n / C h a r i t y / F u n d r a i s i n gLove/Confession 18% Daily Life Record 8%B i r t h d ay/Celeb r at i o n 7 % Philosophical Expression 5% D e s p a i r 3 %G r e e t i ng s 2 % M e m o r i a l / T r i b u t e 1 %O t h e r s 0. 1 6 1 % Social Interaction 0.0953%Copyright Certificate 24%Ambiguous Content 4%Unreadable content 4% Garbage Content 1%Financial Asset 3% Financial Activity 2%Financial Analysis 0.418% Financial Transaction 0.161% Geopolitical Statement 2%Ideological Messaging 1% Religious Expression 0.425% Course Completion 2%Knowledge Sharing 1%Fund Related Request 2% Threats, Harassment, and Psych 1%Verbal Abuse & Profanity 1% Literary Creation 1%Academic Writing 0.191% Figure 6: Topic distribution for unique Chinese IDMs. 4 Table 3: Overview of the Ethereum IDM topic taxonomy. Main Topic Percentage Subtopic Description ExampleEnglish Chinese #Unique #Total #Unique #Total Social & Emotional Expression22.3%Love/Confession Love declarations or proposals. 0x10d...a57 581 652 2,459 5,313 Despair Expressions of emotional breakdown. 0x8da...d83 1,806 2,054 453 462 Daily Life Record Sharing personal life moments or experiences. 0x6d7...fc7 1,012 1,114 1,070 1,111 Greetings Polite message for welcome or recognition. 0x0af...62f 1,735 3,925 234 278 Birthday/Celebration Birthday wishes, holidays, celebration. 0xd94...349 522 589 984 1,156 Philosophical Expression Philosophical statements. 0x4c8...d84 678 861 624 670 Memorial/Tribute Tributes to people or events. 0x6c5...02c 712 863 152 165 Encouragement/Gratitude Encouragement, motivation, or gratitude. 0x341...645 94 102 3 3 Social Interaction Messages intended to initiate informal interpersonal contact. 0x56e...943 36 49 13 14 Security & Incident 18.7%Warnings Warnings on malicious activities, e.g., phishing, scams, rug pulls. 0x14d...cc3 7,660 13,330 33 96 Attack-Related Request after security breaches, e.g., fund recovery, bounty offers. 0x91b...e22 3,067 5,815 131 174 Public Apology Apologies issued by protocols or teams in response to incidents. 0x0ef...473 119 135 2 3 Promotion & Marketing 15.7%Project Promotion Promotion links to protocol websites, token sales, or features. 0xa1d...afe 6,316 56,367 108 175 Community Invite Invitations to join social communities, e.g., Telegram, Discord. 0xe11...b70 1,432 3,371 21 54 Token Hype Hype-building messages about specific tokens or NFTs. 0xe88...943 1,052 1,663 17 18 Airdrop Promotion Messages promoting token airdrops, e.g., eligibility instructions. 0xeb9...0b4 248 2,205 8 25 Referral Campaign Referral campaigns by codes, incentives, or multi-level rewards. 0x44b...6f4 55 3,734 2 2 On-chain Requests 9.6%Fund-related Request Request for mistaken transfers, lost funds, financial assistance. 0xc6d...48e 4,766 184,378 260 327 Technical Help Request Requests for technical assistance. 0xe1e...755 346 520 3 3 Social Support Request Seeking moral or social support. 0xf98...008 269 369 13 13 Spam/ Obfuscation 7.6%Ambiguous Content Syntactically readable but semantically contextless. 0x07e...977 3,207 93,143 560 790 Unreadable Content Encoded data in formats such as hexadecimal, base64, or binary. 0x2b0...763 47 50 480 485 Garbage Content Sequences of meaningless characters, lacking linguistic structure. 0xd53...b7a 111 227 71 86 Emoji Flood Messages composed primarily or entirely of emoji characters. 0x5c0...890 11 11 6 6 On-chain Certificate 5.5%Copyright Certificate Claims of authorship or copyright made on-chain. 0x5aa...612 0 0 3,256 3,256 Financial Content 4.8%Financial Activity Expressions of intent to buy, sell, claim tokens, or seek liquidity. 0xcf4...b35 1,898 15,980 223 490 Financial Asset Descriptions or identifiers of tokens, NFTs, or other assets. 0x680...90a 0 0 461 490 Financial Data Content containing numerical or factual financial data. 0x2b7...cf3 95 112 0 0 Financial Analysis Analytical comments on financial trends, prices, or markets. 0x88d...9ae 34 39 57 67 Financial Transaction Messages recording specific financial transactions. 0x662...354 28 28 22 22 Toxic/ Abusive Content4.3%Verbal Abuse & Profanity Offensive or vulgar language intended to insult or provoke. 0xd9f...f83 1,961 2,582 97 103 Threats, Harassment & Psych Language to threaten, harass, or cause psychological distress. 0xa9a...8e7 215 268 116 116 Discriminatory/Hate Speech Prejudiced language targeting race, gender, religion, or more. 0x6f3...4b2 68 77 2 2 Sexual/Pornographic Content Sexual content, including links or solicitation. 0xbb6...07c 36 50 32 32 Hidden Channel Links Obfuscated links for scams, adult content, or phishing. 0xb87...294 13 126 0 0 Cultural/ Political Expression4.0%Ideological Messaging Statements of liberty or decentralization. 0x265...f4b 1,111 1,321 166 319 Geopolitical Statement Takes on wars, governments, or global issues. 0x3ef...dd9 280 326 329 488 Religious Expression Statements of faith, blessings, religious greetings. 0x672...451 351 484 58 66 Political Slogans Protest phrases or activism slogans. 0x53b...a72 28 29 3 3 Cultural Commentary Expressing opinions on cultural topics, trends, or values. 0x826...3b0 9 9 11 12 Technical/ Developer Message2.9%On-chain Records Documenting transactions, events, state changes, or gas usage. 0x6a4...8e6 981 2,342 71 89 Deployment Notice Announcements related to smart contract deployment. 0xc1b...cc5 275 463 7 7 Testing Notice Messages indicating testing activity or test data injection. 0x90c...b81 195 349 20 22 Code Snippets Embedded fragments of source code, settings, or function logic. 0x8fd...e58 131 145 4 4 Education1.1%Course Completion Declarations or proofs of course or degree completion. 0x067...96c 241 250 293 305 Knowledge Sharing Technical knowledge, explanations, or community support. 0xb15...6fd 59 62 75 91 Charity/ Fundraising 0.3%Help Request User-initiated appeals for fundraising, or charitable support. 0xe8f...3f7 119 269 8 8 Records Messages recording donations made or funds received. 0x6c0...468 38 39 29 42 Others3.1%Others Categories not defined 0xb73...1ca 1,230 1,377 597 710 IDM links under the main topic of Toxic/Abusive Content were removed to comply with the Anti-Harassment Policy. 5.1.2 Results.Table 3 presents the Ethereum IDM topic taxon- omy, organized by main topics and subtopics. For classification, we usedGPT-4o to assign the most relevant topics to each message. We report both the number of unique IDMs and the total number of transactions for English and Chinese messages under each subtopic. Topic Distribution. Our topic taxonomy in Table 3 covers 12main topics with 48subtopics. Interestingly, the distributions of Eng- lish and Chinese IDMs are quite different. English IDMs are more concentrated in Security & Incidents (24%, see Figure 5), whereas Chinese IDMs are more prevalent in Social & Emotional Expression(44%, see Figure 6). Specifically, English IDM senders are more likely to use messages to issue warnings about token scams, rug pulls, and honeypots (17%), promote projects and token sales (14%), and re- quest assistance related to lost funds or financial hardship (11%). In contrast, Chinese IDM senders more often use messages for social connection and emotional expression (44%). In fact, 18% of IDMs express love and affection, 8% document the sender’s daily life, and 7% convey birthday wishes or holiday greetings. In addition, 24% of the Chinese IDMs are used to certify copyright claims related to real-world assets (24%). This shows that users from different 5 language communities use the Ethereum transaction layer not only for P2P transfers but also for distinct communicative purposes. The IDM channel functions as both a transactional tool and a means of expression shaped by local norms and intentions. 2015-Q32015-Q42016-Q12016-Q22016-Q32016-Q42017-Q12017-Q22017-Q32017-Q42018-Q12018-Q22018-Q32018-Q42019-Q12019-Q22019-Q32019-Q42020-Q12020-Q22020-Q32020-Q42021-Q12021-Q22021-Q32021-Q42022-Q12022-Q22022-Q32022-Q42023-Q12023-Q22023-Q32023-Q42024-Q102000400060008000# Unique IDMsSocial & Emotional Expression Promotion & Marketing Security & Incident Spam/Obfuscation On-Chain Requests On-Chain CertificateCultural/Political Expression Financial Content T oxic/Abusive Content T echnical/Developer Message Education Donation/Charity/Fundraising Figure 7: Temporal trends of topics (unique IDMs). Temporal Topic Dynamics. Figure 7 illustrates the distribution of unique IDMs by semantic topic, aggregated quarterly from 2015 to 2024. The first round of surge occurred in 2018–2019, with Social & Emotional Expression andSpam/Obfuscation as the dominant topics. This period likely reflects the experimental and symbolic use of input data, including emotional expression, greetings, and low- quality or repetitive messages. In 2020–2021, there is a shift toward On-chain Certificates, indicating the emergence of utility-driven use cases, such as copyright or asset attestation. Starting in late 2022, a second, broader surge in IDM volume occurs. This phase is characterized by a rise in Promotion & Mar- keting,Security & Incidents, and On-chain Requests. This reflects a growing tendency to use Ethereum not only for personal or expres- sive purposes, but also for transactional communication related to community campaigns, security risks, and fund recovery. The peak in Q3 2023 stands out as the highest observed to date, driven primarily by security and promotion topics. This suggests an intensified use of IDMs for public messaging. This trend signals a transformation in the communicative role of input data: from in- formal symbolic use to a more functional, utility-oriented medium. 5.1.3 Case Study.In the following, we provide concrete exam- ples to show that IDM topics are closely related to important social events. These examples suggest that Ethereum can be a medium for social activism and historical documentation. The #MeToo Movement in 2018. The global #MeToo Move- ment [ 9] is a social movement against sexual harassment. It en- courages survivors to share their experiences publicly and gained widespread momentum in 2018, especially in China. As shown in Figure 7, during Q4 2018, we observe a notable increase in IDMs associated with the topic of Social & Emotional Expression. Through manual investigation, we identify more than 800IDMs explicitly linked to the expression of #MeToo-related messages and slogans. A representative example can be found in the Chinese IDMs sent out by the Ethereum address 0xd44...8571. These messages include personal disclosure of trauma expression from individuals 1Address link is removed to comply with the Anti-Harrassment Policy.who have experienced sexual abuse. Interestingly, all of these IDMs were issued within a period of less than ten days, but they include the stories of hundreds of people. This pattern indicates that the IDM senders tend to leverage Ethereum IDMs as a means to record these stories. This allows the voices of #MeToo survivors to be preserved without the risk of removal by centralized entities. COVID-19 during 2020 and 2023. We identify 149IDMs con- taining COVID-19 words such as “Covid” and “lockdown” in our dataset. Specifically, these IDMs are distributed across the years 2020 to 2023, with 78IDMs in 2020, 27in 2021, 16in 2022, and 28in 2023. These IDMs contain a range of public reactions and behaviors during the pandemic and mainly include three topics: (i) Cultural and Political Expression, where individuals voice opinions on public policies and societal responses to COVID-19; (ii) Social and Emotional Expression, reflecting personal experiences, mental health status, and feelings during COVID-19 lockdowns; and (iii) On-Chain Requests, in which users leverage Ethereum IDMs to ask for help, share needs, or call for collective action. 5.2 Sentiment Analysis We developed a taxonomy (see Table 4) informed by the NRC Emo- tion Lexicon and refined it to better fit the context of blockchain communication. The taxonomy includes three polarity classes ( Pos- itive,Negative,Neutral ), with six positive emotions (e.g., Joy), six negative emotions (e.g., Anger ), and four neutral states (e.g., con- fusion). This structure allowed for more reliable classification of emotional tone within the communicative patterns found in IDMs. Table 4: IDM sentiment taxonomy with polarity, emotion, example IDM, and language-specific counts. Polarity Emotion ExampleEnglish Chinese # Unique # Total # Unique # Total PositiveJoy 0x8a6...182 1,831 9,276 4,220 4,335 Trust 0xd76...a47 1,880 4,140 215 318 Love 0x98e...4ae 754 907 2,681 5,553 Hope 0x8f5...3f7 3,879 11,175 1,021 1,295 Gratitude 0xce7...e1c 1,475 3,188 256 299 Warmth 0x9b2...78e 1,349 3,695 698 786 NegativeAnger 0x637...cb3 1,209 1,628 119 132 Hostility 0xcd6...554 2,700 3,952 93 105 Disgust 0xf52...f83 1,258 1,814 240 264 Fear 0xba1...e4d 7,558 196,338 332 414 Guilty 0x801...6a1 419 521 31 31 Sadness 0x64a...e53 3,014 4,392 771 894 NeutralSurprise 0x39d...d46 265 362 26 28 Confusion 0x223...da3 723 1,273 69 97 Curiosity 0xc7f...af0 3,400 5,290 414 648 Politeness 0xc3a...598 3,483 21,494 154 171 Color intensity indicates count magnitude. For Hostility and Disgust, IDM links are removed to comply with the Anti-Harassment Policy. For sentiment analysis, traditional tools such as lexicon-based methods or pretrained classifiers often struggle with domain-specific, noisy text. In the case of IDMs, these tools are limited due to the presence of on-chain identifiers, irregular formatting, and mixed lin- guistic cues. To address these challenges, we used OpenAI’s GPT-4o model to perform emotion classification. For each IDM, the model 6 was prompted to return the relevant emotion with the associated intensity score (1–10) and confidence value (0–1). We have identified 269,445 emotive IDMs in English and 15,370 emotive IDMs in Chinese. Table 4 presents the emotion distribution of English and Chinese IDMs, categorized by polarity and specific emotion types. Negative emotions are more prevalent in English IDMs, whereas Chinese IDMs show significantly fewer instances of such expressions. This observation indicates a higher tendency to express negative sentiment in English IDMs. Fear stands out as the most prevalent emotion category for English IDMs, with 7,558unique messages and 196,338total oc- currences, far surpassing all other emotional labels. This pattern reflects widespread usage of IDMs for warnings, scam alerts, or distress signals. It also underscores persistent concerns over on- chain security, as users frequently respond to phishing, hacks, and contract vulnerabilities with messages conveying fear and urgency. Hostility is also prominent in English IDMs, indicating the potential use of the IDM channel for toxic expression. In contrast, Chinese IDMs are more concentrated in positive emotional expressions, particularly Joy(4,220 unique) and Love (2,681 unique), suggesting a more affective and interpersonal use of on-chain messaging in the Chinese context. Anger Disgust Fear Guilty Hostility Sadness Confusion Curiosity Politeness Surprise Gratitude Hope Joy Love Trust Warmth86111 94 856 82 21179 29 23 26611 61 36246 48 3 2 2 0 118 0 513 040 32 4 312 16 0 0 2 0 0 0 124 8 0 2 6 6 0212 2 33 24 74 311 26 45290 289 16 71133 44 272 32 7 416 1 281 7121 10 5 266 33 812 11 107 4147 150 131888 102 509 714 1437 239 26 20 72206 24 74186 677 39 49682 661 491071364 653 17634 212 456 6926809 132 618 208 49146 294 8117 75 17 1158 29 202 127 149 104 197 627 176 785 634 896411125 871 662 329 747 14 24 20 327 23210 420 561 42 994 65 471 28 14 427 11 1 946181 233 25 18110 31 151 6 262 191 27 11697 912 18 12 2 4 110 0 5 5# Unique English IDMs Anger Disgust Fear Guilty Hostility Sadness Confusion Curiosity Politeness Surprise Gratitude Hope Joy Love Trust WarmthCultural. Donation. Education Financial. Literary..Requests Promotion. Security. Social. Spam. Technical. Toxic.21 37 37 110 81 788 5 5 6134 16 841 6 0 0 0 0 0 0 0 0 1 0 1 4 8 2 3 7 1 0 0 0 0 1 123 2 071 16130 040 0 1 526 0 019 792 4 1 143 5 0 4 0 0 3 0 0 031 018 2 0 128 16 23 11 3 6 1 9 4 0165 413 13 018 6 2 1 4 9 0 2 5 0 1 1 1 8 9 0 943 7 024 11 26 970 122 12 0 5 2 0 1 5 0 0 7 0 39 91112 24 13401 27 96 84 14142 709 7302639 63649 2 511 1 6 621 25 25 4 0 535 6 111 0 1 0 0 0 0 017 4 0 1 1 4 0 2 0 21 80 54 041 44 0 2 0 0 0 0 1 0 1 0# Unique Chinese IDMs - - - - - - - - - - - - Figure 8: Emotion – topic distribution of unique Ethereum IDMs in English (left) and Chinese (right). We further present a cross-tabulation of emotional categories and IDM topics in Figure 8. English IDMs show strong emotional variance across topics. Notably, Fear is dominant in Security & Inci- dent (6,809 messages), suggesting that discussions around scams, hacks, or risk tend to evoke anxiety-driven expressions. Hostil- itydominates within Toxic/Abusive Content, suggesting that IDMs are often used to convey verbal aggression or threats. In addition, Sadness appears most frequently in On-chain Requests, reflecting expressions of personal hardship or appeals for help. By contrast, Chinese IDMs show emotional clustering in Social & Emotional Expression, particularly in Love (2,639), Joy(730), and Hope (709). Negative emotions are far less pronounced across Chi- nese topics. This reinforces earlier findings that Chinese users more often utilize IDMs for interpersonal or emotional communication. Overall, the matrix reveals a clear language-specific divergence. English IDMs carry heavier negative emotional signals in security- related and toxic content, whereas Chinese IDMs reflect more in- terpersonal and affective sentiment within social topics.6 IDM COMMUNICATION COSTS In this section, we analyze IDM transaction value and cost. 6.1 Transaction Values Different from traditional social media platforms, Ethereum IDMs are propagated via blockchain transactions, which can typically trigger the transfer of coins such as ETH. As a result, IDMs trans- actions serve not only as a medium for information exchange but also as a mechanism for asset transfer. This dual role, i.e., commu- nicative and transactional, introduces measurable costs that vary with IDM characteristics such as topic, length, and language. In total, we identify 340,900non-zero-value transactions with English and Chinese IDMs. Figures 9 and 10 show the distribution of transaction values and topics for English and Chinese IDMs, segmented by message length (i.e., 0–10,10–100,≥100bytes). Within each length category, we select the top 10most frequent topics and visualize their distribution over transaction values. Spam... Technical... Social......Requests Financial... Promotion... Toxic... Security... Cultural... Error1015 1010 105 100105Transaction Value (ETH)IDM Length: 0-10...Requests Promotion... Spam... Social... Security... Financial... Technical... Toxic... Cultural... Donation...IDM Length: 10-100 Security... Promotion......Requests Social... Financial... Cultural... Technical... Spam... Toxic... Donation...IDM Length: >100 Figure 9: English IDM topic and transaction values. Spam...1015 1010 105 100Transaction Value (ETH)IDM Length: 0-10 Social... Spam... Promotion......Requests Financial... Security... Cultural... Literary... Toxic... Technical...IDM Length: 10-100 Social... Financial......Requests Cultural... Security... Promotion... Literary... Education Spam... Technical...IDM Length: >100 Figure 10: Chinese IDM topic and transaction values. In English IDMs (see Figure 9), the dominant topics in short messages ( 0–10bytes) are Spam/Obfuscation,Technical & Developer Messages, and Social & Emotional Expression. We also observe that transaction values range widely and include several high-value outliers. As message length increases ( 10–100bytes), dominant topics shift toward On-Chain Requests andPromotion & Marketing. In addition, long-message (> 100bytes) transactions tend to carry moreETHtransfers compared to those with shorter messages, and the most popular topic now is Security & Incident. For example, the IDM transaction 0x370...af4 with the largest value (i.e., 3,997.9ETH) is issued by the HTX Global Hacker, which is used to send back the attack revenue to the Huobi Recovery address. In Chinese IDMs (see Figure 10), transaction values for short messages are generally negligible, even across common topics such asSpam/Obfuscation. Similar to the cases in English IDMs, as the length increases, topics such as On-Chain Requests,Promotion & Marketing, and Security & Incident emerge, with moderate transac- tion values. Notably, among IDMs with a message length of 10 bytes 7 or more, the most common topic is Social & Emotional Expression. This highlights a cultural tendency to use IDMs for self-expression. For instance, we observe that the IDMs with specific transaction values of 5.203344,5.201314,5.20,1.314,0.5201314, and 0.1314 are often used to express love and affection. This follows popular sym- bolic numerology in contemporary Chinese digital culture2. For example, in transaction 0x288...e0a, the sender sends 5.201314 ETH to their spouse to commemorate their wedding anniversary. The comparison reveals different communicative norms. Long English IDMs tend to serve transactional or protocol-level purposes, while long Chinese IDMs convey stronger emotional intent. 6.2 Transaction Costs Compared to basic ETHtransfers (which typically require 21,000gas), sending an IDM triggers additional gas costs for storing message data on-chain. Figure 11 provides a temporal analysis of gas usage and data size trends for IDM transactions. Figure 11: IDM gas costs and cumulative data size over time. The differences between the red and the blue lines in the left subfigure are due to the Istanbul upgrade. The top subfigure plots the gas used per byte of IDM input over time. Before the Istanbul hard fork [ 10] in 2019, the per-byte gas cost remained consistently high, which was around 68gas units per byte (in the red band). Following the upgrade, this cost dropped sharply to 16gas units per byte, resulting in the much lower blue band observed post-2020. This significant reduction indicates how EIP-2028  improved the efficiency of transactions with IDMs. The bottom subfigure shows the cumulative size of IDM data over time. Although the Istanbul upgrade in late 2019 reduced the gas cost per byte, its direct impact on the volume of IDM data was limited. The figure shows that a notable acceleration in IDM data accumulation did not occur until mid-2023. We suspect that factors beyond gas efficiency, such as broader adoption of social messaging patterns, might play a more critical role in the increase. In addition, this increase in IDM data volume raises ongoing debates within the Ethereum community regarding the utility and long-term impact of such content. Unlike smart contract interac- tions or financial transfers, a large proportion of IDM messages, such as those expressing personal sentiments or opinions, do not 2In Chinese, “520” is a homophonic representation of “w ˇo ài n ˇı” (“I love you”), and “1314/3344” corresponds to “y ¯ı sh¯eng y ¯ı shì/sh ¯eng sh ¯eng shì shì” (“a whole lifetime”).directly contribute to the blockchain’s core financial functionalities. Nonetheless, these messages are permanently recorded on-chain, which will occupy the storage space on Ethereum nodes. 7 IDM NETWORK ANALYSIS The IDM senders and receivers form a communication network. In this section, we analyze the structure of the Ethereum IDM network. 7.1 Network Measurement In total, we identify that 189,111addresses3send 422,387transac- tions that contain natural languages, where 60,847IDMs are unique. Network Degree Distribution. As shown in Figure 12, the IDM network shows a heavy-tailed degree distribution. Only a few ad- dresses have very high in/out-degrees, while most addresses have low degrees. For instance, more than 105addresses have only one in-degree or out-degree. The low connectivity of the majority of ad- dresses means that the network is overall sparse. However, there are only 21addresses that have an in-degree or out-degree of more than 104, suggesting the existence of hub-like addresses in the center of the network’s communication. In addition, we also observe that both the in-degree (blue line) and out-degree (red line) distributions follow a similar power-law trend on a log-log scale. 100101102103104 Degree100101102103104105# AddressesIn-Degree Out-Degree Figure 12: Distribution of indegree and outdegree. 0 100 200 300 400 500 Node Reciprocity100101102103104# AddressesMean: 1.09 0.0 0.2 0.4 0.6 0.8 1.0 Clustering Coefficient100101102103104105# AddressesMean: 0.01 Figure 13: Weighted reciprocity and clustering coefficient. Weighted Reciprocity Distribution. The left subfigure of Fig- ure 13 shows the distribution of the weighted reciprocal of the Ethereum IDM network. We observe that most addresses exhibit low weighted reciprocity (with an average value of 1.09). This indi- cates that IDM transactions are largely one-directional. And only 8,509(4.50%) addresses engage in IDM communication via bidirec- tional transactions. This phenomenon of asymmetry indicates that 3Some EOAs send IDMs only to others, some only to themselves, and others to both. 8 0x001...413 22,769 12% 0x019...81C 7126 4% 0x502...D60 6629 4%0x0d7...c2b 6338 3% 0x000...06C 5265 3% 0x074...61E 5179 3% 0x000...033 5171 3% 0x000...86b 4944 3%0x000...e02 3983 2% 0x000...E81 3361 2% 0x000...7bb 3037 2% 0x000...d1E 2791 1% 0x000...Bd4 2686 1% 0x003...3D7 2093 1%0x001...b24 1907 1%0x535...819 1869 1%Figure 14: Community distribution of Ethereum IDM users. users tend to leverage IDMs to broadcast information, rather than as a medium for maintaining two-way conversations. Clustering Coefficient Distribution. The right subfigure of Fig- ure 13 depicts the clustering coefficient distribution of the Ethereum IDM network. We observe that the network shows a very low aver- age clustering coefficient, i.e., 0.01. This indicates that the network has a sparse local structure, where neighbors of an address tend not to be connected with others. Only a small number of addresses (approximately 300-400) show high clustering coefficients ( ≥0.8), which suggests the existence of a few tightly connected local com- munities. In the following subsection, we will further analyze the communities of the Ethereum IDM network. 7.2 Community Analysis We adopt the Louvain algorithm [ 12] to analyze the community structure of Ethereum IDM users. To analyze the meaningful inter- actions, we focus on the 189,006addresses that send messages to others, i.e., with message connections to other addresses. Community Size. From the 189,006connected addresses, we iden- tify 26,048distinct communities, with an average size of 8.84ad- dresses. As shown in Figure 14, the top 10largest communities account for 37.44%of all addresses. Notably, the largest commu- nity contains 22,769(12.05%) addresses, issuing 147,332(34.9%) IDM transactions. Interestingly, we observe that most communi- ties ( 15,625,59.99%) consist of only two addresses, while they only collectively account for 31,250addresses ( 16.53%). Community Topics. To better understand the nature of interac- tions within different communities, we analyze the message topics across two distinct community types: the top 10largest communi- ties and the 15,205smallest communities of exactly two addresses. Figure 15 depicts the topic distributions in these communities. The most prevalent topics of unique IDMs issued by the top 10largest communities are Promotion & Marketing (36.97%) and Security & Incidents (28.01%). This distribution reflects a dominant use of IDMs to disseminate promotional content or alert messages to a broad audience. For instance, in the second-largest community, the address 0x7A0...9ab sent out at least 3,700transactions containing Top 10 Largest Communities Communities with Size 2020406080100Unique IDMs (%)Promotion & Marketing 36.97% On-Chain Certificate 24.79%Security & Incident 28.01% Social & Emotional Expression 21.69%Social & Emotional Expression 12.79% Spam/Obfuscation 15.52%Toxic/Abusive Content 6.13% Financial Content 8.08%On-Chain Requests 4.47% On-Chain Requests 6.78%Cultural/Political Expression 3.58% Security & Incident 5.06%Promotion & Marketing 4.40%Toxic/Abusive Content 4.10%Cultural/Political Expression 3.95%Figure 15: Topic distributions in different communities. All Topics Social & Emotional Expression020406080100Unique IDMs (%) Social & Emotional Expression 40.98%Promotion & Marketing 16.95%Cultural/Political Expression 10.04%Spam/Obfuscation 8.20%Technical/Developer Message 5.56%Financial Content 3.77% Love/Confession 36.73%Philosophical Expression 13.35%Daily Life Record 13.05%Despair 12.44%Greetings 8.47%Memorial/Tribute 6.57%Birthday/Celebration 5.05% Figure 16: Topic distributions for self-messaging IDMs. a message “Check our contract scanner for more information...”, which is classified under the topic of Promotion & Marketing. In contrast, the 15,625dyadic communities, which involve only two addresses, exhibit a broader range of topics. While On-Chain Certificate represents the largest topic ( 24.79%) in the number of unique IDM texts, other categories emerge with significant percent- ages, such as Social & Emotional Expression (21.69%),Spam/Obfus- cation (15.52%),Financial Content (8.08%), etc. These topics show more diverse and personal interactions. For instance, we observe numerous IDMs with the topic of Social & Emotional Expression, where users share personal thoughts, express emotions, and send greetings to their recipients. This phenomenon suggests that users in smaller communities tend to use IDMs for more personal or ideological purposes, rather than for commercially driven motives. 7.3 Self-Messaging Behavior Besides interacting with others, we also identify 5,230addresses that send 14,185messages to themselves. Although those addresses do not form a group or community with others, they still exhibit an interesting “self-messaging” behavior. Figure 16 shows that self-messages span a wide range of top- ics. In terms of the number of unique texts over all topics, Social & Emotional Expression dominates at 40.98%. This indicates that many self-directed users tend to leverage IDM for personal logging, signaling, or expressive purposes. We further analyze the subtopic distribution under the main topic of Social & Emotional Expression. We find that the top three subtopics are Love/Confession (36.73%), Philosophical Expression (13.35%), and Daily Life Record (13.05%). The self-messaging behavior is particularly notable among Chi- nese IDM senders. We highlight two illustrative examples to explore 9 the potential motivations behind this practice. Specifically, the ad- dresses 0x078...2b8 and 0x5cB...8fB4make repeated use of the IDMs to send messages to themselves. These IDMs take the form of ro- mantic confessions and aim to publish messages on behalf of others. This behavior closely resembles the practice of “bi ˇao bái qiáng”, a cultural phenomenon popular among Chinese youth. It is conceptu- ally similar to “confession page” on Web2 platforms like Instagram, where users share unreciprocated sentiments in a public setting. These self-directed IDMs are not intended for communication, but rather to permanently record personal messages on-chain. 8 SECURITY IMPLICATIONS Interestingly, we find that many IDMs are relevant to Security & Incident. This phenomenon is particularly relevant in the context of emerging attack incidents on Ethereum. Attacker VictimUsers attack interact Please consider returning my money. I'm just a user that only had few ETH as my life savings.TAKE CARE! This deployer wallet was involved in X rugs and has stolen my money. Recovery Request IDM Warning IDM Figure 17: Example of security-related IDMs. We have identified three subtopics under Security & Incident: •Warnings ( 13,415): Warnings on phishing attempts, scams, rug pulls, and other malicious activities. •Attack-related ( 5,983): Fund recovery requests, legal threats, or bounty offers following security breaches. •Public Apology ( 137): Apologies issued by protocols or teams in response to incidents or failures. Figure 17 provides examples of attack-related IDMs. A victim in an accident may request the attacker to return money, and simulta- neously warn other users of the associated risks. 8.1 IDMs with Security Relevance As shown in Figure 18, the volume of IDMs with security relevance has grown significantly since 2022. This is probably due to the explosive growth of DeFi. Before 2022, the volume for all three subtopics was negligible. This is likely due to the relatively small scale of the DeFi ecosystem and low exposure to on-chain attacks. The spike volume of the Warnings subtopic appears in 2023. As shown in Table 3, these warning IDMs typically relate to phishing scams, rug pulls, and other malicious activities. These activities have become frequent as DeFi platforms rapidly onboard users and assets without centralized regulation. In response, affected users or victims could turn to on-chain IDMs to share alerts and raise 4Although IDMs are publicly accessible on-chain, we remove IDM links for these two examples, as they may contain user nicknames or other semi-identifiable information. 2016 2017 2018 2019 2020 2021 2022 2023 2024 Month05001000150020002500# TransactionsSecurity & Incident-Warnings Security & Incident-Attack-related Security & Incident-Public ApologyFigure 18: Temporal trends of IDMs with security relevance. awareness among other users. For instance, as shown in Figure 17, users sent messages such as “TAKE CARE! This deployer wallet was involved in X rugs” to their peers. This indicates that IDMs can serve as a peer-to-peer warning function to achieve a collective safeguard mechanism within the Ethereum community. Figure 19: English (left) and Chinese (right) IDM word clouds for the Security & Incident main topic. We also observe a similar trend in attack-related IDMs, which typically involve fund recovery requests, legal threats, or bounty offers after security breaches. As shown in Figure 19, common keywords in these IDMs, such as “return”, “refund”, and “fund”, frequently appear in both English and Chinese. Using LLMs, we identify the following strategies that users adopt to communicate with the attackers for fund recovery requests: •Plead: The sender appeals to the attacker by highlighting per- sonal hardship or financial distress. •Threaten: The sender warns that the attacker’s identity has been exposed and threatens to involve regulators. •Reward: The sender offers incentives, such as bounties or a share of the stolen funds, in exchange for their return. •Negotiate: The sender proposes a compromise, such as partial repayment or a mutually acceptable arrangement. Table 5: Communication strategies and effectiveness. Strategies # Unique IDM # Reply Reply Rate (%) Plead 287 21 7.3% Threaten 599 32 5.3% Reward 245 39 15.9% Negotiate 485 95 19.6% 10 To evaluate the effectiveness of different fund recovery strate- gies, we analyze whether attackers return the stolen funds to users. As shown in Table 5, recovery requests that involve rewards or negotiation are notably more successful, achieving reply rates of 15.9%and 19.6%, respectively. In contrast, strategies based on plead- ing or threatening are less effective, and the threat approach has the lowest reply rate at merely 5.3%. The result suggests that appeals involving legal threats or regulatory involvement are largely uncon- vincing. This is likely due to the absence of regulatory frameworks and enforcement mechanisms in the Ethereum ecosystem. 8.2 Overlap with On-Chain Mixer Users To further understand security-related IDM user behaviors, we investigate their intersection with users of Tornado Cash (TC) [ 14]. TC is a widely used on-chain mixer designed to enhance users’ privacy by breaking the linkability between addresses. Engaging with TC typically suggests an awareness of preserving privacy. We first crawl the depositor addresses in TC ETH pools from block 9,117,019(December 16, 2019) to block 21,998,172(March 07, 2025), identifying a total of 48,279unique depositors. Table 6 presents the overlap between IDM participants (both senders and receivers) and TC depositors, categorized by IDM topics. Notably, we observe that users involved in the Security & Incident: Attack- related topic exhibit the highest overlap with TC usage, i.e., 5.2%of senders and 5.9%of receivers. This indicates a correlation between security-related communication and privacy-seeking behavior. We suspect that users who communicate about security incidents are more likely to have sensitive operational motives and, correspond- ingly, are more inclined to utilize privacy-enhancing solutions. In contrast, IDM users engaged in more outward-facing topics, such as Promotion & Marketing orEducation, show minimal overlap with TC users. For example, users associated with the Promotion & Marketing topic show a Tornado Cash usage rate of less than 1%. This further suggests that TC is more commonly used by IDM users engaged in communication related to risk-associated topics. Table 6: Overlap between IDM users and TC depositors. Topics# Unique Senders# Senders TC Overlap(%)# Unique Receivers# Receivers TC Overlap(%) Security & Incident-Attack-related 1,488 78 (5.2%) 4,505 264 (5.9%) Security & Incident-Warnings 998 22 (2.2%) 10,439 88 (0.8%) Security & Incident-Public Apology 106 3 (2.8%) 119 6 (5.0%) Social & Emotional Expression 6,239 152 (2.4%) 9,139 140 (1.5%) Promotion&Marketing 10,989 40 (0.4%) 34,368 156 (0.5%) Spam/Obfuscation 35,466 54 (0.2%) 48,430 41 (0.1%) On-Chain Requests 3,325 89 (2.7%) 40,181 291 (0.7%) On-Chain Certificate 1 0 (0.0%) 1 0 (0.0%) Cultural/Political Expression 1,509 20 (1.3%) 1,408 49 (3.5%) Financial Content 1,627 39 (2.4%) 8,330 105 (1.3%) Toxic/Abusive Content 1,308 32 (2.4%) 2,353 52 (2.2%) Technical/Developer Message 1,554 30 (1.9%) 1,954 35 (1.8%) Education 298 3 (1.0%) 146 2 (1.4%) Charity/Fundraising 165 3 (1.8%) 234 8 (3.4%) 9 MODERATION AND REGULATION IMPLICATIONS This section examines toxic IDMs to show how IDMs can carry harmful content and why content moderation and regulatory at- tention are necessary within decentralized environments.9.1 Analysis of Toxic/Abusive IDMs 0100200300400500600IDM CountEnglish T oxic/Abusive Content Threats, Harassment, and Psych Verbal Abuse & Profanity Sexual/Pornographic Content Discriminatory or Hate Speech Hidden Channel Links 2015-Q32015-Q42016-Q12016-Q22016-Q32016-Q42017-Q12017-Q22017-Q32017-Q42018-Q12018-Q22018-Q32018-Q42019-Q12019-Q22019-Q32019-Q42020-Q12020-Q22020-Q32020-Q42021-Q12021-Q22021-Q32021-Q42022-Q12022-Q22022-Q32022-Q42023-Q12023-Q22023-Q32023-Q42024-Q1 Quarter0255075100125150175IDM CountChinese T oxic/Abusive Content Threats, Harassment, and Psych Verbal Abuse & Profanity Sexual/Pornographic Content Discriminatory or Hate Speech Hidden Channel Links Figure 20: Temporal trends of toxic IDMs by subtopics in English (top) and Chinese (bottom). Figure 20 compares the temporal dynamics of toxic or abusive content in Ethereum IDMs between English and Chinese messages. English IDMs show a clear rise in toxic content starting from late 2020. This trend accelerates throughout 2022 and 2023. Most of the content falls under the topic of Verbal Abuse & Profanity. Smaller portions relate to threats or psychological harassment. A few mes- sages contain hate speech or sexual references. In contrast, toxic content in Chinese IDMs is minimal. It appears only occasionally over time, with one sharp but isolated peak in 2018. Beyond that, the frequency remains low and stable. This contrast suggests that toxic expression on-chain is more common in English-language communication. Chinese-language messages show limited use of IDMs for antagonistic or abusive discourse. Table 7: Emotional profiles of toxic IDM subtopics. Emotion Hate Speech Hidden Links Sexual Threats Verbal Abuse Negative-Anger 2 1 0 18 312 Negative-Disgust 11 0 21 34 219 Negative-Fear 0 0 6 74 20 Negative-Guilty 0 0 0 0 1 Negative-Hostility 63 0 11 221 2,044 Negative-Sadness 0 0 8 31 16 Neutral-Confusion 1 0 1 0 12 Neutral-Curiosity 0 1 5 2 12 Neutral-Politeness 0 116 3 0 10 Neutral-Surprise 0 0 3 0 0 Positive-Gratitude 0 0 0 0 4 Positive-Hope 0 0 0 1 0 Positive-Joy 2 0 5 1 6 Positive-Trust 0 0 0 2 5 Positive-Warmth 0 0 2 0 3 Color intensity indicates count magnitude. Table 7 breaks down toxic IDM subtopics by emotion category. Most toxic content is associated with negative emotions, especially Hostility andAnger.Hostility appears most frequently, dominating both Verbal Abuse & Profanity andThreats, Harassment, and Psych. Disgust also shows a strong link to Verbal Abuse & Profanity and Sexual/Pornographic Content. Surprisingly, a small number of polite messages are tied to Hidden Channel Links, suggesting deceptive intent. These patterns highlight how certain emotions are closely tied to abusive or manipulative behaviors on-chain. 11 9.2 Case Study of Toxic/Abusive IDMs We present some case studies to show how the misuse of Ethereum IDMs can facilitate the propagation of toxic information5. Verbal Abuse & Profanity. Verbal abuse and profanity constitute the most prevalent form of toxic IDMs. They are characterized by aggressive tones and vulgar expressions. One example appears in transaction 0xc36...7f6, where the sender directs a violently profane message. It includes crude language and an explicit invocation of violence, reflecting a clear intent to insult and intimidate. This case demonstrates how IDMs can be misappropriated for targeted abuse. Threats, Harassment, and Psych. Threats and harassment are among the most severe forms of abuse observed in IDMs. In certain cases, messages go beyond profanity and contain explicit death threats, often directed at specific individuals or groups. One striking example appears in 0x9a94...de4, where the sender issues repeated threats against an entire family, using hostile and violent language. This example reflects the alarming potential for on-chain messages to be weaponized for psychological harm. The public visibility of blockchain storage amplifies the impact of such messages. Discriminatory/Hate Speech. Discriminatory or hate speech represents one of the most extreme abuses of the IDM channel. In certain cases, senders have injected explicit racial and ethnic slurs directly into the input data field, leveraging the immutability of the blockchain to preserve hostile speech. A disturbing example can be found in transaction 0x6f31...4b2, where the message consists entirely of hate-filled language targeting multiple identity groups. This case illustrates how on-chain messaging can be misused to propagate violent ideologies. Sexual/Pornographic Content. Some IDMs contain unsolicited sexual language or explicit propositions, reflecting the misuse of input data as a vector for inappropriate or predatory communica- tion. One such case can be seen in transaction 0xbb68...07c, where the sender issues a crude sexual request in broken English. The language is explicitly directed toward the recipient, indicating both an intent to provoke and a disregard for any communicative norms. This type of content mirrors patterns found in unsolicited sexual messaging across web2 platforms, but the immutable nature of blockchain messaging means such content cannot be removed. Hidden Channel Links. Some IDMs embed external links that lead to off-chain communication spaces. These messages typically use short, informal phrases to draw attention, followed by a link to a messaging group, redirect service, or promotional site. For instance, one message promotes a “hidden mint” event through a Telegram message link (0xe310...e28), which appears to be part of a token or NFT marketing strategy. Another example (0xd597...381) uses sexual language and directs users to a suspicious-looking URL, likely for adult content or scam purposes. These messages are often short and distributed across many recipients, resembling patterns of phishing campaigns. While they do not always contain direct abuse, their intent is often exploitative. 5Claim: The toxic IDMs cited in this paper are included solely for the purpose of analy- sis. We do not endorse or condone their content in any form. All excerpts are presented to support research on IDM misuse and the need for governance and regulation. For this discussion, IDM links are removed to comply with the Anti-Harassment Policy.9.3 Implications for Moderation and Regulation The case studies presented in §9.2 demonstrate that blockchain mes- saging can be misused for severe forms of verbal abuse, targeted threats, hate speech, sexual solicitation, and spam-related link prop- agation. They reflect how a decentralized system can also serve as a channel for hostile, exploitative, and manipulative communication. Table 8: Content moderation in Web2 and Web3 platforms. PlatformModerated ContentAI-Based ModerationHuman ReviewUser ReportingEnforcement Actions Facebook (Meta)- Hate speech & harassment - Violent or graphic content - Nudity & sexual content - Misinformation and spam - Terrorism & illegal activity✓ ✓ ✓- Content removal - Content down-ranking - Fact-check labels - Temporary bans - Account suspensions TikTok- Hate speech & harassment - Violent or graphic content - Nudity & sexual content - Self-harm & dangerous acts - Misinformation & crime✓ ✓ ✓- Content removal - Content down-ranking - Account warnings - Temporary bans - Account suspensions Memo.Cash (Web3)- ✗ ✗ ✗ - Ethereum IDM- ✗ ✗ ✗ - In Web2 environments, such content would typically be removed under the platform’s content moderation system [ 15]. For example, mainstream social media such as Facebook6and TikTok7explicitly prohibit toxic information such as threats, hate speech, and sexual content, using a combination of AI-based and human moderation (see Table 8). These systems are supported by centralized authority and reactive enforcement, allowing for timely interventions. In contrast, blockchain ecosystems offer no built-in moderation mechanisms. Once deployed, input data is immutable, and there are no platform-level controls to report or remove harmful con- tent. Messages are not bound by shared community guidelines, and senders remain pseudonymous and unaccountable. Cases like Memo.cash show the risks of decentralized social media [ 16]. The platform, built on Bitcoin Cash, has hosted hate speech and offen- sive posts, with no effective way to moderate them8. This challenge extends to Ethereum IDMs. As our study shows, Ethereum has al- ready seen the use of IDMs to propagate toxic and abusive content. Yet, there is no effective moderation layer. This raises concerns about the long-term societal impact of unmoderated communica- tion in decentralized systems. The need for regulatory efforts and governance mechanisms is becoming increasingly urgent. Furthermore, Web2 platforms are often operated in regulated settings. For example, the EU’s Digital Services Act and China’s Cy- bersecurity Law require platforms to take responsibility for harmful or illegal posts. These rules mandate content removal, reporting, and compliance mechanisms. In contrast, decentralized systems operate without such regulatory frameworks. There are no legal duties for moderation, and no clear paths for accountability. This legal gap presents serious challenges for harm prevention. 6Community Standards, Meta Transparency Center. 7Community Guidelines, TikTok. 8Memo.cash implements a user-level mute mechanism, allowing individuals to filter unwanted content. However, this is not a form of content moderation in the traditional sense, as the content remains publicly visible and immutable on the blockchain. 12 10 ETHICAL CONSIDERATIONS To mitigate ethical concerns, we present the following claims. Public Data Sources and Respect for Law. Our work presents the first large-scale empirical study of IDMs on the Ethereum mainnet. All data originates from a public, permissionless ledger, and our analysis involves only the interpretation of this openly available information. Our data practices comply with GDPR Recital 26 (data manifestly made public), as well as relevant data protection laws in the countries where the authors are based. No smart-contract vulnerabilities were exploited, and no transaction was emitted by the research team. All IDMs involved in this paper are included solely for the purpose of academic research. We do not endorse or condone their content in any form. Privacy Considerations. All data analyzed in this study con- sists solely of on-chain transactions, collected from a self-hosted Ethereum archive node. No off-chain or auxiliary datasets were used at any point. Although these records are already public and pseudonymous, we applied an additional privacy-hardening pipeline: •Address Truncation. Each hexadecimal address, except those related to public incidents and events, is reduced to its first five and last three characters (e.g., 0x123...abc) so that linkability with Web traces or APIs is weakened. •Transaction Link Suppression for Toxic IDMs. Although we include toxic or abusive IDMs in our analysis and discuss their implications for regulation and moderation in §9, we remove links to transaction hashes whose IDMs (i)contain personally identifiable or semi-identifiable information, (ii)include or refer- ence sexually explicit content, or (iii)involve legally prohibited expressions of extremism, hate speech, or threats. Access Upon Request. Researchers with a legitimate and non- commercial need (e.g., auditing the redaction procedure) may re- quest the fullaccess to our crawled Ethereum IDMs under a no- redistribution data-use agreement. By adhering to these principles, we aim to maximize scientific value while respecting the rights, safety, and privacy of community users. 11 RELATED WORK IDM with functional usage. The literature to date has examined theinputdata field almost exclusively through a functional lens. Two main application families have emerged. •Covert channels. A series of works [ 17,18] show that ordinary transactions can be used to sneak arbitrary data onto a blockchain by piggy-backing extra bytes inside fields meant for contract parameters or script outputs, creating an uncensorable mes- sage board. On Ethereum the bytes are hidden in the input data field [ 19,20] after external encryption processes; on Bitcoin they sit in the 80-byte OP_RETURN output. •On-chain inscription. With the rise of inscription, users began packing Base64-encoded JPEG/GIF fragments into IDMs to mint so-called vanilla NFTs, i.e. digital artifacts that live fully on L1 without an ERC-721 contract. However, the vast body of non-functional messages that users voluntarily embed are unexplored. We fill the gap by providing the first analysis of IDMs as a decentralized communication channel, extending the purely utilitarian perspective of prior studies.LLM-assisted Blockchain Analyses. Large-language models have recently become a versatile lens on on-chain data. The first wave of studies focused on smart-contract vulnerability detection by con- verting Solidity byte- or source-code into natural-language–like tokens that GPT-series and code-centric LLMs (e.g., CodeBERT, CodeT5) can reason over, outperforming classic symbolic analyzers on re-entrancy, unchecked call and access-control flaws [24–32]. Beyond code auditing, researchers applied foundation models to higher-level blockchain artifacts, including transaction-graph understanding [ 33], entity labeling [ 34], regulation mappings [ 35], code generation [ 36], gas analysis [ 37], and anomaly detection [ 34]. On-chain Empirical Study. Blockchains offer a uniquely rich public data source, far more open than the proprietary logs held by traditional financial platforms. A typical empirical workflow (i)har- vests raw blocks and mempool traces, (ii)reconstructs higher-level objects (e.g., token balances), and (iii)applies graph, economet- ric, or NLP techniques to extract insight. Using this recipe, prior work has mapped decentralized exchanges [ 38], arbitrage dynam- ics [39,40], profiled NFT markets [ 23,41], crypto scams [ 42,43], and even “black-swan” events. Those studies treat the transaction input data field as an opaque payload, or even prune it for space (e.g., EIP-4444 [ 45]). However, we place that field at the centre stage and conduct the first IDM analysis at scale. We uncover a user-facing communication layer that has been largely invisible to prior empirical research. 12 LIMITATIONS AND FUTURE WORK Limitations. Due to the unique features of IDMs and their analyti- cal challenges (§2), we leverage LLMs to support several tasks, such as language detection, topic and sentiment classification. While LLM outputs are sensitive to prompt design and model behav- ior [46,47], our prompts are carefully designed and constructed. In addition, we involve human review to ensure classification consis- tency. We do not treat the LLM as ground truth, but rather as an assisting tool for human-guided analysis. Future Work. Future work may extend our LLM-assisted analysis by developing more robust and scalable pipelines. This may include model fine-tuning and cross-model validation. Building a labeled dataset from IDMs may also enable training domain-adapted classi- fiers for more systematic analysis. Additionally, our findings reveal that Ethereum lacks a built-in content moderation infrastructure for toxic IDMs. Future work could explore decentralized moderation designs to mitigate IDM misuse and achieve harm prevention. 13 CONCLUSION By adopting a “transaction-as-communication” perspective, this paper presents the first large-scale, systematic analysis of Ethereum Input Data Messages (IDMs). Our analysis reveals cross-cultural divergences, emotional structures, functional intentions, network patterns, security implications, and governance challenges embed- ded in on-chain messages. We hope these findings help establish a new paradigm for understanding blockchain not only as a financial infrastructure, but as a socio-technical medium for decentralized communication. We also envision that this work will serve as a foundation for interdisciplinary research to explore and improve the social functionality of decentralized systems. 13 REFERENCES  Satoshi Nakamoto. Bitcoin: A peer-to-peer electronic cash system. Available at: https://bitcoin.org/bitcoin.pdf, 2008. Gavin Wood. Ethereum: A secure decentralised generalised transaction ledger. Ethereum project yellow paper, 151:1–32, 2014. Andreas M Antonopoulos and Gavin Wood. Mastering ethereum: building smart contracts and dapps. O’reilly Media, 2018. Teck Yuan Lee. Etherscan information center: Understanding transaction input data. Retrieved by May 2025, https://info.etherscan.com/understanding-transacti on-input-data/, 2023. TRM Labs. The Bybit hack: Following North Korea’s largest exploit. Retrieved by May 2025, https://www.trmlabs.com/resources/blog/the-bybit-hack-f ollowi ng-north-koreas-largest-exploit, 2025. Tommi Jauhiainen, Marco Lui, Marcos Zampieri, Timothy Baldwin, and Krister Lindén. Automatic language identification in texts: A survey. Journal of Artificial Intelligence Research, 65:675–782, 2019. Sam Werner, Daniel Perez, Lewis Gudgeon, Ariah Klages-Mundt, Dominik Harz, and William Knottenbelt. SoK: Decentralized finance (DeFi). In ACM Conference on Advances in Financial Technologies (AFT), pages 30–46, 2022. Erya Jiang, Bo Qin, Qin Wang, Zhipeng Wang, Qianhong Wu, Jian Weng, Xinyu Li, Chenyang Wang, Yuhang Ding, and Yanran Zhang. Decentralized finance (DeFi): A survey. arXiv preprint arXiv:2308.05282, 2023. Michelle Rodino-Colocino. Me too,# metoo: Countering cruelty with empathy. Communication and critical/cultural studies, 15(1):96–100, 2018. Ethereum. Ethereum.org: The history of ethereum. Retrieved by May 2025, https://ethereum.org/en/history/, 2019. Akhunov Alexey, Sasson Eli Ben, Brand Tom, Guthmann Louis, and Levy Avihu. EIP-2028: Transaction data gas cost reduction (settled). Retrieved by May 2025, https://eips.ethereum.org/EIPS/eip-2028, 2019. Vincent D Blondel, Jean-Loup Guillaume, Renaud Lambiotte, and Etienne Lefeb- vre. Fast unfolding of communities in large networks. Journal of Statistical Mechanics: Theory and Experiment, 2008(10):P10008, 2008. Liyi Zhou, Xihan Xiong, Jens Ernstberger, Stefanos Chaliasos, Zhipeng Wang, Ye Wang, Kaihua Qin, Roger Wattenhofer, Dawn Song, and Arthur Gervais. Sok: Decentralized finance (DeFi) attacks. In IEEE Symposium on Security and Privacy (SP), pages 2444–2461. IEEE, 2023. Zhipeng Wang, Stefanos Chaliasos, Kaihua Qin, Liyi Zhou, Lifeng Gao, Pascal Berrang, Benjamin Livshits, and Arthur Gervais. On how zero-knowledge proof blockchain mixers improve, and worsen user privacy. In Proceedings of the ACM Web Conference (WWW), pages 2022–2032, 2023. Robert Gorwa, Reuben Binns, and Christian Katzenbach. Algorithmic content moderation: Technical and political challenges in the automation of platform governance. Big Data & Society, 7(1):2053951719897945, 2020. Wenrui Zuo, Raul J Mondragon, Aravindh Raman, and Gareth Tyson. Under- standing and improving content moderation in web3 platforms. In Proceedings of the International AAAI Conference on Web and Social Media, volume 18, pages 1859–1870, 2024. Tao Zhang, Qianhong Wu, et al. Covert communication via blockchain: Hiding patterns and communication patterns. Computer Standards & Interfaces (CSI), 90:103851, 2024. Tao Zhang, Bingyu Li, Yan Zhu, Tianxu Han, and Qianhong Wu. Covert channels in blockchain and blockchain based covert communication: Overview, state-of- the-art, and future directions. Computer Communications, 205:136–146, 2023. Shaoyuan Liu, Zhi Fang, Feng Gao, Bakh Koussainov, Zijian Zhang, Jiamou Liu, and Liehuang Zhu. Whispers on Ethereum: Blockchain-based covert data embedding schemes. In ACM International Symposium on Blockchain and Secure Critical Infrastructure (BSCI@AsiaCCS), pages 171–179, 2020. Zhuo Chen, Liehuang Zhu, Peng Jiang, Can Zhang, Feng Gao, Jialing He, Dawei Xu, and Yan Zhang. Blockchain meets covert communication: A survey. IEEE Communications Surveys & Tutorials, 24(4):2163–2192, 2022. Liehuang Zhu, Qi Liu, Zhuo Chen, Can Zhang, Feng Gao, and Zhongliang Yang. A novel covert timing channel based on bitcoin messages. IEEE Transactions on Computers (TC), 72(10):2913–2924, 2023. Ningran Li, Minfeng Qi, et al. Bitcoin inscriptions: Foundations and beyond. IEEE International Conference on Blockchain and Cryptocurrency (ICBC), 2024. Johnnatan Messias, Krzysztof Gogol, Maria Inês Silva, and Benjamin Livshits. The writing is on the wall: Analyzing the boom of inscriptions and its impact on EVM-compatible blockchains. Companion of the ACM Web Conference (Work- shop@WWW), 2025. Chong Chen, Jianzhong Su, Jiachi Chen, Yanlin Wang, Tingting Bi, Jianxing Yu, Yanli Wang, Xingwei Lin, Ting Chen, and Zibin Zheng. When ChatGPT meets smart contract vulnerability detection: How far are we? ACM Transactions on Software Engineering and Methodology (TOSEM), 2023. Sally Junsong Wang, Kexin Pei, and Junfeng Yang. Smartinv: Multimodal learning for smart contract invariant inference. In IEEE Symposium on Security and Privacy (SP), pages 2217–2235, 2024. Jiaze Sun, Zhiqiang Yin, Hengshan Zhang, Xiang Chen, and Wei Zheng. Ad- versarial generation method for smart contract fuzz testing seeds guided by chain-based llm. Automated Software Engineering (ASE), 32(1):1–28, 2025. Peter Ince, Xiapu Luo, Jiangshan Yu, Joseph K Liu, and Xiaoning Du. Detect llama-finding vulnerabilities in smart contracts using large language models. Australasian Conference on Information Security and Privacy (ACISP), 2024. Yuqiang Sun, Daoyuan Wu, Yue Xue, Han Liu, Haijun Wang, Zhengzi Xu, Xiaofei Xie, and Yang Liu. Gptscan: Detecting logic vulnerabilities in smart contracts by combining GPT with program analysis. In Proceedings of the IEEE/ACM International Conference on Software Engineering (ICSE), pages 1–13, 2024. Wei Ma, Daoyuan Wu, Yuqiang Sun, Tianwen Wang, Shangqing Liu, Jian Zhang, Yue Xue, and Yang Liu. Combining fine-tuning and LLM-based agents for intuitive smart contract auditing with justifications. Proceedings of the IEEE/ACM International Conference on Software Engineering (ICSE), 2025. Huilin Ge, Ze Wang, Runbang Liu, Zhiwen Qiu, Jie Xia, Ting Chen, and Hongzi Zhu. Adapting large language models for smart contract defects detection in the open network blockchain. IEEE Internet of Things Journal (IOTJ), 2025. ZeKe Xiao, Qin Wang, Hammond Pearce, and Shiping Chen. Logic meets magic: LLMs cracking smart contract vulnerabilities. IEEE International Conference on Blockchain and Cryptocurrency (ICBC), 2025. Zongwei Li, Xiaoqi Li, Wenkai Li, and Xin Wang. SCALM: Detecting bad practices in smart contracts through LLMs. The Association for the Advancement of Artificial Intelligence (AAAI), 2025. Yuchen Lei, Yuexin Xiang, et al. Large language models for cryptocurrency transaction analysis: A Bitcoin case study. arXiv preprint arXiv:2501.18158, 2025. Régnier Avice, Bernhard Haslhofer, Zhidong Li, and Jianlong Zhou. Linking cryp- toasset attribution tags to knowledge graph entities: An LLM-based approach. Financial Cryptography and Data Security (FC), 2025. Junliang Luo, Xihan Xiong, William Knottenbelt, and Xue Liu. Decoding SEC actions: Enforcement trends through analyzing blockchain litigation using LLM- based thematic factor mapping. The International Conference on Artificial Intelli- gence and Law (ICAIL), 2025. Ye Liu, Yue Xue, Daoyuan Wu, Yuqiang Sun, Yi Li, Miaolei Shi, and Yang Liu. Prop- ertyGPT: LLM-driven formal verification of smart contracts through retrieval- augmented property generation. Network and Distributed System Security (NDSS) Symposium, 2025. Jinan Jiang, Zihao Li, Haoran Qin, Muhui Jiang, Xiapu Luo, Xiaoming Wu, Haoyu Wang, Yutian Tang, Chenxiong Qian, and Ting Chen. Unearthing gas-wasting code smells in smart contracts with large language models. IEEE Transactions on Software Engineering (TSE), 2024. Jianlei Han, Shiyang Huang, and Zhuo Zhong. Trust in defi: an empirical study of the decentralized exchange. Available at SSRN, 3896461, 2021. Zhiying Wu, Jiajing Wu, Hui Zhang, Zibin Zheng, and Weiqiang Wang. Hunting in the dark forest: A pre-trained model for on-chain attack transaction detection in web3. In Proceedings of the ACM on Web Conference (WWW), 2025. Philip Daian, Steven Goldfeder, Tyler Kell, Yunqi Li, Xueyuan Zhao, Iddo Bentov, Lorenz Breidenbach, and Ari Juels. Flash boys 2.0: Frontrunning in decentralized exchanges, miner extractable value, and consensus instability. In IEEE symposium on security and privacy (SP), pages 910–927, 2020. Qin Wang and Guangsheng Yu. BRC-20: Hope or hype. arXiv preprint arXiv:2310.10652, 2023. Jingjing Yang, Jieli Liu, Dan Lin, Jiajing Wu, Baoying Huang, Quanzhong Li, and Zibin Zheng. Who stole my NFT? investigating web3 NFT phishing scams on Ethereum. IEEE Transactions on Information Forensics and Security (TIFS), 2024. Manuel Bolz, Kevin Bründler, Liam Kane, Panagiotis Patsias, Liam Tessendorf, Krzysztof Gogol, Taehoon Kim, and Claudio Tessone. Machine learning-based detection of pump-and-dump schemes in real-time. IEEE International Conference on Blockchain and Cryptocurrency (ICBC), 2025. Qin Wang, Guangsheng Yu, and Shiping Chen. Cryptocurrency in the aftermath: Unveiling the impact of the SVB collapse. IEEE Transactions on Computational Social Systems (TCSS), 2024. Kadianakis George, lightclient, and Stokes Alex. EIP-4444: Bound historical data in execution clients (stagnant). Retrieved by May 2025, https://eips.ethereum.or g/EIPS/eip-4444, 2021. Ruiyang Zhou, Lu Chen, and Kai Yu. Is LLM a reliable reviewer? a comprehensive evaluation of LLM on automatic paper reviewing tasks. In Proceedings of the Joint International Conference on Computational Linguistics, Language Resources and Evaluation, pages 9340–9351, 2024. Li Zhong and Zilong Wang. Can LLM replace stack overflow? a study on robustness and reliability of large language model code generation. In Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), volume 38, pages 21841– 21849, 2024. A LLM PROMPT EXAMPLE 14 Listing 1: LLM prompt for IDM emotion classification. defanalyze_IDM_sentiment_using_LLM(message: str): prompt = f\"\"\" You are tasked with analyzing blockchain input data messages (IDMs), which may include both structured tokens (e.g., wallet addresses, transaction hashes) and natural language content. Your objective is to extract the dominant human emotion conveyed in the natural language portion of the message. Instructions: 1. Focus on the natural language content. Disregard structured tokens unless they contribute to the emotional tone. 2. Identify the most appropriate emotion label (e.g., ’Positive-Joy’) using the taxonomy provided below. 3. For that label, also provide: - An intensity score (1–10), reflecting the strength of emotional expression. - A confidence score (0.0–1.0), reflecting your certainty in the label assignment. Note: When evaluating emojis, consider them only if they support coherent emotional meaning in context. Ignore isolated or repetitive emoji sequences lacking semantic relevance. ### Emotive taxonomy with definitions: - Positive-Joy: Expressions of happiness, celebration, or emotional uplift. - Positive-Trust: Expressions of belief, confidence, or endorsement toward a person, group, or project. - Positive-Warmth: Light, friendly, and kind expressions, such as greetings, farewells, or general goodwill. - Positive-Love: Strong emotional attachment, romantic or platonic affection, and heartfelt personal expression. - Positive-Hope: Positive expectations, future-oriented optimism, or messages expressing wishes or aspirations. - Positive-Gratitude: Appreciation, praise, thanks, or motivational support toward others. - Negative-Anger: Strong emotional reaction of frustration or outrage, often over perceived injustice. - Negative-Hostility: Targeted verbal aggression, threats, insults, or confrontational language. - Negative-Sadness: Expressions of grief, loss, hopelessness, or emotional pain. - Negative-Fear: Messages that express anxiety, suspicion, or caution about risks, scams, or vulnerabilities. - Negative-Disgust: Moral/emotional revulsion, often directed at people/blockchain projects in our context. - Negative-Guilty: Apologies, self-blame, regret, or acknowledgment of fault or failure. - Neutral-Surprise: Statements of astonishment. - Neutral-Confusion: Expressions of uncertainty, lack of understanding, or requests for clarification. - Neutral-Politeness: Routine formalities or courteous phrases such as greetings, closings, or expressions of etiquette, low in emotional intensity. - Neutral-Curiosity: Genuine or exploratory questions reflecting a desire to understand or inquire. If no human emotion is detected, assign a label from the non-emotive taxonomy below. ### Non-emotive taxonomy with definitions: - Functional-Technical: Functional messages like code, transaction record, or deployment notices without emotional intent. - Functional-Operational: On-chain activity logs or declarative statements describing state changes or system behavior, without subjective emotion or human-directed intent. - Uninterpretable-Unclear: Partially readable or human-like messages that are semantically ambiguous, fragmented, or incoherent, making emotional interpretation unreliable. - Uninterpretable-Garbage: Non-linguistic or noise-like content such as long base64 strings, hex data, emoji floods, or meaningless character sequences, with no interpretable intent or emotion. Output format: Return a list in the format: [label, intensity, confidence] - For emotive messages: provide a label from the emotive taxonomy, an intensity score (1--10), and a confidence score (0.0--1.0). - For non-emotive messages: provide a label from the non-emotive taxonomy, set intensity to `null `, and include the confidence score. Now analyze the following message: \\\"\\\"\\\"{message}\\\"\\\"\\\" \"\"\" response = client.chat.completions.create( model = \"openai/gpt-4o-2024-11-20\", messages = [ {\"role\": \"user\", \"content\": prompt} ], temperature = 0.2) returnresponse.choices.message.content 15",
  "text_length": 92528
}