{
  "id": "http://arxiv.org/abs/2505.24862v1",
  "title": "ViStoryBench: Comprehensive Benchmark Suite for Story Visualization",
  "summary": "Story visualization, which aims to generate a sequence of visually coherent\nimages aligning with a given narrative and reference images, has seen\nsignificant progress with recent advancements in generative models. To further\nenhance the performance of story visualization frameworks in real-world\nscenarios, we introduce a comprehensive evaluation benchmark, ViStoryBench. We\ncollect a diverse dataset encompassing various story types and artistic styles,\nensuring models are evaluated across multiple dimensions such as different\nplots (e.g., comedy, horror) and visual aesthetics (e.g., anime, 3D\nrenderings). ViStoryBench is carefully curated to balance narrative structures\nand visual elements, featuring stories with single and multiple protagonists to\ntest models' ability to maintain character consistency. Additionally, it\nincludes complex plots and intricate world-building to challenge models in\ngenerating accurate visuals. To ensure comprehensive comparisons, our benchmark\nincorporates a wide range of evaluation metrics assessing critical aspects.\nThis structured and multifaceted framework enables researchers to thoroughly\nidentify both the strengths and weaknesses of different models, fostering\ntargeted improvements.",
  "authors": [
    "Cailin Zhuang",
    "Ailin Huang",
    "Wei Cheng",
    "Jingwei Wu",
    "Yaoqi Hu",
    "Jiaqi Liao",
    "Zhewei Huang",
    "Hongyuan Wang",
    "Xinyao Liao",
    "Weiwei Cai",
    "Hengyuan Xu",
    "Xuanyang Zhang",
    "Xianfang Zeng",
    "Gang Yu",
    "Chi Zhang"
  ],
  "published": "2025-05-30T17:58:21Z",
  "updated": "2025-05-30T17:58:21Z",
  "categories": [
    "cs.CV"
  ],
  "pdf_url": "http://arxiv.org/pdf/2505.24862v1",
  "full_text": "ViStoryBench: Comprehensive Benchmark Suite for Story Visualization Cailin Zhuang1,2,3,∗Ailin Huang2,∗,†Wei Cheng2,†Jingwei Wu2 Yaoqi Hu3Jiaqi Liao2,4Hongyuan Wang2Xinyao Liao2 Weiwei Cai2Hengyuan Xu2Xuanyang Zhang2Xianfang Zeng2 Zhewei Huang2,‡Gang Yu2,‡Chi Zhang4,‡ ∗Equal contribution†Project lead‡Corresponding authors 1ShanghaiTech University2StepFun 3AIGC Research4AGI Lab, Westlake University Dataset Code Project Page Story Explorer Abstract Story visualization, which aims to generate a sequence of visually coherent images aligning with a given narrative and reference images, has seen significant progress with recent advancements in generative models. To further enhance the perfor- mance of story visualization frameworks in real-world scenarios, we introduce a comprehensive evaluation benchmark, ViStoryBench. We collect a diverse dataset encompassing various story types and artistic styles, ensuring models are evalu- ated across multiple dimensions such as different plots (e.g., comedy, horror) and visual aesthetics (e.g., anime, 3D renderings). ViStoryBench is carefully curated to balance narrative structures and visual elements, featuring stories with single and multiple protagonists to test models’ ability to maintain character consistency. Additionally, it includes complex plots and intricate world-building to challenge models in generating accurate visuals. To ensure comprehensive comparisons, our benchmark incorporates a wide range of evaluation metrics assessing critical aspects. This structured and multifaceted framework enables researchers to thor- oughly identify both the strengths and weaknesses of different models, fostering targeted improvements. 1 Introduction In recent years, story visualization [ 77,6,89] has become an increasingly fascinating and rapidly evolving domain. The primary objective of story visualization is to produce a sequence of visually consistent images that faithfully represent a given narrative and align with provided reference images, ultimately delivering an engaging and immersive storytelling experience. This capability holds immense potential across various domains, including entertainment and education. Recent progress in generative models [ 75,40,48] have propelled the AI-driven creation of images and videos into practical, open-domain applications. Compared to general image or video generation quality evaluation [ 24,23,64,21,62], evaluating story visualization involves more dimensions. In addition to considering the diversity and aesthetics of the generated images, story visualization also needs to focus on character portrayal. Recent works [ 71,77,74] often only observe a limited number of indicators for experiments, and there is no uniformity across different literature. Moreover, evaluating models on restricted topics and scenarios does not fully reflect their capabilities in real-world situations. To comprehensively advance thearXiv:2505.24862v1 [cs.CV] 30 May 2025 <Plot Correspondence>It's time for the little rabbit to go to bed, but he tightly holds onto the big rabbit's ears and refuses to let go. <Setting Description> Nighttime, bedroom, cozy atmosphere, soft bedding, a small night light on the bedside table… <Shot Perspective Design> Medium shot, eye level shot. <Characters Appearing> Little Brown Rabbit, Big Brown Rabbit. <Static Shot Description> The little brown rabbit sits on the bed, tightly holding the big brown rabbit‘s ears, with a playful and cute… LLM<Character Name> Little Brown Rabbit <Description> A little rabbit with chestnut fur, bright eyes, small and… Big Brown Rabbit Little Brown Rabbit··· Story 03: Chinese Ancient CourtStory 09: German Fairy TalesStory 26: HorrorStory 29: Ancient Japanese LegendsStory 52: FantasyDataset ConstructionCastsDataset Statistics Shot 2Shot NShot 3Shot 1<Raw Story>Little brown rabbit, who was going to bed, held on right to Big brown rabbit's very long ears. He wanted to be sure that Big brown rabbit was listening.… Manual CollectionAI Generation Number of Characters Number of Shots<Character Name>Big Brown Rabbit <Description>A warm and kind big rabbit with chestnut fur, tall and... Category Gender 12Figure 1: Overview of scripts of ViStoryBench.Dataset Construction: we create a story construction pipeline empowered by LLMs. Casts: the character reference images are collected manually with the same style. Dataset Statistics: Ssamples and distribution of realistic and unrealistic story are shown upper, and story category and casts statistics are illustrated below. performance of the story visualization framework and various methods in in-the-wild scenarios, there is an urgent need to establish a comprehensive evaluation benchmark. In this paper, we introduce ViStoryBench, a comprehensive benchmark for story visualization. Our benchmark is characterized by the following key features: Multifaceted Dataset Creation: We focus on creating a diverse dataset that encompasses various story types and artistic styles. This diversity ensures that models can be evaluated across multiple dimensions, including different plots (such as comedy and horror) and visual aesthetics (like anime and 3D renderings). We carefully curate 80 story segments with 344 roles to balance narrative structures and visual elements. ViStoryBench includes stories with both single and multiple protagonists, testing the models’ ability to maintain character consistency. Additionally, it features complex plots and intricate world-building, challenging models to generate accurate visual content. Comprehensive Evaluation Metrics: Beyond the general evaluation metrics for image generation methods, such as image quality, diversity, and general prompt adherence, we have also quantified several attributes that are particularly important in story visualization. These include the stylistic consistency of the entire generated sequence, the alignment of characters’ actions and interactions with the given descriptions, the liveliness of the generated characters rather than simply copying and pasting reference images, and the correctness of the character sets in each generated scene. Our benchmark incorporates a wide range of evaluation metrics. Our test involves 12 automated evaluation metrics. This structured and multifaceted framework enables researchers to thoroughly identify both the strengths and weaknesses of different models, thus fostering targeted improvements. Extensive Model Evaluation: We have conducted extensive evaluation tests on over twenty methods (18 principal methods and their variants). We have analyzed the consistency between user studies and automated metrics, providing insights into model characteristics. We release the entire benchmark, details of the prompts used in the data construction pipeline, automatic and manual evaluation results for each model, and the code necessary to reproduce the automatic evaluation results. Our goal is to drive future advancements in the field of story visualization. 2 Related Work 2.1 Story Visualization Recent advancements in diffusion and auto-regressive models have driven significant progress in multimodal long-story generation and visualization, particularly in addressing visual consistency and cross-modal sequence coherence. 2 For story image generation [ 84,57,52,53,33,3,43,22,61,66,58,32,41,85,30,14], methods focus on enhancing cross-frame alignment. UNO [ 72] combines progressive cross-modal alignment with rotary positional encoding for high-consistency multi-subject image synthesis. SeedStory [ 78] leverages Multimodal Large Languages Models (MLLM) and SDXL [ 54] for story continuation, while StoryGen [ 37] adopts auto-regressive conditioning on historical images/text. Training-free approaches like StoryDiffusion [ 89] (consistent self-attention) and Story-Adapter [ 44] (iterative refinement) improve long-range coherence. TheaterGen [ 6] uses LLMs for character state tracking. Earlier frameworks StoryGAN [ 34] employs dual discriminators to enforce sentence-image pair consistency. Comic generation [5, 70, 4] is also a derivative task of story visualization. In story video generation [ 31,65,25,82,87,19,26], MovieAgent [ 69] employs multi-agent reasoning for synchronized narrative, audio, and subtitles. AnimDirector [ 35] expands prompts into story sequences via LLMs, generated image filtered by VLMs, while Vlogger [ 92] directly maps scripts to visual prompts. MMStoryAgent [ 76] further integrates character libraries for multi-scene videos. DreamRunner [ 68] creates long-form, multi-action, multi-scene story videos through retrieval- augmented motion adaptation. Our benchmark primarily focuses on image-level evaluation. For video generation methods, we will extract video frames for evaluation in our benchmark. Furthermore, Story3D-Agent [ 28] and SIMS [ 67] extend story visualization into the 3D domain. Closed-source MLLMs (e.g., GPT-4o [ 29], Gemini [ 10]) and commercial platforms (e.g., Morphic Studio [ 49], MOKI [ 47], Doubao [ 18]) have begun to accelerate the transition of story visualization from research to real-world applications. Current research continues to grapple with challenges such as multi-image coherence maintenance, long-range dependency modeling, fine-grained controllability, and alignment with complex textual prompts. 2.2 Datasets and Benchmark We list the datasets [ 27,20,34,79,80] related to the story visualization task in the Appendix. Story visualization datasets exhibit significant growth and evolution trends in terms of scale, resolution, automated generation, and stylistic diversity, reflecting technological advancements and the expansion of research interests. In the realms of video generation and visual storytelling, several benchmarks have emerged. Story- Bench [ 1] offers a multi-task framework evaluating text-to-video models across action execution, story continuation, and story generation. DreamSim [ 15] introduces a holistic perceptual similarity metric surpassing traditional pixel-level comparisons. The Short Film Dataset (SFD) [ 17] focuses on long-term, story-oriented video tasks with diverse genres. StoryEval assesses story completion capa- bilities in text-to-video models using advanced vision-language models. MovieBench [ 73] provides movie-length videos with rich narratives for long video generation analysis. RISEBench [ 88] is the first benchmark for reasoning-informed visual editing, covering temporal, causal, spatial, and logical reasoning. DropletVideo [ 86] explores spatio-temporal consistency in video generation with a large dataset of dynamic camera motions. MovieAgent [ 74] automates movie generation via multi-agent planning, reducing human effort. VinaBench [ 16] enhances visual narrative generation by annotating commonsense and discourse constraints, improving faithfulness and cohesion. These benchmarks collectively present new challenges and opportunities for advancing related research. 3 ViStoryBench 3.1 Problem Definition Based on some prior work [ 34,36,79], we design a story generation task with relatively com- prehensive given conditions. Given a story script, we first provide the appearance descriptions T1, T2,..., T nand corresponding images S1, S2,..., S nforncharacters C1, C2,..., C n, where TiandSiare consistent with each other, and Ci= (Ti, Si). Next, we provide mstoryboard shot descriptions: Shot 1, Shot 2,..., Shot m. Each Shot iincludes a text description that contains the following content: •Setting Description: The description of the setting of current scene. •Plot Correspondence: The story segment from the original narrative corresponding to this shot. •Onstage Characters: A list of characters present in the current shot. 3 Onstage Character Count Matching Qingqing<StaticShotDescription>Qingqingsitsbythehospitalbed, holdingMother'shand,her expressionsadandconcerned.Motherliesinbed,pale-faced,her eyesgentleyetdetermined.QingqingliesinbedMothersitsbythehospitalbed <On-stage Characters>Aladdin Amount MismatchGeneratedShot MotherCopy-pasteNon-Copy-paste QingqingMotherReferenceimages Prompt Adherence GeneratedShotPromptMismatch132Copy Paste DetectionSelf-Similarity Lack of self-similarityFigure 2: Illustration of generation mismatches in story visualization. •Static Shot Description: A description of the static actions or positions of characters and objects in the frame, representing a fixed visual state. •Shot Perspective Design: Photography information, including descriptions of shot scale, shot type, and camera angle. The objective of the story visualization task is to generate a sequence of images I1...Imthat faithfully represent the described storyboard shots, adhering to the provided prompts and character information. This involves accurately depicting the characters, their actions, the scene settings, and the specified camera perspectives. The specific quantitative evaluation method will be described later. 3.2 Source Data Story and Script. We strive for diversity in the stories involved in the benchmark. We manually collect 80 story segments from various sources such as film and television scripts, literary master- pieces, legends from around the world, novels, and picture books. For stories that are too long, we will have LLM assist humans in summarizing them, resulting in each story having hundreds of words. Then, we convert the story into a script that includes character descriptions and storyboards, with the assistance of an LLM. There is an example in Figure 1(a). Character Reference Image. We manually collect images from the Internet that align with the character descriptions for each character. We ensure consistent character image styles within the same story, as shown in Figure 1(b). Reference images for a small portion of the characters were generated using SDXL [ 54]. Some basic statistics are presented in Figure 1(c). In total, there are 344 characters and 509 reference images for the characters. More details on source data collection and statistics are described in the Appendix. 3.3 Evaluation Metrics Overview. We present a comprehensive suite of evaluation metrics to gauge story visualization model performance across various dimensions. We showcase some typical issues in story visualization results in Figure 2 to facilitate an intuitive understanding of the evaluation metric development. Automated evaluation metrics include the following aspects: 4 Character A CharacterBReference ImagesGenerated Shots EmbeddingExtractor EmbeddingExtractorShot1embeddingShot2embedding CharacterACharacterBShot1 Bboxs Shot 1 Shot 2Succeed MatchesBbox: [p1, p2, p3, p4]Cross-Sim Score: 0.85Self-Sim Score: 0.91MatchingFailed MatchesBbox:nullCross-Sim score: 0.0Self-Sim score: 0.0Self SimilarityCross Similarity Ref embedding CharacterACharacterBShot2 Bboxs Grounding-DINO ArcFaceRealistic? Non-Realistic? CLIPEmbeddingExtractor Image & Prompt Image Crops Figure 3: CIDS calculation pipeline. Cross-Similarity and Self-Similarity are computed. •Cross-Similarity and Self-Similarity: Assessing the resemblance between generated images and reference images, as well as the consistency within the generated images themselves. •Prompt Adherence: Measuring how well the generated images align with the storyboard descriptions provided in the prompts. We primarily use GPT-4.1[ 50] for automated evaluation and also specifically calculate the accuracy of the number of characters in each generated image. •Aesthetic and Copy-Paste: Additionally, we evaluate the aesthetic metric, generation quality and diversity of the generated results. We specifically design a Copy-Paste Detection to check if the model excessively references the character reference images. Preliminary. We briefly introduce the models and tools used. Grounding DINO [ 83,39] is an open- set object detector. Grounding DINO [ 39] can detect objects in images based on text descriptions. We can utilize Grounding DINO [ 39] to crop out the bounding box of a character that match a specific description from either character reference images or generated images. For character reference images, Grounding DINO [ 39] merely crops some edges of the pictures. However, when dealing with generated images, Grounding DINO [ 39] might fail to locate matching characters, in which case it will return an empty result. For a cropped character image, if the content is a realistic character, we use ArcFace [ 11] for feature extraction; otherwise, we use CLIP [ 55] for feature extraction. Both feature extraction methods generate a 512-dimensional feature vector for each character. When extracting the style features of the entire image, we use the model provided by CSD [ 59], a CLIP [ 55] model fine-tuned on a large dataset of style images. In addition, we utilize the Inception Score (IS) [ 56] with Inception V3 model and Aesthetic Predictor V2.5 [ 12] to evaluate diversity and aesthetic quality, respectively. IS evaluates a batch of generated images based on clarity and diversity. Aesthetic Predictor V2.5 [ 12] is a SigLIP-based [ 81] predictor that assesses the aesthetics of an image on a scale from 1 to 10. It tends to assign lower scores to images that are blurry, noisy, or are perceived as less visually appealing. Images with scores of 5.5 or higher are considered to have excellent quality. Next, we briefly introduce how to specifically calculate each metric, with some details expanded further in the Appendix. We convert the cosine similarity and the original rating scale of 0 to 4 into a hundred-point scale for presentation. Character Identification Similarity (CIDS). As depicted in Figure 3, we first utilize Grounding DINO [ 39] along with character description prompts to first crop out specific characters from the reference image. We then extract features using CLIP [ 55]. Subsequently, we again employ Grounding DINO  and character description prompts to crop potential human subjects from the generated image. After extracting CLIP [ 55] features, we compute similarity with the features from the reference image and perform matching. This process allows us to obtain the characters matched to each human subject in the outputs, as well as the successfully matched human CLIP [ 55] features and bounding boxes. Then we calculate the cosine similarity between the CLIP [ 55] features of the matched characters in all output scenes and their corresponding reference features. Finally, we take the average. 5 GPT-4 ScenescoreCamerascoreGlobalcharacteractionscore Singlecharacteractionscore <PlotCorrespondence><ShotPerspectiveDesign><On-stageCharacters><SettingDescription><Static Shot Description> GeneratedShots…ShotsCroppedImages <ShotPerspectiveDesign>Wideshot,high-angleshot Camerascore:4 Camerascore:2 UNO SeedStory<Static Shot Description> Rostov curlsup bythe campfire, shivering,expressionpained, attemptingtosleep Singlecharacteractionscore:4 Singlecharacteractionscore:2 StoryDiffusion UNO<SettingDescription>Daytime, AuntPolly'sroom,containsa bed,acloset,andatablewitha jarofpreservesonit. Scenescore:4 Scenescore:2 StoryAdapterUNO<StaticShotDescription>The bigrabbitpicksupthelittle rabbitand swingshim overhis head. Globalcharacteractionscore:4 Globalcharacteractionscore:0GPT-4o StoryDiffusionShot 1Shot NEvaluation PipelineScoring SamplesShot 2Promptadherencescores (0 -4)Figure 4: Prompt adherence evaluation. GPT-4 is used to evaluate prompt adherence scores on four aspects. Scoring samples are also illustrated. Style Similarity. Our style similarity metric, adapted from CSD [ 59], quantifies both self-similarity (within generated images) and cross-similarity (between generated and reference images) through CSD-CLIP [ 59] feature analysis. The process involves three key steps: (1) Encoding each image into visual features using a CLIP [ 55] vision encoder pre-trained on large-scale style datasets; (2) Disentangling content and style features via CSD [ 59] layers, where only the style features are retained; (3) Computing pairwise cosine similarity between style feature embeddings. The final similarity score is obtained by averaging all valid image pairs in the comparison set. Prompt Adherence. Regarding the similarity between the generated images and the provided storyboard descriptions, we categorize them as follows: •Character Interaction Actions: Consistency between the overall character interactions in the generated image and the Static Shot Description in the storyboard description. •Shooting Method: Consistency between the camera shooting method in the generated image and the Shot Perspective Design in the storyboard description. •Static Shot Description: Consistency between the Static Shot Description in the generated image and the Static Shot Description of storyboard description. •Individual Actions: Consistency between the actions/expressions of individual characters after segmentation and actions/expressions in the Static Shot Description of storyboard description. As shown in Figure 4, we have established Likert scale questionnaires to evaluate the consistency of each generated image on a scale from 0to4. Onstage Character Count Matching. We observe that various models struggle to generate the correct set of onstage characters, including both superfluous characters (unexpected additions) and omissive ones (failure to render specified roles), so we specifically calculate the Onstage Character Count Matching (OCCM) score, which is calculated as: OCCM = 100 ∗exp\u0012 −|D−E| ϵ+E\u0013 (1) where Ddenotes the detected number of Onstage Characters, Erepresents the expected character count from storyboard specifications, and ϵ=e−6is smoothing factor to prevent division by zero. 6 Copy Paste Detection. A prevalent shortcut employed by generative models in story visualization task is the direct \"copy-pasting\" of character reference images. To gauge the extent of this phe- nomenon, we devise a \"copy-paste degree\" metric, where a higher value signifies a greater propensity of the model to replicate characters directly from reference images. Specifically, for methods limited to single-image input, we compute the disparity in similarity between the output characters and both the input image and an alternative reference image. This disparity is then averaged across all output images and character samples, and subsequently across all stories equipped with alternative reference images. In the case of models supporting multi-image input, this metric calculation is omitted. Image Quality. For each generation method, we calculate the aesthetic quality score of all its generated results and average them. The same applies to the calculation of IS. 4 Diagnosis of Evaluation Result 4.1 Experimental Setup Our benchmark comes in two versions: the complete ViStoryBench and ViStoryBench-lite, with the latter being a quarter subset of the former. Through manual curation, our aim is to ensure that the distribution of text styles and character reference image styles in the lite version closely mirrors that of the original version. Specifically, the lite version features 20 stories, with character references comprising 36 animated characters, 41 real people, and 4 non-human entities. The proportion of various types of characters is similar to that of the entire collection. In our main experiments (shown in Table 1), we evaluate a diverse set of methods for both image and video generation. We develop a simple Copy-Paste Baseline. We automatically paste the reference images of the Onstage Characters from each shot onto a 1080p canvas using a program. For image generation, we assess various approaches including StoryDiffusion [ 89], Story-Adapter [ 45], StoryGen [ 37], UNO [ 71], TheaterGen [ 6] and SEED-Story [ 79]. For video generation, we test methods including Vlogger [ 92], MovieAgent [ 74], Anim-Director [ 35], and MM-StoryAgent [ 77]. In the field of story generation, many closed-source commercial software can provide quite good results. However, due to limited resources and other reasons, we can only report their results on the ViStoryBench-lite benchmark. We also include results from some open-source methods as baselines. The results we obtain are from the May 2025 versions of these software, and future results may vary. Due to variations in problem definitions among different methods or software, we discuss the detailed adaptation process in the Appendix. For video generation methods that do not produce images as intermediate results, we select the first frame from each shot-related video. We require most methods or software to produce results in 1080p resolution, although there are exceptions, such as Gemini, where the image size is not completely controllable. Additionally, we provide a continuously maintained leaderboard webpage to encourage robust competition within the community. The final ranking in this table is determined by averaging the ranking indices of each metric, ensuring a balanced consideration of all metrics. The results of some commercial software tests are marked with asterisks. Due to content policy restrictions, certain stories could not generate results normally. Therefore, we only considered the average on the data that successfully generated results, which introduced some discrepancies. User Study. To evaluate the consistency and aesthetic quality of the generated images, we conduct a user study involving participants who assessed the results across three dimensions: Environment Con- sistency, Character Identification Consistency and Subjective Aesthetics. Environment Consistency focuses on whether the scenes within the same environment description appeared visually cohesive. For Character Identification Consistency, participants rate how consistently the main characters are identifiable and coherent throughout the story. Subjective Aesthetics assesses the overall artistic appeal, detail richness, and storytelling effectiveness of the visualizations. Detailed scoring criteria for each dimension are provided in the Appendix. The detailed scoring results will also be open-sourced. We list the top four methods in each category based on user ratings: • Environment Consistency: UNO (82.0), GPT-4o (81.2), Doubao (80.4), Story-Adapter ‡(79.6) ‡: image-ref, scale=5 •Character Identification Consistency: Doubao (92.6), AIbrm (88.4), UNO (84.0), GPT-4o (81.6) 7 Table 1: Automated test results of different methods on ViStoryBench and ViStoryBench-Lite. We use gray backgrounds to mark some results that are excluded from the sorting. Because the SEED-Story is only trained on three animations and does not pursue generalization ability. The Copy-Paste Baseline simply pastes the character reference image as the generated result. For some methods, we test multiple inference configurations and report the results. MethodCSD (Style) CIDS (Character) Alignment OCCM Inception Aesthetics Copy-Paste Cross∗↑Self∗↑Cross∗↑Self∗↑ Score∗↑ Score∗↑ Score↑ Score↑ Degree † The following results are obtained on ViStoryBench Copy-Paste Baseline 72.8 71.5 94.1 98.7 26.2 99.7 6.72 4.48 24.0 - Story Visualizing Method StoryGen  (mixed) 28.8 58.4 34.1 66.7 35.9 86.2 7.31 3.84 1.11 – (auto-regressive) 38.0 53.4 36.0 64.1 36.1 85.8 8.72 4.02 2.17 – (multi-image-condition) 37.1 52.6 35.2 64.0 37.1 86.2 8.89 4.02 1.54 StoryDiffusion  (text-only) 28.6 63.5 30.5 64.8 59.7 85.3 15.71 5.76 0.02 StoryDiffusion  (image-ref) 35.1 55.4 33.8 66.3 61.2 86.8 10.06 5.13 0.11 Story-Adapter  ( ‡) 33.3 73.7 27.7 63.2 58.9 84.9 13.73 4.89 -0.49 – (text-only, scale=0) 29.0 46.1 29.6 60.0 62.7 85.7 16.34 5.18 0.11 – (image-ref, scale=0) 46.2 55.4 35.3 66.5 58.5 85.8 12.98 5.00 0.29 – (text-only, scale=5) 32.6 73.5 27.5 63.5 62.2 85.7 13.13 4.90 -0.16 UNO  (many2many) 40.8 61.0 39.4 67.1 70.4 89.8 12.40 5.23 - TheaterGen  19.9 40.4 27.1 60.5 37.9 84.4 14.88 4.90 0.59 SEED-Story  23.3 74.9 21.7 52.9 29.5 85.9 6.33 3.84 0.17 - Video Generation Method Vlogger  (text-only) 21.4 40.7 26.9 56.6 53.8 84.5 10.48 4.33 0.82 Vlogger  (image-ref) 27.1 45.2 28.6 59.9 55.1 84.5 10.03 4.34 -0.07 MovieAgent  (ROICtrl) 20.0 49.3 27.3 61.4 36.5 86.7 11.63 4.65 0.33 MovieAgent  (SD3) 30.9 48.3 31.6 60.7 76.1 87.5 15.02 5.33 -0.40 Anim-Director  (SD3) 29.8 50.7 33.9 65.3 76.0 88.4 12.04 5.60 0.15 MM-StoryAgent  25.3 66.8 31.3 64.6 52.1 85.2 9.09 5.88 -0.25 The following results are obtained on ViStoryBench-Lite Story-Adapter  ( ‡) 38.2 75.9 29.5 55.0 56.1 81.5 12.03 4.80 -0.15 UNO  (many2many) 44.6 65.6 42.3 69.2 72.1 89.1 10.50 5.13 - MM-StoryAgent  28.0 66.2 32.1 56.6 50.4 82.2 8.09 5.91 0.82 - Commercial Software MOKI  22.9 70.0 29.2 62.6 38.8 82.0 10.36 5.81 0.67 Morphic Studio  59.0 63.8 50.0 66.4 67.5 82.9 9.00 4.96 - AIbrm  42.6 73.0 55.9 76.2 65.2 89.4 9.55 5.73 -0.52 ShenBi  29.2 58.2 34.7 61.1 75.8 85.6 11.60 5.07 0.66 Typemovie  34.2 65.2 39.2 54.6 62.4 84.1 11.16 5.32 -2.20 Doubao  38.6 69.8 39.4 71.4 84.2 87.5 9.88 5.62 0.78 - Multimodal Large Language Model GPT-4o  48.7 68.5 53.2 73.1 89.3 93.4 9.02 5.52 0.97 Gemini-2.0  38.1 58.6 31.5 53.7 76.1 86.9 10.12 4.91 -0.38 ∗: These six indicators are normalized to a hundred-point scale. †: An excessively high value (marked with an underline) may indicate a degradation issue. Some methods that support multi-image input do not support this metric test and are marked as \"-\". ‡: image-ref, scale=5 Table 2: Correlation analysis. Correlations between human evaluations and automated metrics are reported. Metrics Self CSD (Style) Self CIDS (Character) Aesthetics τ 0.4165 0.4978 0.2565 ρ 0.5648 0.6759 0.3966 σ 0.6042 0.7956 0.5411 • Subjective Aesthetics: GPT-4o (85.6), Doubao (85.0), AIbrm (83.0), UNO (80.4) We establish one-to-one correspondences between three human evaluation metrics and automated metrics, similar with Theatergen [ 6]: Character Identification Consistency corresponds to CIDS, Environment Consistency to Style Similarity, and Subjective Aesthetics to Aesthetic Quality. Subse- quently, we evaluate the correlation coefficients between automated metrics and human evaluation results, including Kendall’s τ, Spearman’s ρ, and Pearson’s σ, as shown in Table 2.The results demonstrate that automated metrics can effectively reflect human preferences. In this analysis, we exclude results from StoryGen [ 37], as its limited generation quality caused human evaluators to penalize character consistency scores, This is due to the generated character deviating significantly from the distribution of typical characters, leading to mismatched human expectations. 4.2 Insights and Discussions Based on test results, we briefly outline some findings: 8 In story visualization tasks, comprehensive evaluation metrics are extremely important. For instance, the simple Copy-Paste Baseline achieves optimal results across numerous metrics. However, its alignment score is notably low. Although IS can generally measure the quality and diversity of image generation, it is quite challenging to compare different models by examining the IS metric alone. When using only text as input, StoryDiffusion  and Story-Adapter  achieve excellent IS and aesthetic quality. However, relying solely on text input clearly cannot produce results that resemble the features and styles of the character reference images. The recently released UNO [ 72] has achieved a comprehensive leading position in the open- source approach. It achieves good user favorability in all three categories of ratings. It has achieved relatively leading metrics in every quantitative indicator. Commercial software has excellent comprehensive capabilities. Among them, Doubao and GPT- 4o  stand out in terms of prompt adherence ablity (alignment score). This may be attributed to their integration of LLMs with massive parameter counts. Moreover, GPT-4o [ 29] exhibits the highest accuracy in selecting the set of characters to appear. AIbrm [ 42] is highly proficient in utilizing the character reference images to incorporate the depicted character features into its generated results. In this regard, the top open-source project is UNO, but AIbrm  significantly outperforms it. Using automated metrics, it is easy to understand the improvement space of a model or find good/poor examples. For example, early work StoryGen faces issues with the diversity and quality of the generated images. The introduction of the image prior by Diffusion has elevated subsequent methods in terms of IS and aesthetic quality. AIbrm [ 42] is an application tailored for story visualization scenarios, offering more accurate character feature generation compared to general applications like GPT-4o [ 29]. However, AIbrm [ 42]’s ability to understand textual instructions still needs improvement. With automated metrics, we can easily identify some good/poor generation results, as shown in Figure 4. Our quantitative metrics demonstrate alignment with qualitative observations. For Story- Adapter [ 44], the scoring consistency between automated metrics and human evaluation is particularly evident: (1) In text-only mode (its native setting), the overall quality score (scale=5) systematically surpasses the baseline (scale=0), as theoretically expected; (2) When using image references, scale=0 achieves higher cross-similarity but lower self-similarity compared to scale=5 in both CIDS and CSD. 5 Conclusion In this paper, we introduce ViStoryBench, a comprehensive benchmark suite designed to advance the field of story visualization. By addressing the critical need for a diverse and multifaceted evaluation framework, ViStoryBench enables researchers to rigorously assess and compare various story visualization models across a wide range of dimensions. Appendix 1 Introduction 1 2 Related Work 2 2.1 Story Visualization.................................. 2 2.2 Datasets and Benchmark............................... 3 3 ViStoryBench 3 3.1 Problem Definition.................................. 3 3.2 Source Data...................................... 4 3.3 Evaluation Metrics.................................. 4 4 Diagnosis of Evaluation Result 7 4.1 Experimental Setup.................................. 7 4.2 Insights and Discussions............................... 8 9 5 Conclusion 9 A Limitation and Societal Impact 10 B Details of Source Data Collection and Statistics 11 B.1 Character Reference Image.............................. 11 C Details of Style Similarity Calculation 11 D Qualitative Results 12 E Complete Evaluation Result on the ViStoryBench-Lite Benchmark 12 F Adapting Methods to ViStoryBench 12 F.1 Copy-Paste Baseline................................. 14 F.2 Story Visualizing Method............................... 15 F.3 Video Generation Method............................... 17 F.4 Commercial Software................................. 18 F.5 MLLM........................................ 19 G Impact of Reference Image Selection on Cross-CIDS Metric 20 H Details of User Study 20 H.1 Prompts for Dataset Construction........................... 21 I Details of Prompt Adherence Evaluation 24 I.1 Character Interaction Actions............................. 25 I.2 Shooting Method................................... 25 I.3 Static Shot Description................................ 26 I.4 Individual Action................................... 27 J Details of Computing Resource 28 A Limitation and Societal Impact Some images in our dataset are sourced from popular movies, TV shows, animations, etc. Conse- quently, there is a possibility that certain metrics may be overfitted to these specific data, potentially leading to the manipulation or \"hacking\" of those metrics. Our dataset includes both Chinese and English versions. Although we choose the appropriate language for each method or software, the quality of the generated results may vary due to differences in the language of the instructions. We do not take into account the differences in generation quality caused by language differences. Our work is unable to evaluate the outcomes of comic generation/manga generation tasks that involve generating multiple panels within a single image, as the proposed methodology lacks an accurate panel segmentation approach. Our work does not include a discussion of the inference speed of each method. For the story video generation method, there are still some video-related issues such as frame consistency or quality that need attention. Our work does not specifically design tests for this aspect. We hope that story visualization models can become more powerful educational and creative tools, as well as aid in the preservation and promotion of cultural heritage. In collecting stories, we make efforts to select narratives from various cultures and regions. Despite these efforts, generative models still face challenges in overcoming stereotypes and data biases. Crucially, generative models should not be used as tools for creating false content, which requires collaboration between policymakers and technology experts. Table 3: Comparison of multi-modal story generation datasets. Datasets Caption # Images Resolution # Shots Style VIST  Manual 146k - 5 Realistic Flintstones  Manual 123k 128×128 5 Anime Pororo  Manual 74k 128×128 5 Anime StorySalon  ASR 160k 432×803 14 Anime StoryStream  Generated 258k 480×854 30 Anime OpenStory  Generated 107M 720p&1080 p 28 Realistic B Details of Source Data Collection and Statistics Story visualization datasets show significant growth and evolution trends in terms of scale, resolution, automated generation, and stylistic diversity, reflecting technological advancements and the expansion of research interests, as shown in Table 3. The primary distinction between ViStoryBench and these datasets lies in our approach: we aim to generate shot descriptions starting from a textual story, rather than extracting captions from key frames to form a narrative. When creating benchmarks, we also pay close attention to the diversity of styles and themes. Among all these stories we collect, there are 13 folktales, 10 love stories, 4 suspense crime stories, 3 horror stories, 6 historical stories, 10 fantasy stories, 7 science fiction stories, 3 war stories, 10 stories about social life, 3 adventure survival stories, and 11 fairy tales. We then adapt these segments into shot scripts using a LLM, Step-1V [ 60]. The entire dataset comprises 1317 Shots, with each story containing between 4 and 30 shots, averaging 16.5 shots per story. To evaluate a broader range of methods, all test-related texts in the dataset are provided in both English and Chinese versions. For methods that only support Chinese or significantly perform better with Chinese input, we use Chinese as input, while English is used as input for other methods. Each individual shot includes the following descriptions: Setting Description, Plot Correspondence, Onstage Characters, Static Shot Description, and Shot Perspective Design. B.1 Character Reference Image For most well-known stories, character reference images are sourced from relevant visual works. For the remaining stories, we either retrieve screenshots from films or TV shows (for 16 stories) with similar settings or have SDXL [ 54] generate animation character images (for 7 stories). The dataset contains a total of 344 characters, including 190 real humans, 135 virtual humans, and 19 non-humans. Among them, there are 210 males, 108 females, and 26 characters with no gender or non-binary gender. Each character has between 1 and up to 10 images, with 89 characters having more than one image. The entire dataset consists of 509 reference images, part of which is shown in Figure 5. We categorize all 80 stories into two types based on the image category of the main characters: realistic stories and unrealistic stories. Among them, there are 39 realistic stories and 41 unrealistic stories, and realistic casts are labeled with ethic definition followed by [ 7,8,51]. This classification is used to subsequently evaluate differences in results between different works. C Details of Style Similarity Calculation We provide a figure to illustrate the calculation process of the Style Similarity metric, as shown in Figure 6. Our style similarity metric, adapted from CSD [ 59,91], quantifies both self-similarity (within generated images) and cross-similarity (between generated and reference images) through CSD-CLIP [ 59] feature analysis. The process involves three key steps: (1) Encoding each image into visual features using a CLIP [ 55] vision encoder pre-trained on large-scale style datasets; (2) Disentangling content and style features via CSD [ 59] layers, where only the style features are retained; (3) Computing pairwise cosine similarity between style feature embeddings. 11 Figure 5: Random character reference samples from the dataset. The reference images include full-body shots, half-body shots, or portraits. Character A CharacterBReference ImagesGenerated Shots CSD-CLIP CSD-CLIPShot1embeddingShot2embedding Shot 1 Shot 2CSDScoreCross-Sim: 0.88Self-Sim: 0.90CalculatingSelf SimilarityCross Similarity Ref embedding CLIPVisionCSD-CLIP Image StyleDecoupling Style embeddingContentembedding Figure 6: Style Similarity Calculation. D Qualitative Results We provide the visualization generation results of the methods tested on story 09, as shown in figure 7. More results can be found on the website: https://huggingface.co/datasets/ ViStoryBench/ViStoryBenchResult E Complete Evaluation Result on the ViStoryBench-Lite Benchmark We present the results of several selected methods on the ViStoryBench-Lite benchmark in main paper. To facilitate a more comprehensive comparison, we provide the complete evaluation results for all the methods on the lite set, as shown in Table 4. These results are intended to offer a thorough reference for assessing the performance of different approaches. F Adapting Methods to ViStoryBench In this section, we report how we adapt each method to the ViStoryBench test. In general, we strive to implement reasonable inputs for reference character images and shot script prompts on each work as much as possible. We make efforts to standardize inputs, such as adjusting output resolution to a 16:9 aspect ratio whenever feasible. To guarantee reproducibility, we fix the random seed. Additionally, 12 Gemini GPT4o StoryDiffusion (Img - ref ver.) StoryDiffusion (Text - only ver.) UNO StoryAdapter (Img - ref scale0) StoryAdapter (Img - ref scale5) StoryGen (Auto - Regressive) TheaterGen StoryGen (Mixture) Copy - Paste Baseline13 Typemovie MOKI Doubao Morphic Studio AIbrm MMStoryAgent MovieAgent (ROICtrl ver.) MovieAgent (SD3 ver.) Vlogger AnimDirector (SD3 ver.) Figure 7: Qualitative result on story 09. From left to right are shot1 to shot5. Reference images of each shot’s on-stage characters is shown in Copy-Paste baseline results. we implement mechanisms for inputting reference images and adapting lengthy shot script prompts. These adaptations enable methods to generate continuous image results of stories. F.1 Copy-Paste Baseline The Copy-Paste Baseline aims to verify the correctness of certain metrics by constructing the simplest possible generation method, which involves directly copying and pasting characters into images. 14 Table 4: Automated test results of different methods on ViStoryBench-Lite. We use gray backgrounds to mark some results that are excluded from the sorting: SEED-Story is only trained on three animations and does not pursue generalization ability, the Copy-Paste Baseline simply pastes the character reference image as the generated result. For some methods, we test multiple inference configurations and report the results. MethodCSD (Style) CIDS (Character) Alignment OCCM Inception Aesthetics Copy-Paste Cross∗↑Self∗↑Cross∗↑Self∗↑ Score∗↑ Score∗↑ Score↑ Score↑ Degree † The following results are obtained on ViStoryBench-Lite Copy-Paste Baseline 73.6 77.3 93.2 99.6 27.0 100.0 5.5 4.40 24.5 - Story Visualizing Method StoryGen  (mixed) 31.5 60.9 36.4 68.8 35.8 83.3 6.25 3.86 2.02 – (auto-regressive) 40.7 55.8 37.6 58.8 35.3 83.6 7.15 4.09 1.86 – (multi-image-condition) 39.9 54.9 37.0 64.2 36.9 83.1 7.67 4.09 1.93 StoryDiffusion  (text-only) 31.5 68.7 30.7 57.8 59.3 81.9 12.99 5.83 -0.40 StoryDiffusion  (image-ref) 42.3 61.8 33.1 61.0 60.7 83.2 8.18 5.21 -0.42 Story-Adapter  ( ‡) 38.2 75.9 29.5 55.0 56.1 81.5 12.03 4.80 -0.15 – (text-only, scale=0) 35.9 51.5 31.4 54.2 62.1 82.7 12.72 5.12 -0.04 – (image-ref, scale=0) 52.7 61.6 34.5 59.7 60.4 84.5 11.49 4.89 0.63 – (text-only, scale=5) 36.4 75.4 29.6 59.3 56.5 82.6 10.59 4.85 -0.72 UNO  (many2many) 44.6 65.6 42.3 69.2 72.2 89.1 10.50 5.13 - TheaterGen  23.7 42.1 26.5 54.6 40.5 81.3 13.60 4.94 1.08 SEED-Story  26.4 76.2 21.9 48.6 29.1 83.1 4.93 3.82 0.14 - Video Generation Method Vlogger  (text-only) 25.7 46.2 28.7 55.4 55.8 83.4 8.44 4.30 0.78 Vlogger  (image-ref) 31.5 49.8 30.0 54.0 56.2 82.0 9.05 4.30 0.06 MovieAgent  (ROICtrl) 24.8 55.7 27.7 57.7 38.7 84.3 10.07 4.70 1.66 MovieAgent  (SD3) 36.1 54.3 35.7 60.5 76.3 86.9 12.05 5.33 -0.61 Anim-Director  (SD3) 32.1 55.5 38.4 65.5 76.7 87.7 10.00 5.61 0.86 MM-StoryAgent  28.0 66.2 32.1 56.6 50.4 82.2 8.09 5.91 0.82 - Commercial Software MOKI  22.9 70.0 29.2 62.6 38.8 82.0 10.36 5.81 0.67 Morphic Studio  59.0 63.8 50.0 66.4 67.5 82.9 9.00 4.96 - AIbrm  42.6 73.0 55.9 76.2 65.2 89.4 9.55 5.73 -0.52 ShenBi  29.2 58.2 34.7 61.1 75.8 85.6 11.60 5.07 0.66 Typemovie  34.2 65.2 39.2 54.6 62.4 84.1 11.16 5.32 -2.20 Doubao  38.6 69.8 39.4 71.4 84.2 87.5 9.88 5.62 0.78 - MLLM GPT-4o  48.7 68.5 53.2 73.1 89.3 93.4 9.02 5.5 0.97 Gemini-2.0  38.1 58.6 31.5 53.7 76.1 86.9 10.12 4.91 -0.38 ∗: These six indicators are normalized to a hundred-point scale. †: An excessively high value (marked with an underline) may indicate a degradation issue. Some methods that support multi-image input do not support this metric test and are marked as \"-\". ‡: image-ref, scale=5 For example, this baseline demonstrates that the metrics in ViStoryBench can perform an accurate calculation in areas such as CIDS, CSD, Copy-paste degree, and Matched Character Count calculation. We obtain the image for the current shot by simply stitching together the images of the on-stage characters in each shot, resulting in the image outcome for the current shot. A sample is shown in Figure 8. Figure 8: Sample results of copy-paste baseline. F.2 Story Visualizing Method F.2.1 StoryDiffusion The original StoryDiffusion [ 89] is primarily designed for image generation using multiple reference images of different characters and multi-shot prompts, where each prompt includes a character name and description. We implement the following adaptations for ViStoryBench evaluation: •Since the native implementation can only handle short texts that cannot exceed the model’s maximum sequence length limit (77 tokens), similarly to StoryGen adaption, we employ the grouped encoder sd_embed  to address this issue. 15 •Given StoryDiffusion does not support inputting reference images of multiple characters while generating one shot, we sort characters based on their appearance frequency in the full shot script, from highest to lowest, and only introduced the highest-priority characters in one shot. •StoryDiffusion predefines various style templates, each containing detailed style descriptions, including quality words. We insert the character prompt into the specified position within the style description, i.e., between the style word and the quality word, to achieve richer style expression. •During testing, we obtain two types of results: those based on image reference (img ref) and those based solely on text (text only). We report the metrics for both types of results separately. F.2.2 Story-Adapter The original Story-adapter [ 44] generates multiple images through multiple prompts and does not inherently support input image references. We implement the following adaptations for ViStoryBench evaluation: •Incorporating Reference Images: Story-adapter performs multiple rounds of iterative inference. In the first round, it generates all the storyboard images, which are then used as image references for regeneration in subsequent rounds. This multi-round process enhances both prompt alignment and style consistency of the images. We leverage this inherent image-referencing capability of Story-adapter by inputting the image of the current on-stage character into the pipeline during the first round of generation, thereby achieving image generation with reference images. •We test the results of different iteration rounds (scale 0 and scale 5) under two modes: text-only and image-Ref, and reported the results of all four methods. F.2.3 UNO UNO [ 72]’s original implementation supports various reasoning methods such as one2one, one2many, many2one, and many2many. Among these, the many2many approach involves inputting multiple images along with prompts that provide simple descriptions of the images. We exclusively evaluate the many2many method, which is capable of completing the ViStoryBench task. For each shot, we generate the corresponding image result by inputting the shot’s prompt and the images of the on-stage characters. F.2.4 StoryGen The original StoryGen [ 37] supports the integration of previously generated image-text pairs as a context to construct image sequences that align with the input shot scripts. We implement the following adaptations for ViStoryBench evaluation: •Mix Inference Method: The mix method behaves similarly to the multi-image-condition method for the first frame, while subsequent frame generation follows the auto-regressive method. •When image references are absent (e.g., no on-stage characters), the first shot uses aggregated story-wide character descriptions and images for consistent initial representation. For subsequent shots, a dynamic sliding window blends historical generation results as input, maintaining temporal coherence and mitigating quality degradation from long-range dependencies. •Grouped Encoder for Ultra Long Prompts: To handle ultra-long prompts and prevent information loss due to truncation in CLIP models, we employ a grouped encoder sd_embed [ 90] to address this issue. •Resolution Adjustment: We modify the resolution settings to approximate a 9:16 aspect ratio, specifically 512×912, to align with the generation resolutions of other methods. •Deterministic Random Seed Strategy: To enhance test controllability, we adopt a deterministic random seed strategy. F.2.5 TheaterGen The original TheaterGen [ 6] only supports text input, where an LLM is used to parse the description of each character and the overall image of the text. Subsequently, each character’s independent image is generated through the IP-Adapter, and then these images are placed in their corresponding positions 16 using detection and segmentation models. Finally, the final image is generated under the guidance of the character images. Since the method does not open-source the code for invoking the LLM part, we supplement the corresponding code to primarily obtain the bounding box coordinates of each IP image required for model input. Afterward, following TheaterGen’s setup, we place the character reference images in our dataset into the corresponding positions to generate final results. F.2.6 SEED-Story The original SEED-Story [ 78] focuses on generating long multi-modal stories and their visualization through an auto-regressive approach. SEED-Story requires the user to provide an initial image and text description, then proceeds with the story generation, using each output as the next input. Due to the story-continuation nature, it is different from other approaches (SEED-Story was only trained on the StoryStream dataset [ 78], which contains data from only three cartoon series, the model does not have generalization). Input Handling: We only adapt our data in the visualization stage, and there is no need for the previous story generation. For the first input image (000start), select the first reference image of the first character. In the pre-visualization input data, add the prompt words of this role to the beginning of the prompt list to ensure the first shot’s prompts are not compromised. F.3 Video Generation Method F.3.1 MovieAgent Similar to Vlogger, MovieAgent [ 69] also receives a story and utilizes an LLM to generate a series of fine-grained descriptions. Additionally, ROIctrl includes the bounding boxes of characters. We directly map shot prompts onto Vlogger’s fine-grained descriptions for generation. We only perform the step from prompt to image, without further generating a video, and use this image as the final result. F.3.2 Anim-Director Anim-Director [ 35] does not support input reference images. It utilizes LLM to supplement character and scene descriptions based on simple prompts provided by users, refining them into complete story sequences by scenes. Visual images are generated through the Stable Diffusion 3 [ 13] model, filtered by VLM, and subsequently used to generate videos. We adopt the following strategies to complete the test on ViStoryBench: 1.We directly input the prompt of each shot from ViStoryBench as the story sequence prompt to generate images. After filtering by VLM, we obtain the results without proceeding with the subsequent video generation steps. 2.To accommodate ultra-long prompts, we employ grouped encoder sd_embed [ 90] to address this issue. 3.We modify the original resolution of 1024×1024 to a resolution close to 16:9, specifically 768×1344. 4. We fix the random seed to ensure reproducibility. F.3.3 MM-StoryAgent MM-StoryAgent [ 76] does not support the input of reference images. We only utilize the Image Agent mentioned in the code to generate images from prompts, without further generating a video. As MM-StoryAgent is based on StoryDiffusion, we also employ grouped encoder sd_embed [ 90] to adapt to long prompts. F.3.4 Vlogger The original Vlogger [ 92] takes a short story and utilizes an LLM to generate a series of fine- grained descriptions. These descriptions encompass character and object descriptions, video script descriptions (in both Chinese and English), characters and objects present, duration settings, etc. 17 We directly map shot prompts onto Vlogger’s fine-grained descriptions, selecting the first frame of each shot from the generated video as the result. Similar to StoryDiffusion, vlogger does not support inputting reference images of multiple characters while generating one shot. We adopt a similar solution to that of StoryDiffusion. F.4 Commercial Software Given the absence of API or similar call methods for the following commercial softwares and their intricate interaction processes, we employ full-time annotators within the company to generate image results for all the commercial software mentioned below, receiving a wage of 4.33 U.S. dollars per hour. The local minimum wage being 1.93 U.S. dollars per hour. All the following methods were tested between May 1 and May 7, 2025. F.4.1 MOKI When generating shots on MOKI [ 47], it is necessary to select one of the provided painting style options. To best replicate the effects of real human usage, we instruct the annotators to choose the option that most closely aligns with the style of the character reference images for each script. Given that MOKI restricts the maximum number of reference characters in a story to three, we sort the characters based on their appearance frequency among all shots. The three characters with the highest frequency were then added as reference characters to maximize the performance of the model. We generate images of MOKI using Chinese version dataset. MOKI has a limit on the length of each shot’s prompt, capped at 60 Chinese characters. Consequently, we make certain omissions in the prompt for each shot. For instance, we only used the Static Shot Description and Plot Correspondence sections as input. If the character count still exceeded the limit, we employ an LLM to abbreviate the text while preserving key information. For each shot, the platform generated four images at a time. We select the first image as the final result. F.4.2 Morphic Studio Morphic Studio [ 49] restricts each shot to include only one reference character. Consequently, we rank the frequency of character appearances in the script and use this order as a priority to select the current on-stage reference character for each shot. Morphic Studio allows uploading 2 to 10 images for the same reference character. For characters with only one reference image, we upload an additional identical image to meet the minimum requirement of two images. For characters with multiple reference images, we upload all available reference images. Therefore, we do not provide the Copy-Paste Degree for Morphic Studio because all reference images were uploaded and used for generation, making it incalculable. For each shot, the platform generates four images at a time. We select the first image as the final result. F.4.3 AIbrm AIbrm [ 42] restricts each shot to a maximum of two reference characters. We employ the same sorting methodology as utilized in Morphic Studio. The character creation process in AIbrm involves uploading a real human image, selecting a style from the provided options, and inputting a character prompt to generate the character. For the real human category in our dataset, we upload images and chose the \"realistic\" style. For virtual human and non-human categories, since image uploads were not feasible, we select the closest available style. Subsequently, we input the character prompts from our dataset across all styles to complete the character creation. F.4.4 ShenBi Firstly, when creating a project, ShenBi [ 46] requires selecting a generation style from a list. We choose the style that is closest to the reference images in the dataset. 18 When creating characters, we upload the character images along with their corresponding prompts to generate new character images, which are subsequently utilized within the method to produce shot images. ShenBi restricts each shot to a maximum of three reference characters. We employ the same sorting methodology as utilized in Morphic Studio. The output of ShenBi is in the form of videos. We extract the first frame of each scene video as the final result. F.4.5 Typemovie Firstly, when creating a project, Typemovie [ 63] requires selecting a generation style from a list. We choose the style that is closest to the reference images in the dataset. The character creation process in Typemovie involves uploading a real human image, selecting a style from the provided options, and inputting a character prompt to generate the character. For the real human category in our dataset, we simply upload reference images. For virtual human and non-human categories, since image uploads were not feasible, we select the closest available style. Subsequently, we input the character prompts from our dataset across all styles to complete the character creation. Typemovie restricts each shot to include only one reference character. We employ the same sorting methodology as utilized in Morphic Studio. F.4.6 Doubao We conduct our tests using the grayscale test version of the \"Image Generation\" model on the Doubao homepage, dated April 27, 2025. Since this image generation model only supports uploading a single image, we employ a sorting method similar to that used in Morphic Studio to prioritize characters and selected the highest-priority character to upload as a single reference image. The prompt used during generation was (translated to English): \"This is an image of the protagonist <character_name>. Next, please generate storyboard scenes based on the protagonist’s image and the script I provide. The script for the first scene is as follows: <shot_prompt>.\" We perform multiple rounds of generation in one session to obtain the desired consistent image results for one story. F.5 MLLM F.5.1 GPT-4o and Gemini-2.0 GPT-4o [ 29], developed by OpenAI, is an advanced multi-modal model demonstrating strong capa- bilities in understanding and generating content across text and image modalities. Its architecture is inherently suited for tasks requiring nuanced interpretation of combined textual and visual inputs, and for producing contextually relevant visual outputs. Google’s Gemini [ 10] is a powerful multi-modal system designed for sophisticated reasoning and generation across various data types, including text and images. It supports image generation conditioned on both textual prompts and visual references. To integrate GPT-4o and Gemini into the ViStoryBench evaluation framework, we adopt the following key adaptation strategies: •Atomic Shot Processing: Each “shot” defined within ViStoryBench was treated as an inde- pendent generation request to the model, ensuring focused processing for individual narrative segments. •Comprehensive Prompt Engineering: For every shot, a structured textual prompt was metic- ulously crafted. This prompt amalgamated all critical textual information provided by ViSto- ryBench, including plot details, scene descriptions, character portrayals, camera perspective guidelines, and the desired aspect ratio for the output image. •Direct Visual Referencing: Character reference images, after undergoing a standardization pre-processing pipeline (e.g., resizing, color space conversion), were directly incorporated as 19 visual inputs for each shot’s generation request. This aimed to guide the model in rendering characters consistent with their specified appearances. •Conversational Context Continuation: To foster narrative coherence across sequential shots, the model’s inherent capability to process conversational history was leveraged. The most recent interaction cycles, encompassing the prompt for the preceding shot and the model’s response (which includes the generated image), served as contextual information for the subsequent shot’s generation task. G Impact of Reference Image Selection on Cross-CIDS Metric In certain methods, the reference images/features of characters used for image generation are not from the ones provided in our dataset but are instead additionally generated images. For instance, one scenario is that the method utilizes the real-person reference images from our dataset to regenerates an anime character, which is not very similar to the original person. When calculating metrics, the selection of character reference images directly impacts the results of the Cross-CIDS metric. In other tables, we report the calculation results using the character reference images within the dataset. To provide more insight, we also offer the Cross-CIDS metric results of these methods on newly generated character reference images for comparative reference, as shown in Table 5. Table 5: Cross-CIDS metric with different reference image. \"Within dataset\" refers to results calculated with reference images in ViStoryBench dataset, \"Newly generated\" refers to results calculated with newly generated reference images of methods. All results below are obtained on ViStoryBench-Lite. Method Within dataset Newly generated MOKI  0.292 0.338 AIbrm  0.559 0.683 ShenBi  0.347 0.389 H Details of User Study To assess the consistency and aesthetic quality of the generated images, we conduct a user study involving participants who evaluated the results across three dimensions. We employ three annotators who scored all the generated stories, and the final result was determined by averaging their scores, as shown in Table 6. The likert scale questionnaires utilized during the user study are as follows: Character Identification Consistency: Based on the provided story visualization results, please assess the character id consistency of characters throughout the story and provide a score. Scoring Criteria: •0: There is a lack of fundamental ID consistency, with nearly every image featuring different characters, indicating an almost complete absence of images with matching characters. •1: In a smaller subset of images (about 10-30%), the main characters demonstrate mutual consis- tency. •2: Within a moderate number of images (around 30-60%), the main characters can be recognized as having mutual consistency. •3: In a substantial subset of images (approximately 60-80%), the main characters exhibit mu- tual consistency. However, a minor portion of images still shows inconsistencies in character representation. • 4: The main characters are consistently identifiable across the vast majority of images. Environment Consistency: Based on the provided story visualization results, please assess the environment consistency throughout the story and provide a score. Scoring Criteria: •0: There is a lack of fundamental environmental consistency; under the same environmental description, the generated scenes exhibit neither consistent style nor content. •1: At a glance, the scenes appear to have some level of consistency, such as similar styles. However, upon closer inspection, the content is entirely different and lacks any coherence. •2: There is a certain level of consistency in the style and semantic information of the image scenes, such as the presence of similarly styled beds, windows, and desk lamps. However, inconsistencies 20 Table 6: Results of user study.‡: image-ref, scale=5. MethodCharacter Identification Environment Subjective Consistency ↑ Consistency ↑Aesthetics ↑ - Story Visualizing Method StoryGen  (mixed) 0.37 0.22 0.10 – (auto-regressive) 0.10 0.12 0.05 – (multi-image-condition) 0.18 0.27 0.13 StoryDiffusion  (text-only) 2.72 2.73 2.45 StoryDiffusion  (image-ref) 2.62 2.33 2.30 Story-Adapter  ( ‡) 2.90 2.98 2.68 – (text-only, scale=0) 2.33 2.23 2.50 – (image-ref, scale=0) 2.55 2.62 2.80 – (text-only, scale=5) 3.10 2.67 2.68 UNO  (many2many) 3.20 3.10 3.02 TheaterGen  0.35 0.55 0.30 SEED-Story  2.05 2.11 1.05 - Video Generation Method Vlogger  (text-only) 0.87 1.07 0.67 Vlogger  (image-ref) 1.30 1.33 1.08 MovieAgent  (ROICtrl) 1.90 1.95 1.55 MovieAgent  (SD3) 2.45 2.47 1.83 Anim-Director  (SD3) 2.52 2.28 1.77 MM-StoryAgent  2.27 2.78 2.55 - Commercial Software MOKI  1.73 2.20 2.55 Morphic Studio  2.60 2.53 2.39 AIbrm  3.42 2.97 3.15 ShenBi  2.74 2.89 2.48 Typemovie  2.25 2.35 2.00 Doubao  3.63 3.02 3.25 - Multi-modal Large Language Model GPT-4o  3.08 3.06 3.28 Gemini-2.0  2.84 2.84 2.26 exist in either the style or specific content, for instance, while tables and desk lamps are present in both, the desk lamps themselves are not similar. •3: The majority of image scenes have consistent semantic information, with their style and specific content being largely uniform. •4: Nearly all image scenes exhibit strong consistency in both style and specific content, akin to the effect of video recording within the same scene over a continuous timeframe. Subjective Aesthetics: Based on the provided story visualization results, please assess the aesthetics of the story and provide a score. Scoring Criteria: •0: Most characters have very obvious generation problems, such as distorted faces, extra/missing limbs, or the painting style is very uncomfortable for humans to watch. Or the image quality is extremely poor. •1: Characters have obvious generation problems, such as extra/missing limbs, distortion, etc., but there is no discomforting content. Or the image quality is poor. •2: Over 80% of the characters have no obvious physical problems, and there is no obvious content that causes physical discomfort, but the visual experience is poor. Almost all the content of the images, such as character poses, is completely the same, lacking variation. •3: Over 80% of the characters have no obvious physical problems. Mediocre picture books with ordinary visual experience, lacking variation and storytelling in images. •4: Over 80% of the characters have no obvious physical problems. Excellent and beautiful picture books that can be commercialized, with rich content, beautiful details, diversity, and interest, and obvious storytelling. H.1 Prompts for Dataset Construction We employ an LLM to transform narratives into corresponding shots. Below, we present the specific system prompt utilized for this purpose. 21 You are a seasoned film script artist skilled at transforming descriptive text from novel scripts into visual content descriptions. You also adapt scripts into static shot scripts. Your designs must incorporate a wide variety of compositions to perfectly capture the script’s content through imagery, ensuring the storyline is effectively conveyed in the visual descriptions. In addition, you also need to provide a comprehensive introduction to the characters that appear in the shot scripts, mainly describing their appearance and clothing. Task Description You are required to write shot scripts based on the user’s input story, totaling <num_of_shots> shots. Each shot can feature 0 to 3 characters, meaning it can be a scene shot, single-character shot, two- character shot, or three-character shot. For each shot in the shot script, you need to output <Plot Correspondence>, <Setting Description>, <Shot Perspective Design>, <On-stage characters>, <Static Shot Description>. The <Plot Correspondence>section requires dividing the original plot into <num_of_shots> scenes, presenting the plot of each scene in the form of narration and dialogue. Note that when dividing the input plot into different scenes, the rationality of the plot needs to be considered. Concept Explanation of Various Fields in Shot Scripts •Setting Description: The story will be divided into <num_of_shots> scenes. The setting refers to the environmental setup of each scene. It should not include any characters. You need to describe all elements in the environment in detail in this field, so that the scene where the story takes place can be vividly recreated. Standard writing format: time, location, atmosphere description, other elements in the environment, lighting effects. •Shot Perspective Design: Shot Perspective Design refers to information from several dimensions: shot distance, camera angle, and camera type. •On-stage characters: Please select the characters appearing in this scene from the character list. The number of characters should be controlled between 0-3. If no characters appear, leave it blank. •Static Shot Description: This part describes the static actions or positions of characters and items in the scene, ensuring that it describes a fixed state. Writing format: <character position>, <character expression>, <character action>, <position of elements in the scene>. Requirements for Creating Setting Description in Shot Scripts •You need to design a shot script for the user’s input story. Break the story into <num_of_shots> main scenes and write scene descriptions for each of these <num_of_shots> scenes. •Note that character descriptions should not appear in Setting Descriptions. Only describe the scene itself, ensuring that the scene is consistent with the original story. Do not include backgrounds, items, or other elements that are not present in the story. •Think from the perspective of the visuals, using the visuals to drive the content of the shots. Ensure that all plot elements can be directly depicted through the visuals. Avoid thinking from the perspective of a screenwriter’s script and refrain from using abstract or metaphorical expressions. • Pay attention to the consistency between the characters’ locations and the Setting Descriptions. •When writing the background content, do not directly use the expressions from the origin story. Use clear and concise sentences to describe in detail all the elements included in the background visuals and their relationships. •If there are characters in the visuals, clearly express their facial expressions, demeanor, and actions. • Pay attention to the visual narrative continuity between adjacent shot panels. Requirements for Creating Shot Perspective Design in Shot Scripts •Continuity in Shot Composition: Adjacent shots should maintain coherence in shot composition and camera angles. By employing a diverse yet consistent combination of shot compositions and camera angles, create a viewing experience that is both spatially immersive and visually engaging. •Shot Distance Selection: Choose the most appropriate shot distance from \"wide shot, full shot, medium long shot, medium shot, medium close up, close up\" based on the emotional atmosphere of the current scene. A smaller subject size results in a more relaxed emotional tone, while a larger subject size creates a tenser atmosphere. Consider the shot distance design of preceding and following shots as well. • Guidelines for Shot Composition Combinations: –Smooth Narrative Transitions: The way shot compositions are connected impacts narrative fluidity. Effective transitions involve gradual tightening or loosening. Moving from wider to tighter shots is called \"tightening,\" while moving from tighter to wider shots is called \"loosening.\" Avoid abrupt shifts from Wide Shot to extreme close-ups or vice versa. –Avoid Repetitive Compositions: Ensure that adjacent shots have different compositions to prevent visual monotony. 22 –Emotional Resonance: Since shot composition affects emotional tone, match shot compo- sitions with the emotional intensity of the plot. For instance, intense emotional scenes are better suited for tighter shots. –Rhythmic Pacing: The combination of shot compositions influences the visual rhythm of the scene. Use an appropriate mix of shot compositions within each episode to convey the narrative’s pace effectively. •Camera Angle Selection: Opt for the camera angle—\"front view, side view, back view\"—that best suits the current scene’s visual requirements. •Camera Type Selection: Choose the camera type—\"Eye level shot, low-angle shot, high-angle shot, bird’s eye view shot, dutch angle shot, foreshortening, inverted shot\"—that aligns with the scene’s content and emotional tone. Consider the camera types used in preceding and following shots for continuity. •Camera Type Combinations: Select camera types that complement the scene’s content and emo- tional context. Pay attention to how different camera types interact to enhance the visual story- telling. •Please refer to the provided materials to choose the most fitting camera type for the current scene’s content and emotional tone, ensuring that the combination of camera types supports the overall narrative effectively. Reference Materials for Camera Design For Shot Distance selection: •Wide Shot: Displays the relationship between characters and their environment, commonly used to showcase scenes and background settings. •Full shot: Shows the entire body of a character, often used to present full actions or the overall view of a scene. • Medium long shot: Captures from above the character’s knees. • Medium shot: Captures from above the character’s waist. • Medium close up: Captures from above the character’s chest. •Close up: Focuses on a close-up of the character’s head or face, with the background and environ- ment typically blurred or entirely out of view. For determining the relationship between Camera Type and content: • Eye level shot: The camera is positioned at the same level as the eyeline. •Low-angle shot: The camera shoots upward from below the eyeline, enhancing the subject’s authority or size, often conveying power or intimidation. Suitable for emphasizing an individual’s dominance or creating visual pressure, such as highlighting a hero or villain. •High-angle shot: The camera looks down from above the eyeline, showing the breadth of a scene or diminishing the visual importance of the subject. Effectively reduces the visual scale of characters or objects, used to depict a sense of isolation or helplessness in characters, or to present vast landscapes. •Bird’s eye view shot: The camera shoots downward from a high altitude, providing a top-down perspective, usually covering extensive geographical areas. Highly effective when a global view of events or environments is needed. •Dutch angle shot: The camera is deliberately tilted during filming, often used to create a sense of imbalance or tension. Particularly effective in portraying scenes of chaos, tension, or psychological instability. •Foreshortening: Emphasizes depth of field through perspective techniques, making the relationship between foreground and background more prominent. Suitable for highlighting spatial relationships and depth, commonly used to enhance visual guidance and a sense of depth. •Inverted shot: The image is filmed upside down, challenging the audience’s visual habits, often used to represent confusion or an unstable mental state. Notes •Each Static Shot Description in the shot scripts should correspond sequentially to each segment of the story, providing detailed descriptions of characters’ expressions, actions, and states. •Do not include any characters in the Setting Description. Ignore the characters in the story and only describe the environmental setting. •Do not introduce items or backgrounds in the Static Shot Description that are not mentioned in the story. Ensure that the location of actions aligns with the story. • Each sentence in the plot has context. Use this context to determine the best shot design. •Ensure that the transitions between different shots in the shot scripts follow creative requirements. •Approach the creation of shot content from a visual perspective. Consider the best way to present the script visually. 23 •Only provide content that meets the output format requirements; do not include any explanations. • When dividing the original plot content, rewrite it into a format suitable for presentation. • Strictly follow the format and requirements of the output example when writing. A Sample output { \"Shot 1\": { \"Plot Correspondence\": \"xxx\", \"Setting Description\": \"Twilight, stone street leading to the bell tower, bell tower with arches, town streets, distant bell tower with arches, romantic atmosphere, mysterious atmosphere, glowing arrow on the ground, fallen leaves, pigeons perched on rooftops, soft golden light\",,→,→,→,→ \"Shot Perspective Design\": \"Medium shot, eye level shot\", \"On-stage characters\": [\"Fern\"], \"Static Shot Description\": \"Fern is pressed against the bell tower pillar, with an expectant and serious expression. Her right index and middle fingers are together, suspended in mid-air, and fine golden particles are pouring out from her fingertips.\",→,→,→ },... \"Characters\": { \"Fern\": \"A beautiful girl with long purple hair and purple eyes, wearing a silver butterfly hair accessory, a black coat and black boots, and a white dress under the coat. She holds a wooden staff in her hand.\",,→,→ \"Frieren\": \"A young white-haired female elf with twin ponytails, blue-green eyes, pointed elf ears, a pair of red earrings, a white wizard robe with gold trim and brown boots, holding a staff with a round ruby on the top.\",,→,→,→ \"Himmel\": \"A young boy with short blue hair and blue eyes, wearing a blue knight uniform and a white cape, holding a long sword in his hand, with a gentle yet firm expression.\",→,→ } } I Details of Prompt Adherence Evaluation Table 7: Detailed alignment scores. SEED-Story is only trained on three animations and does not pursue generalization ability. ‡: image-ref, scale=5. MethodScene Camera Global character Single character score↑score↑ action score ↑ action score ↑ Copy-Paste Baseline 0.49 2.06 0.65 0.99 - Story Visualizing Method StoryGen  (mixed) 0.90 2.12 1.24 1.48 – (auto-regressive) 1.04 2.13 1.24 1.37 – (multi-image-condition) 1.12 2.12 1.30 1.39 StoryDiffusion  (text-only) 3.11 2.94 1.83 1.67 StoryDiffusion  (image-ref) 1.88 3.27 2.41 2.23 Story-Adapter  ( ‡) 1.84 3.17 2.36 2.05 – (text-only, scale=0) 2.05 3.30 2.52 2.17 – (image-ref, scale=0) 1.95 3.26 2.49 2.25 – (text-only, scale=5) 1.83 3.13 2.45 1.94 UNO  (many2many) 3.47 3.06 2.62 2.12 TheaterGen  2.67 1.65 0.87 0.88 SEED-Story  1.93 1.64 0.59 0.56 - Video Generation Method Vlogger  (text-only) 1.58 2.85 2.19 1.98 Vlogger  (image-ref) 1.60 2.95 2.20 2.07 MovieAgent  (ROICtrl) 1.21 2.31 1.22 1.11 MovieAgent  (SD3) 3.46 2.98 3.23 2.50 Anim-Director  (SD3) 3.61 2.89 3.24 2.44 MM-StoryAgent  2.83 2.46 1.69 1.36 24 In the prompt adherence evaluation, we utilize GPT-4.1 [ 50] to assess the consistency between the generated images and the specific content of each shot. This is achieved by prompting the LLM to provide a Likert scale rating based on the given image and prompt, resulting in a score ranging from 0 to 4. After averaging the numerical values of each subtask, we obtain the Alignment Score in Table 4. The detailed scores for each subtask are shown in Table 7. The detailed system prompts for each subtask are as follows: I.1 Character Interaction Actions Task Definition You will be provided with an image and a text prompt describing the main character’s action. As an experienced evaluator, your task is to evaluate the semantic consistency between the image and the text prompt, according to the scoring criteria. This evaluation focuses specifically on whether the action of the main character in the image aligns with the action described in the text. Scoring Criteria When evaluating the semantic consistency between an image and its corresponding text prompt, the following aspects are crucial: •Relevance: Does the image show the main character performing the action or behavior mentioned in the text? The action in the image should match the core description provided in the text. •Accuracy: Does the image depict the action correctly according to the text prompt? Any specific details related to the action, such as gestures, posture, or environment, should align with the description. •Completeness: Does the image show the main character completing the entire action as described in the text? The image should not omit important parts of the action or behavior. Scoring Range Based on these criteria, you will assign a score from 0 to 4 that reflects the degree of semantic consistency between the image and the text prompt: •Very Poor (0): No correlation. The image does not reflect any aspect of the action described in the text prompt. •Poor (1): Weak correlation. The image addresses the text in a very general way but misses most details and accuracy of the action. •Fair (2): Moderate correlation. The image depicts the action to some extent, but there are several inaccuracies or missing details. •Good (3): Strong correlation. The image accurately portrays most elements of the action with minor inaccuracies or omissions. •Excellent (4): Near-perfect correlation. The image closely aligns with the text prompt and portrays the main character’s action with high accuracy and precision. Input format Every time you will receive a text prompt and an image. Please carefully review the image and text prompt. Before giving a score, please provide a brief analysis of the above evaluation criteria, which should be very concise and accurate. Output Format Analysis: <Your analysis> Score: <Your Score> I.2 Shooting Method Task Definition You will be provided with an image and a text prompt describing the shot type of the image. As an experienced evaluator, your task is to assess whether the generated image meets the specified shot requirements based on the evaluation criteria. Additional Material 25 Instruction: You are a professor evaluator. Below is information about different shot types and shot distances. Please evaluate whether the generated image meets the requested shot type. Shot Distance Descriptions •Long Shot: Shows the relationship between characters and their environment, typically used to display the scene or environment. •Full Shot: Shows the full body of a character, commonly used to display movement or the full scene. •Medium Long Shot: Starts from above the character’s knees, capturing part of the environment. •Medium Shot: Captures the character from the waist up. •Close-Up: Captures the character from the chest up. •Extreme Close-Up: Focuses on the character’s head or face, with the background and environment typically blurred or not visible. Angle Descriptions •Eye Level Shot: The camera is positioned at the subject’s eye level. •Low Angle Shot: The camera is positioned below eye level, shooting upward, emphasizing the character’s power or size. •High Angle Shot: The camera is positioned above eye level, shooting downward, often minimizing the subject’s significance. •Bird’s Eye View: Camera shot taken from directly above, providing an overview of the scene. •Tilted Shot: The camera is intentionally tilted to create a sense of imbalance or tension. •Perspective Compression: A technique that emphasizes depth and the relationship between foreground and background through perspective. Scoring Range A score between 0 and 4 will be assigned based on how well the shot type aligns with the content described in the prompt: •Very Poor (0): The image does not meet any shot or angle requirements. •Poor (1): The image meets some but not most of the shot or angle requirements. •Fair (2): The image partially meets the shot or angle requirements, but some elements are off. •Good (3): The image meets most of the shot or angle requirements. •Excellent (4): The image fully meets all of the shot and angle requirements. Input Format You will receive a text prompt and an image. Please carefully review the image and text prompt. Provide an analysis followed by a score. Output Format Analysis: <Your analysis >Score: <Your score> I.3 Static Shot Description Task Definition You will be provided with an image and a text prompt that describes the background, objects, and mood of the scene (excluding characters). Your task is to evaluate the consistency between the background and objects described in the prompt and what is visually represented in the image. Evaluation Criteria When assessing the semantic consistency between the image and the text prompt, focus on how well the background and non-character elements in the image match the description provided in the text. The evaluation should be based on the following aspects: •Relevance: The image should clearly relate to the primary background elements and objects described in the text. It should reflect the main setting and environment described, without introducing irrelevant or unrelated features. •Accuracy: Check if the specific details mentioned in the text are correctly represented in the image. This includes any mentioned objects, scenery, environmental conditions (e.g., weather, lighting), and relevant background elements. 26 •Completeness: Evaluate whether the image accurately includes all critical background elements described in the text. The image should reflect the key details and setting, not leaving out essential aspects of the described background or scene. •Context: The image should maintain the context of the description. If the text describes a specific environment or atmosphere, the image must capture that context appropriately, considering the described mood and setting elements. Scoring Criteria Based on these factors, the image will be assigned a score from 0 to 4, indicating the degree of consistency between the image and the description in the text: •Very Poor (0): No correlation. The image completely fails to reflect the background or objects described in the text. •Poor (1): Weak correlation. The image touches on the background or objects in a very general sense but misses most of the important details or has significant inaccuracies. •Fair (2): Moderate correlation. The image contains some relevant background and objects, but several important details are missing or inaccurately represented. •Good (3): Strong correlation. The image accurately represents most of the described background and objects with minor omissions or inaccuracies. •Excellent (4): Near-perfect correlation. The image perfectly captures the background and objects as described in the text, leaving no significant details missing or inaccurate. Input Format You will receive a text prompt and an image. Please carefully review the image and text prompt. Provide an analysis followed by a score. Output Format Analysis: <Your analysis> Score: <Your Score> I.4 Individual Action We first crop the person from the image using a bounding box, which is then utilized for metric calculation: Task Definition For each evaluation, you will receive a text prompt, an image, and a character name. Your task is to first extract the individual action or behavior of the specified character from the text prompt, then determine whether the image accurately reflects this description for that character, and finally assign a score based on the criteria. Evaluation Process •Extract Action Information: Carefully extract the specific action or behavior described for the given character (character name) from the text prompt. •Image Comparison: Examine the image to determine whether the specified character’s action matches the extracted description. •Analyze and Score: Analyze the match according to the scoring criteria and assign a score. Scoring Criteria Focus on the following aspects when evaluating: •Relevance: Does the image show the specified character performing the action or behavior described in the text? •Accuracy: Are the details of the character’s action in the image (such as posture, gestures, environment) consistent with the text description? •Completeness: Does the image fully depict the character completing the entire action as described, without omitting important parts? Assign a score from 0 to 4 based on the degree of semantic consistency: •0 (Very Poor): No correlation. The image does not reflect any aspect of the described action. •1 (Poor): Weak correlation. The image only generally addresses the text, missing most details and accuracy. •2 (Fair): Moderate correlation. The image depicts the action to some extent but with several inaccuracies or missing details. 27 •3 (Good): Strong correlation. The image accurately portrays most elements of the action, with only minor inaccuracies or omissions. •4 (Excellent): Near-perfect correlation. The image closely aligns with the text prompt and depicts the character’s action with high accuracy and completeness. Output Format Analysis: <Your analysis>Score: <Your Score> J Details of Computing Resource To ensure the reproducibility of computational experiments, we provide detailed specifications of the hardware resources here. For each method, we document the type of GPU accelerators (e.g., NVIDIA H800 80GB) and the computational efficiency of each metric. Specifically, we report the average runtime per evaluation metric in Table 8. Table 8: Computational efficiency of evaluation metrics. Metric ScopeTimeNotes Value Unit Aesthetics Score Single image 26 ms per generated image Style Similarity Pair images 46 ms cross or self Character Similarity Pair images 450 ms cross or self Inception Score Total data 8.057 s full dataset Prompt Alignment*Single image 25.173 s per generated image * Longest computation due to LLM inference constraints 28 References Emanuele Bugliarello, H Hernan Moraldo, Ruben Villegas, Mohammad Babaeizadeh, Mohammad Taghi Saffar, Han Zhang, Dumitru Erhan, Vittorio Ferrari, Pieter-Jan Kindermans, and Paul V oigtlaender. Storybench: A multifaceted benchmark for continuous story visualization. Advances inNeural Information Processing Systems, 36:78095–78125, 2023. ByteDance Inc. Doubao ai assistant. https://www.doubao.com/, 2024. Accessed: 2025-04-16. Hong Chen, Rujun Han, Te-Lin Wu, Hideki Nakayama, and Nanyun Peng. Character-centric story visualization via visual planning and token alignment. arXiv preprint arXiv:2210.08465, 2022. Siyu Chen, Dengjie Li, Zenghao Bao, Yao Zhou, Lingfeng Tan, Yujie Zhong, and Zheng Zhao. Manga generation via layout-controllable diffusion. arXiv preprint arXiv:2412.19303, 2024. Junhao Cheng, Xi Lu, Hanhui Li, Khun Loun Zai, Baiqiao Yin, Yuhao Cheng, Yiqiang Yan, and Xiaodan Liang. Autostudio: Crafting consistent subjects in multi-turn interactive image generation. arXiv preprint arXiv:2406.01388, 2024. Junhao Cheng, Baiqiao Yin, Kaixin Cai, Minbin Huang, Hanhui Li, Yuxin He, Xi Lu, Yue Li, Yifei Li, Yuhao Cheng, et al. Theatergen: Character management with llm for consistent multi-turn image generation. arXiv preprint arXiv:2404.18919, 2024. Wei Cheng, Ruixiang Chen, Siming Fan, Wanqi Yin, Keyu Chen, Zhongang Cai, Jingbo Wang, Yang Gao, Zhengming Yu, Zhengyu Lin, et al. Dna-rendering: A diverse neural actor repository for high-fidelity human-centric rendering. In Proceedings oftheIEEE/CVF International Conference onComputer Vision, pages 19982–19993, 2023. Wei Cheng, Su Xu, Jingtan Piao, Chen Qian, Wayne Wu, Kwan-Yee Lin, and Hongsheng Li. General- izable neural performer: Learning robust radiance fields for human novel view synthesis. arXiv preprint arXiv:2204.11798, 2022. Google DeepMind. Gemini 2.0 flash: Native image generation in google ai studio. https://developers. googleblog.com/en/experiment-with-gemini-20-flash-native-image-generation/, 2025. Accessed: 2025-04-16. Google DeepMind. Google gemini2. experiment with gemini 2.0 flash native image generation, 2025. Jiankang Deng, Jia Guo, Niannan Xue, and Stefanos Zafeiriou. Arcface: Additive angular margin loss for deep face recognition. In Proceedings oftheIEEE/CVF conference oncomputer vision andpattern recognition, pages 4690–4699, 2019. discus0434. Aesthetic predictor v2.5. https://github.com/discus0434/ aesthetic-predictor-v2-5, 2024. Accessed: 2025-05-10. Patrick Esser, Sumith Kulal, Andreas Blattmann, Rahim Entezari, Jonas Müller, Harry Saini, Yam Levi, Dominik Lorenz, Axel Sauer, Frederic Boesel, et al. Scaling rectified flow transformers for high-resolution image synthesis. In Forty-first international conference onmachine learning, 2024. Zhangyin Feng, Yuchen Ren, Xinmiao Yu, Xiaocheng Feng, Duyu Tang, Shuming Shi, and Bing Qin. Improved visual story generation with adaptive context modeling. arXiv preprint arXiv:2305.16811, 2023. Stephanie Fu, Netanel Tamir, Shobhita Sundaram, Lucy Chai, Richard Zhang, Tali Dekel, and Phillip Isola. Dreamsim: Learning new dimensions of human visual similarity using synthetic data. arXiv preprint arXiv:2306.09344, 2023. Silin Gao, Sheryl Mathew, Li Mi, Sepideh Mamooler, Mengjie Zhao, Hiromi Wakaki, Yuki Mitsufuji, Syrielle Montariol, and Antoine Bosselut. Vinabench: Benchmark for faithful and consistent visual narratives. arXiv preprint arXiv:2503.20871, 2025. Ridouane Ghermi, Xi Wang, Vicky Kalogeiton, and Ivan Laptev. Short film dataset (sfd): A benchmark for story-level video understanding. arXiv preprint arXiv:2406.10221, 2024. Lixue Gong, Xiaoxia Hou, Fanshi Li, Liang Li, Xiaochen Lian, Fei Liu, Liyang Liu, Wei Liu, Wei Lu, Yichun Shi, et al. Seedream 2.0: A native chinese-english bilingual image generation foundation model. arXiv preprint arXiv:2503.07703, 2025. Yuwei Guo, Ceyuan Yang, Ziyan Yang, Zhibei Ma, Zhijie Lin, Zhenheng Yang, Dahua Lin, and Lu Jiang. Long context tuning for video generation. arXiv preprint arXiv:2503.10589, 2025. Tanmay Gupta, Dustin Schwenk, Ali Farhadi, Derek Hoiem, and Aniruddha Kembhavi. Imagine this! scripts to compositions to videos. In Proceedings oftheEuropean conference oncomputer vision (ECCV), pages 598–613, 2018. Sebastian Hartwig, Dominik Engel, Leon Sick, Hannah Kniesel, Tristan Payer, Poonam Poonam, Michael Glöckler, Alex Bäuerle, and Timo Ropinski. A survey on quality metrics for text-to-image generation. arXiv preprint arXiv:2403.11821, 2024. 29  Huiguo He, Huan Yang, Zixi Tuo, Yuan Zhou, Qiuyue Wang, Yuhang Zhang, Zeyu Liu, Wenhao Huang, Hongyang Chao, and Jian Yin. Dreamstory: Open-domain story visualization by llm-guided multi-subject consistent diffusion. arXiv preprint arXiv:2407.12899, 2024. Jack Hessel, Ari Holtzman, Maxwell Forbes, Ronan Le Bras, and Yejin Choi. Clipscore: A reference-free evaluation metric for image captioning. arXiv preprint arXiv:2104.08718, 2021. Martin Heusel, Hubert Ramsauer, Thomas Unterthiner, Bernhard Nessler, and Sepp Hochreiter. Gans trained by a two time-scale update rule converge to a local nash equilibrium. Advances inneural information processing systems, 30, 2017. Panwen Hu, Jin Jiang, Jianqi Chen, Mingfei Han, Shengcai Liao, Xiaojun Chang, and Xiaodan Liang. Storyagent: Customized storytelling video generation via multi-agent collaboration. arXiv preprint arXiv:2411.04925, 2024. Haoyang Huang, Guoqing Ma, Nan Duan, Xing Chen, Changyi Wan, Ranchen Ming, Tianyu Wang, Bo Wang, Zhiying Lu, Aojie Li, et al. Step-video-ti2v technical report: A state-of-the-art text-driven image-to-video generation model. arXiv preprint arXiv:2503.11251, 2025. Ting-Hao Huang, Francis Ferraro, Nasrin Mostafazadeh, Ishan Misra, Aishwarya Agrawal, Jacob Devlin, Ross Girshick, Xiaodong He, Pushmeet Kohli, Dhruv Batra, et al. Visual storytelling. In Proceedings ofthe2016 conference oftheNorth American chapter oftheassociation forcomputational linguistics: Human language technologies, pages 1233–1239, 2016. Yuzhou Huang, Yiran Qin, Shunlin Lu, Xintao Wang, Rui Huang, Ying Shan, and Ruimao Zhang. Story3d-agent: Exploring 3d storytelling visualization with large language models. arXiv preprint arXiv:2408.11801, 2024. Aaron Hurst, Adam Lerer, Adam P Goucher, Adam Perelman, Aditya Ramesh, Aidan Clark, AJ Ostrow, Akila Welihinda, Alan Hayes, Alec Radford, et al. Gpt-4o system card. arXiv preprint arXiv:2410.21276, 2024. Hyeonho Jeong, Gihyun Kwon, and Jong Chul Ye. Zero-shot generation of coherent storybook from plain text story using diffusion models. arXiv preprint arXiv:2302.03900, 2023. Taewon Kang, Divya Kothandaraman, and Ming C. Lin. Text2story: Advancing video storytelling with text guidance. arXiv preprint arXiv:2503.06310, 2025. Seungkwon Kim, GyuTae Park, Sangyeon Kim, and Seung-Hun Nam. Visagent: Narrative-preserving story visualization framework. arXiv preprint arXiv:2503.02399, 2024. Bowen Li and Thomas Lukasiewicz. Word-level fine-grained story visualization. arXiv preprint arXiv:2208.02341, 2022. Yitong Li, Zhe Gan, Yelong Shen, Jingjing Liu, Yu Cheng, Yuexin Wu, Lawrence Carin, David Carlson, and Jianfeng Gao. Storygan: A sequential conditional gan for story visualization. In Proceedings ofthe IEEE/CVF Conference onComputer Vision andPattern Recognition, pages 6329–6338, 2019. Yunxin Li, Haoyuan Shi, Baotian Hu, Longyue Wang, Jiashun Zhu, Jinyi Xu, Zhen Zhao, and Min Zhang. Anim-director: A large multimodal model powered agent for controllable animation video generation. In SIGGRAPH Asia 2024 Conference Papers, pages 1–11, 2024. Zuzeng Lin, Ailin Huang, and Zhewei Huang. Collaborative neural rendering using anime character sheets. arXiv preprint arXiv:2207.05378, 2022. Chang Liu, Haoning Wu, Yujie Zhong, Xiaoyun Zhang, Yanfeng Wang, and Weidi Xie. Intelligent grimm - open-ended visual storytelling via latent diffusion models. In Proceedings oftheIEEE/CVF Conference onComputer Vision andPattern Recognition (CVPR), pages 6190–6200, June 2024. Chang Liu, Haoning Wu, Yujie Zhong, Xiaoyun Zhang, Yanfeng Wang, and Weidi Xie. Intelligent grimm- open-ended visual storytelling via latent diffusion models. In Proceedings oftheIEEE/CVF Conference onComputer Vision andPattern Recognition, pages 6190–6200, 2024. Shilong Liu, Zhaoyang Zeng, Tianhe Ren, Feng Li, Hao Zhang, Jie Yang, Qing Jiang, Chunyuan Li, Jianwei Yang, Hang Su, et al. Grounding dino: Marrying dino with grounded pre-training for open-set object detection. In European Conference onComputer Vision, pages 38–55. Springer, 2024. Yixin Liu, Kai Zhang, Yuan Li, Zhiling Yan, Chujie Gao, Ruoxi Chen, Zhengqing Yuan, Yue Huang, Hanchi Sun, Jianfeng Gao, et al. Sora: A review on background, technology, limitations, and opportunities of large vision models. arXiv preprint arXiv:2402.17177, 2024. Xiangyang Luo, Junhao Cheng, Yifan Xie, Xin Zhang, Tao Feng, Zhou Liu, Fei Ma, and Fei Yu. Object isolated attention for consistent story visualization. arXiv preprint arXiv:2503.23353, 2024. MagicLight AI. Brmgo: Ai-powered tool for story script generation. https://brmgo.cn/, 2025. Accessed: 2025-04-16. 30  Adyasha Maharana and Mohit Bansal. Integrating visuospatial, linguistic and commonsense structure into story visualization. arXiv preprint arXiv:2110.10834, 2021. Jiawei Mao, Xiaoke Huang, Yunfei Xie, Yuanqi Chang, Mude Hui, Bingjie Xu, and Yuyin Zhou. Story- Adapter: A Training-free Iterative Framework for Long Story Visualization, 2024. Jiawei Mao, Xiaoke Huang, Yunfei Xie, Yuanqi Chang, Mude Hui, Bingjie Xu, and Yuyin Zhou. Story- adapter: A training-free iterative framework for long story visualization. arXiv preprint arXiv:2410.06244, 2024. Maoyan Entertainment. Shenbi: Ai-powered scriptwriting tool by maoyan. https://shenbi.maoyan. com/, 2025. Accessed: 2025-04-16. Meitu Inc. Moki: Ai short film creation tool. https://www.moki.cn, 2024. Ruibo Ming, Zhewei Huang, Zhuoxuan Ju, Jianming Hu, Lihui Peng, and Shuchang Zhou. A survey on fu- ture frame synthesis: Bridging deterministic and generative approaches. arXiv preprint arXiv:2401.14718, 2024. Morphic, Inc. Introducing morphic studio. https://www.morphic.com/, July 2024. Accessed: 2025- 04-16. OpenAI. Gpt-4.1: Advanced large language model for natural language understanding and generation. https://openai.com/research/gpt-4-1, 2025. Accessed: 2025-04-16. Dongwei Pan, Long Zhuo, Jingtan Piao, Huiwen Luo, Wei Cheng, Yuxin Wang, Siming Fan, Shengqi Liu, Lei Yang, Bo Dai, et al. Renderme-360: a large digital asset library and benchmarks towards high-fidelity head avatars. Advances inNeural Information Processing Systems, 36:7993–8005, 2023. Xichen Pan, Pengda Qin, Yuhong Li, Hui Xue, and Wenhu Chen. Synthesizing coherent story with auto- regressive latent diffusion models. In Proceedings oftheIEEE/CVF Winter Conference onApplications ofComputer Vision, pages 2920–2930, 2024. Christos Papadimitriou, Giorgos Filandrianos, Maria Lymperaiou, and Giorgos Stamou. Masked generative story transformer with character guidance and caption augmentation, 2024. Dustin Podell, Zion English, Kyle Lacey, Andreas Blattmann, Tim Dockhorn, Jonas Müller, Joe Penna, and Robin Rombach. Sdxl: Improving latent diffusion models for high-resolution image synthesis. arXiv preprint arXiv:2307.01952, 2023. Alec Radford, Jong Wook Kim, Chris Hallacy, Aditya Ramesh, Gabriel Goh, Sandhini Agarwal, Girish Sastry, Amanda Askell, Pamela Mishkin, Jack Clark, et al. Learning transferable visual models from natural language supervision. In International conference onmachine learning, pages 8748–8763. PmLR, 2021. Tim Salimans, Ian Goodfellow, Wojciech Zaremba, Vicki Cheung, Alec Radford, and Xi Chen. Improved techniques for training gans. In Advances inneural information processing systems, pages 2234–2242, 2016. Fei Shen, Hu Ye, Sibo Liu, Jun Zhang, Cong Wang, Xiao Han, and Wei Yang. Boosting consistency in story visualization with rich-contextual conditional diffusion models. arXiv preprint arXiv:2407.02482, 2024. Jaskirat Singh, Junshen Kevin Chen, Jonas Kohler, and Michael Cohen. Storybooth: Training-free multi-subject consistency for improved visual storytelling. arXiv preprint arXiv:2504.05800, 2024. Gowthami Somepalli, Anubhav Gupta, Kamal Gupta, Shramay Palta, Micah Goldblum, Jonas Geiping, Abhinav Shrivastava, and Tom Goldstein. Measuring style similarity in diffusion models. arXiv preprint arXiv:2404.01292, 2024. StepFun. Step-1v: A hundred billion parameter multimodal large model, 2024. Ming Tao, Bing-Kun Bao, Hao Tang, Yaowei Wang, and Changsheng Xu. Storyimager: A unified and efficient framework for coherent story visualization and completion. arXiv preprint arXiv:2404.05979, 2024. Chongjun Tu, Lin Zhang, Pengtao Chen, Peng Ye, Xianfang Zeng, Wei Cheng, Gang Yu, and Tao Chen. Favor-bench: A comprehensive benchmark for fine-grained video motion understanding. arXiv preprint arXiv:2503.14935, 2025. TypeMovie Team. Typemovie: Text-to-video storytelling with style and rhythm. https://typemovie. art, 2024. Accessed: 2025-04-16. Jianyi Wang, Kelvin CK Chan, and Chen Change Loy. Exploring clip for assessing the look and feel of images. In Proceedings oftheAAAI conference onartificial intelligence, 2023. Jiuniu Wang, Zehua Du, Yuyuan Zhao, Bo Yuan, Kexiang Wang, Jian Liang, Yaxi Zhao, Yihen Lu, Gengliang Li, Junlong Gao, Xin Tu, and Zhenyu Guo. Aesopagent: Agent-driven evolutionary system on story-to-video production. arXiv preprint arXiv:2403.07952, 2024. 31  Wen Wang, Canyu Zhao, Hao Chen, Zhekai Chen, Kecheng Zheng, and Chunhua Shen. Autostory: Generating diverse storytelling images with minimal human effort. Int.J.Computer Vision, 2024. Wenjia Wang, Liang Pan, Zhiyang Dou, Jidong Mei, Zhouyingcheng Liao, Yuke Lou, Yifan Wu, Lei Yang, Jingbo Wang, and Taku Komura. Sims: Simulating stylized human-scene interactions with retrieval- augmented script generation. arXiv preprint arXiv:2411.19921, 2024. Zun Wang, Jialu Li, Han Lin, Jaehong Yoon, and Mohit Bansal. Dreamrunner: Fine-grained compositional story-to-video generation with retrieval-augmented motion adaptation. arXiv preprint arXiv:2411.16657, 2024. Mike Zheng Shou Weijia Wu, Zeyu Zhu. Automated movie generation via multi-agent cot planning, 2025. Jianzong Wu, Chao Tang, Jingbo Wang, Yanhong Zeng, Xiangtai Li, and Yunhai Tong. Diffsensei: Bridging multi-modal llms and diffusion models for customized manga generation. arXiv preprint arXiv:2412.07589, 2024. Shaojin Wu, Mengqi Huang, Wenxu Wu, Yufeng Cheng, Fei Ding, and Qian He. Less-to-more gen- eralization: Unlocking more controllability by in-context generation. arXiv preprint arXiv:2504.02160, 2025. Shaojin Wu, Mengqi Huang, Wenxu Wu, Yufeng Cheng, Fei Ding, and Qian He. Less-to-more gen- eralization: Unlocking more controllability by in-context generation. arXiv preprint arXiv:2504.02160, 2025. Weijia Wu, Mingyu Liu, Zeyu Zhu, Xi Xia, Haoen Feng, Wen Wang, Kevin Qinghong Lin, Chunhua Shen, and Mike Zheng Shou. Moviebench: A hierarchical movie level dataset for long video generation. arXiv preprint arXiv:2411.15262, 2024. Weijia Wu, Zeyu Zhu, and Mike Zheng Shou. Automated movie generation via multi-agent cot planning. arXiv preprint arXiv:2503.07314, 2025. Zhen Xing, Qijun Feng, Haoran Chen, Qi Dai, Han Hu, Hang Xu, Zuxuan Wu, and Yu-Gang Jiang. A survey on video diffusion models. ACM Computing Surveys, 2023. Xuenan Xu, Jiahao Mei, Chenliang Li, Yuning Wu, Ming Yan, Shaopeng Lai, Ji Zhang, and Mengyue Wu. Mm-storyagent: Immersive narrated storybook video generation with a multi-agent paradigm across text, image and audio. arXiv preprint arXiv:2503.05242, 2024. Xuenan Xu, Jiahao Mei, Chenliang Li, Yuning Wu, Ming Yan, Shaopeng Lai, Ji Zhang, and Mengyue Wu. Mm-storyagent: Immersive narrated storybook video generation with a multi-agent paradigm across text, image and audio. arXiv preprint arXiv:2503.05242, 2025. Shuai Yang, Yuying Ge, Yang Li, Yukang Chen, Yixiao Ge, Ying Shan, and Yingcong Chen. Seed-story: Multimodal long story generation with large language model. arXiv preprint arXiv:2407.08683, 2024. Shuai Yang, Yuying Ge, Yang Li, Yukang Chen, Yixiao Ge, Ying Shan, and Yingcong Chen. Seed-story: Multimodal long story generation with large language model. arXiv preprint arXiv:2407.08683, 2024. Zilyu Ye, Jinxiu Liu, JinJin Cao, Zhiyang Chen, Ziwei Xuan, Mingyuan Zhou, Qi Liu, and Guo-Jun Qi. Openstory: A large-scale open-domain dataset for subject-driven visual storytelling. In Proceedings ofthe IEEE/CVF Conference onComputer Vision andPattern Recognition, pages 7953–7962, 2024. Xiaohua Zhai, Basil Mustafa, Alexander Kolesnikov, and Lucas Beyer. Sigmoid loss for language image pre-training. In Proceedings oftheIEEE/CVF international conference oncomputer vision, pages 11975–11986, 2023. Chi Zhang, Yuanzhi Liang, Xi Qiu, Fangqiu Yi, and Xuelong Li. Vast 1.0: A unified framework for controllable and consistent video generation. arXiv preprint arXiv:2412.16677, 2024. Hao Zhang, Feng Li, Shilong Liu, Lei Zhang, Hang Su, Jun Zhu, Lionel M. Ni, and Heung-Yeung Shum. Dino: Detr with improved denoising anchor boxes for end-to-end object detection, 2022. Jinlu Zhang, Jiji Tang, Rongsheng Zhang, Tangjie Lv, and Xiaoshuai Sun. Storyweaver: A unified world model for knowledge-enhanced story character customization. Proceedings oftheAAAI Conference on Artificial Intelligence, 39(9):9951–9959, Apr. 2025. Min Zhang, Zilin Wang, Liyan Chen, Kunhong Liu, and Juncong Lin. Dialogue director: Bridging the gap in dialogue visualization for multimodal storytelling. arXiv preprint arXiv:2412.20725, 2024. Runze Zhang, Guoguang Du, Xiaochuan Li, Qi Jia, Liang Jin, Lu Liu, Jingjing Wang, Cong Xu, Zhenhua Guo, Yaqian Zhao, et al. Dropletvideo: A dataset and approach to explore integral spatio-temporal consistent video generation. arXiv preprint arXiv:2503.06053, 2025. Canyu Zhao, Mingyu Liu, Wen Wang, Jianlong Yuan, Hao Chen, Bo Zhang, and Chunhua Shen. Moviedreamer: Hierarchical generation for coherent long visual sequence, 2024. 32  Xiangyu Zhao, Peiyuan Zhang, Kexian Tang, Hao Li, Zicheng Zhang, Guangtao Zhai, Junchi Yan, Hua Yang, Xue Yang, and Haodong Duan. Envisioning beyond the pixels: Benchmarking reasoning-informed visual editing. arXiv preprint arXiv:2504.02826, 2025. Yupeng Zhou, Daquan Zhou, Ming-Ming Cheng, Jiashi Feng, and Qibin Hou. Storydiffusion: Consistent self-attention for long-range image and video generation. Advances inNeural Information Processing Systems, 37:110315–110340, 2024. Shudong Zhu(Andrew Zhu). Long prompt weighted stable diffusion embedding. https://github.com/ xhinker/sd_embed, 2024. Cailin Zhuang, Yaoqi Hu, Xuanyang Zhang, Wei Cheng, Jiacheng Bao, Shengqi Liu, Yiying Yang, Xianfang Zeng, Gang Yu, and Ming Li. Styleme3d: Stylization with disentangled priors by multiple encoders on 3d gaussians. arXiv preprint arXiv:2504.15281, 2025. Shaobin Zhuang, Kunchang Li, Xinyuan Chen, Yaohui Wang, Ziwei Liu, Yu Qiao, and Yali Wang. Vlogger: Make your dream a vlog. In Proceedings oftheIEEE/CVF Conference onComputer Vision andPattern Recognition, pages 8806–8817, 2024. 33",
  "text_length": 112294
}