{
  "id": "http://arxiv.org/abs/2506.04090v1",
  "title": "A Reference Architecture for Gamified Cultural Heritage Applications\n  Leveraging Generative AI and Augmented Reality",
  "summary": "The rapid advancement of Information and Communication Technologies is\ntransforming Cultural Heritage access, experience, and preservation. However,\nmany digital heritage applications lack interactivity, personalization, and\nadaptability, limiting user engagement and educational impact. This short paper\npresents a reference architecture for gamified cultural heritage applications\nleveraging generative AI and augmented reality. Gamification enhances\nmotivation, artificial intelligence enables adaptive storytelling and\npersonalized content, and augmented reality fosters immersive, location-aware\nexperiences. Integrating AI with gamification supports dynamic mechanics,\npersonalized feedback, and user behavior prediction, improving engagement. The\nmodular design supports scalability, interoperability, and adaptability across\nheritage contexts. This research provides a framework for designing interactive\nand intelligent cultural heritage applications, promoting accessibility and\ndeeper appreciation among users and stakeholders.",
  "authors": [
    "Federico Martusciello",
    "Henry Muccini",
    "Antonio Bucchiarone"
  ],
  "published": "2025-06-04T15:49:05Z",
  "updated": "2025-06-04T15:49:05Z",
  "categories": [
    "cs.SE"
  ],
  "pdf_url": "http://arxiv.org/pdf/2506.04090v1",
  "full_text": "--- Page 1 ---\narXiv:2506.04090v1  [cs.SE]  4 Jun 2025A Reference Architecture for Gamified Cultural\nHeritage Applications Leveraging Generative AI\nand Augmented Reality\nFederico Martusciello1, Henry Muccini1, and Antonio Bucchiarone1\nDISIM, University of L’Aquila\nhttps://www.univaq.it\nfederico.martusciello@graduate.univaq.it, henry.muccini@univaq.it,\nantonio.bucchiarone@univaq.it\nAbstract. The rapid advancement of Information and Communication\nTechnologies is transforming Cultural Heritage access, experience, and\npreservation. However, many digital heritage applications lack interac-\ntivity, personalization, and adaptability, limiting user engagement and\neducational impact.\nThis short paper presents a reference architecture for gamified cultural\nheritage applications leveraging generative AI andaugmented reality .\nGamification enhances motivation, artificial intelligence enables adap-\ntive storytelling and personalized content, and augmented reality fosters\nimmersive, location-aware experiences. Integrating AI with gamification\nsupports dynamic mechanics, personalized feedback, and user behavior\nprediction, improving engagement. The modular design supports scala-\nbility,interoperability , andadaptability across heritage contexts.\nThis research provides a framework for designing interactive andintel-\nligentcultural heritage applications, promoting accessibility and deeper\nappreciation among users and stakeholders.\nKeywords: reference architecture ·gamification ·generative artificial\nintelligence ·augmented reality ·cultural heritage.\n1 Introduction and motivation\nThe rapid advancements in Information and Communication Technologies (ICT)\nare transforming access to and interaction with cultural heritage (CH) [17]. The\nrise of mixed reality devices, such as smart glasses, marks a shift from con-\nventional mobile applications to immersive, context-aware experiences, aligning\nwith the growing demand for interactive and personalized CH engagement [2].\nOver the past decade, mixed reality has gained traction in serious games and\ngamification (GAM), particularly in education [19] and CH [8]. Meanwhile, Gen-\nerative Artificial Intelligence (GAI) is revolutionizing digital content creation by\nenabling adaptive storytelling, automated translation, and real-time personal-\nization [3].\n--- Page 2 ---\n2 F. Author et al.\nDespitetheseadvancements,nounifiedframeworkcurrentlyintegratesGAM,\nGAI and Augmented Reality (AR) to enhance CH experiences. While gamifica-\ntion boosts engagement [9], GAI enables dynamic content generation and intel-\nligent adaptation [6] and AR provides interactive, spatially aware visualizations\n[2], their combined potential remains largely unexploited.\nThis paper introduces a reference software architecture for next-generation\nCH applications, merging gamification, AI-driven generative content and AR\nwithin a scalable, adaptive framework. Enabling real-time content generation,\nfostering engagement, and supporting immersive interactions, this architecture\nlays the foundation for intelligent, responsive CH experiences and provides a\nstructured blueprint for future research into AI-driven personalization, multi-\nmodal interaction, and the integration of emerging technologies.\nThe paper is structured as follows: Section 2 reviews related work, identifying\nresearch gaps and existing architectures. Section 3 details the proposed architec-\nture, emphasizing its modularity, scalability, and integration strategies. Finally,\nSection 4 summarizes key contributions and outlines future research directions.\n2 Related Work\nThe convergence of GAM, GAI, and AR is reshaping CH dissemination and edu-\ncation. Despite individual advancements in each field, their seamless integration\nwithin a unified architectural framework remains an open challenge. This section\nreviews existing approaches, identifies research gaps, and highlights the need for\na structured reference architecture that effectively combines these technologies\nin CH applications.\nGamification enhances user engagement and motivation in CH experiences\n[4]. Marques et al. [10] emphasize its role in fostering creativity but note the ab-\nsence of standardized architectural frameworks. Similarly, Khan et al. [9] high-\nlight the lack of structured design methodologies, leading to fragmented, non-\nscalable implementations. While game mechanics such as challenges, rewards,\nand progress tracking through levels are commonly employed, their integration\ninto a modular, adaptable architecture for CH remains underexplored.\nAugmented Reality hasrevolutionizedCHstorytellingandvisualizationthrough\nimmersive digital overlays on historical artifacts and sites. However, many re-\nsearch prototypes lack a strong architectural foundation [13]. Panou et al. [11]\npropose a mobile AR-based tourist guide incorporating gamification, addressing\nchallenges like real-time tracking and content synchronization. Yet, most AR\nsystems rely on marker- or location-based tracking without adaptive content\ndelivery, limiting their ability to dynamically personalize user experiences. The\nintegration of AIfor real-time adaptation, contextual storytelling, and interac-\ntive dialogue generation remains underdeveloped.\nThe combined potential of Gamification, AI andARfor intelligent CH ex-\nperiences is evident, but a comprehensive reference architecture unifying these\nelements is still lacking. Ribeiro et al. [14] explore an AI-driven, VR-AR gami-\nfied museum system that improves engagement and accessibility. However, their\n--- Page 3 ---\nA Reference Architecture for GAM CH Applications leveraging GAI and AR 3\nwork does not propose a reference software architecture applicable across diverse\nCH contexts. AI-driven models can personalize narratives, optimize user interac-\ntions, and generate dynamic storytelling using machine learning (ML) and nat-\nural language processing (NLP). Current solutions mainly focus on standalone\nrecommendation systems rather than fully integrated GAM-AI-AR frameworks.\nDespite progress in individual and combined applications, the absence of a\ncohesive, scalable, and modular reference architecture remains a key barrier to\ndeveloping integrated, adaptive, and interoperable CH systems. To address this,\nthe present work introduces a novel reference architecture that systematically\nintegrates these technologies as described in the next section.\n3 The Conceptual Reference Architecture\nAreference architecture definesthecoresubsystemsandtheirinteractionswithin\na domain, providing a standardized framework for system design and evolution.\nIt enhances development and maintenance by improving system comprehension,\nsupporting trade-off analysis, and serving as a structured template for designing\nor refining systems [5]. Establishing a common architectural foundation should\nensurescalability, interoperability, and adaptability to evolving technological and\nuser needs [13,14,15].\nThis section introduces the Conceptual Reference Architecture (Fig. 1). The\narchitecture integrates gamification mechanics, AI-powered recommendations,\nand AR visualization to enhance engagement, optimize performance, and en-\nable seamless real-time interactions within a scalable ecosystem.\nTomeettheseobjectives,thearchitecturealignswithkey Non-Functional Re-\nquirements (NFRs) , such as scalability, interoperability, real-time performance,\nandsecurity,ensuringsmoothintegrationacrossCHinstitutionsanddigitalplat-\nforms. It also incorporates Key Design Options (KDOs) , including event-driven\ncommunication, hybrid cloud-edge processing, and modular service orchestra-\ntion, providing flexibility and efficiency [7].\nThe following subsections detail the identified NFRs, KDOs and the core\ncomponents of the architecture, their interactions, and the mechanisms enabling\nreal-time adaptation and personalized user experiences for CH applications.\n3.1 Non-Functional Requirements\nDeveloping a scalable and cohesive software architecture that integrates GAM,\nGAI, and AR for CH applications requires careful architectural considerations.\nThe integration of these technologies must ensure maintainability ,adaptability ,\ninteroperability ,scalability ,performance ,modularity , andpersonalization , bal-\nancing real-time responsiveness with the complexity of AI-driven content gener-\nation and adaptive user experiences. This section outlines the identified essential\nNon-Functional Requirements (NFR) necessary to achieve an efficient and sus-\ntainable architecture.\n--- Page 4 ---\n4 F. Author et al.\nTo enhance maintainability and adaptability , the architecture must adhere\nto modular design principles, ensuring a clear separation between AI-driven\nrecommendations, gamification mechanics, and AR visualization. This modu-\nlar approach allows independent component updates without disrupting system\nfunctionality. Moreover, interoperability and integration play a crucial role in en-\nabling CH institutions to share digital assets and integrate external datasets.\nSupporting open data standards (e.g., GLTF, X3D, RDF, OWL) and providing\nflexible API-based communication fosters seamless content exchange.\nScalability is a fundamental requirement, as CH applications must accom-\nmodate an increasing number of users and collections, dynamic AI-generated\ncontent, and complex AR renderings [13] and interactions while maintaining\nsystemperformance and responsiveness . The architecture should support cloud-\nedgehybridprocessingtooffloadAIinferenceandoptimizedARrendering,while\nload balancing and event-driven mechanisms ensure resource efficiency [15].\nPersonalization is essential for user engagement, requiring AI-driven adap-\ntive storytelling, dynamic challenge adjustments, and personalized AR content\nplacement based on user behavior. AI should enable context-aware recommen-\ndations and real-time content adaptation, ensuring tailored cultural exploration\nexperiences. Furthermore, usability and accessibility must be prioritized by im-\nplementing multimodal interactions (voice, touch, gesture), adaptive user inter-\nface scaling, and compliance with accessibility standards (WCAG 2.1) [16].\nGiven the reliance on personalized AI-driven content, security and privacy\nmechanisms are critical. Secure authentication, anonymized data tracking, and\nAI explainability mechanisms must be embedded to ensure ethical and trans-\nparent AI usage. Additionally, reliability and fault tolerance must be addressed\nthrough offline support, resilient AR tracking, and self-healing infrastructure\nmechanisms, ensuring uninterrupted functionality in diverse museum and her-\nitage site environments. To maintain data integrity , historical narratives and\nAI-generated content should be validated by domain experts, stored in version-\ncontrolled knowledge bases, and monitored for factual accuracy.\n3.2 Key Design Options\nTo implement these NFRs, specific KDOs must be adopted. A hybrid microser-\nvices and event-driven architecture ensures AI, AR, and gamification compo-\nnents operate independently while synchronizing in real time [12]. As users in-\nteract with AR elements and perform game actions, an event-driven mecha-\nnism updates game status and dynamically adjust rewards. Message queues and\nWebSocketsfacilitatesmoothsynchronizationbetweenAIrecommendations,AR\noverlays, and game progress.\nAmodular architecture decouples GAM services, AI and AR. The Gamifi-\ncation Engine manages engagement tracking and adaptive difficulty, while the\nGAI module employs ML and LLMs to generate personalized narratives and\nexploration pathways [18]. The AR Module ensures real-time rendering, spatial\ntracking, and multimodal interaction for an immersive phygitalexperience.\n--- Page 5 ---\nA Reference Architecture for GAM CH Applications leveraging GAI and AR 5\nFor seamless integration, RESTful APIs support structured data exchange,\nWebSockets enable low-latency interactions, and message queues handle asyn-\nchronous AI content processing. Hybrid data management employs Structured\nQueryLanguage(SQL)forstructuredusertrackingandNoSQLforAI-generated\ncontent. Content Delivery Networks (CDNs) optimize AR content distribution,\nreducing rendering latency.\nAs AI-driven personalization is core to CH applications, reinforcement learn-\ning, context-aware AR placement, and adaptive gamification should be inte-\ngrated. AI analyzes user behavior and real-time interactions to refine recom-\nmendations while ensuring GDPR-compliant data handling.\nFinally,future extensibility is enabled by containerization, plugin-based AI,\nand decoupled training and inference pipelines. This ensures continuous AI up-\ndates, integration of new gamification mechanics, and adaptation to emerging\ninteraction paradigms, supporting long-term evolution in CH applications.\n3.3 Main Components and their Integration\nTheproposed reference architecture (Figure1)integrates gamification, AI-driven\npersonalization , andaugmented reality to enhance cultural heritage experiences.\nThis architecture defines core components that work together to create interac-\ntive, immersive, and adaptive user experiences1.\nFig. 1.The proposed Reference Architecture.\n1For the sake of space, this short paper will cover the component view only, while\nleaving further views to future work.\n--- Page 6 ---\n6 F. Author et al.\nAt the heart of the system is the Mobile App (Figure 1.a), which serves as\nthe primary interface for user interaction, content delivery, and engagement. It\nstructures CH visits into adaptive exploration journeys, guiding users through\ndynamically generated pathways that integrate AR content and gamified chal-\nlenges. The Path Execution Engine interprets user-specific journeys as graph-\nbased structures, where each node of the graph represent a Point of Interest\n(POI) and sequentially unlock as users engage with content and challenges.\nProgression through this graph is determined by user interactions, AI-driven\nrecommendations, and gamification scores. Each POI integrates AR visualiza-\ntions, interactive storytelling, and game-based rewards, ensuring a structured\nyet adaptive cultural heritage exploration experience (Figure 2.c), while the AI\nAssistant provides historical insights, personalized recommendations, and in-\nteractive storytelling (Figure 2.f). The Rendering Component processes and dis-\nplaysARelements,overlayingdigitalcontentontoreal-worldartifactstoenhance\nimmersion while enabling interaction with 3D objects (Figure 2.d). It supports\nreal-time manipulation, scaling, and rotation of virtual reconstructions, allowing\nusers to explore historical artifacts from multiple perspectives.\nFig. 2.Screenshots from the App. From left to right: The Home Page, the game status\npage, the journey page, the AR visualizations of artifacts, an example of a Quiz and\nthe AR AI assistant.\nTheGamification Engine (Figure 1.b) plays a central role in driving engage-\nment by managing game logic, tracking progress, and executing challenges. It in-\ntegrates elements such as points, badges, levels, and leaderboards, ensuring that\nusers remain motivated throughout their exploration. The engine processes game\nactions triggered by user interactions, evaluating them against predefined rules\nandupdatingthe game status inrealtime(Figure2.b).A Domain-Specific Lan-\nguage (DSL) [1] facilitates the creation of gamification rules , enabling struc-\ntured and adaptable game mechanics. The engine also aggregates engagement\ndata, including user interactions with AR objects, quizzes, and challenges, and\nforwards this data to the AI Recommender System . The AI Recommender an-\n--- Page 7 ---\nA Reference Architecture for GAM CH Applications leveraging GAI and AR 7\nalyzes this information—alongside user preferences and exploration history—to\ndetermine the optimal next POI within the graph-based journey structure.\nA key enabler of personalization is the Generative AI module (Figure 1.c),\nwhich dynamically generates content, optimizes exploration pathways, and en-\nables AI-assisted storytelling (Figure 2.f). It leverages ML, NLP, and recommen-\ndation algorithms to tailor each visitor’s journey. The AI Recommender System\nanalyzes user behavior to suggest personalized exploration paths modeled as\ndirected graph, where each node unlocks specific activities, challenges, and re-\nwards. The Journey Path Creator dynamically adjusts the traversal of this\ngraph based on user preferences, past interactions, and real-time engagement,\nensuring an adaptive and interactive exploration. Each node is linked to pre-\ndefined gamification mechanics, influencing progress through AI-driven recom-\nmendations and contextual AR storytelling. To ensure historical accuracy, AI-\ngenerated content undergoes expert validation before being added to the\nEducational Content Database , allowing continuous refinement through ex-\npert feedback and user interactions.\nEnhancing the phygital interaction, the Augmented Reality System (Fig-\nure 1.d) blends virtual and real-world elements, creating an immersive cul-\ntural experience. The Multimedia Augmentation Data Repository stores AR\ntrackables, 3D models, and digital overlays, while the tracking system en-\nsures precise positioning using spatial recognition, GPS localization, or marker-\nbased tracking. Users can access AR content through various devices, in-\ncluding smartphones, tablets, and smart glasses. The virtual-real mixer\nintegrates digital elements into historical sites, presenting interactive recon-\nstructions, animated narratives, and contextual information. Additionally, the\nindoor/outdoor navigation assistant provides real-time guidance based on\nthe user’s journey, while XR interactions enable multimodal engagement\nthrough touch, voice, and gestures (Figure 2.d,f).\n4 Conclusion and future directions\nThe proposed architecture originates from a prototype under development for\nThe National Museum of2, designed to enhance visitor engagement and pro-\nmote lesser-known archaeological sites. By leveraging event-driven mechanisms\nandhybridcloud-edgeprocessing,thearchitectureproposesreal-timeresponsive-\nness and seamless integration of gamification ,AI personalization , andAR-based\nexploration .\nIts structured design enables interoperability with external CH repositories\nand datasets, ensuring long-term adaptability. AI-assisted journey pathways and\ndynamic AR overlays enhance context-aware exploration, fostering engagement\nand knowledge retention. Human-in-the-Loop validation guarantees historical\naccuracy in AI-generated content.\nFuture work will refine AI-driven personalization, optimize component syn-\nchronization, and conduct extensive validation and testing . User trials will assess\n2The name was removed for double-blind review.\n--- Page 8 ---\n8 F. Author et al.\nusability, engagement, and educational impact, guiding iterative improvements\nfor broader adoption.\nReferences\n1. Removed for double-blind review\n2. Bekele, M.K., Pierdicca, R., Frontoni, E., Malinverni, E.S., Gain, J.: A survey of\naugmented, virtual, and mixed reality for cultural heritage. Journal on Computing\nand Cultural Heritage (JOCCH) 11(2), 1–36 (2018)\n3. Casillo, M., Colace, F., Gupta, B.B., Lorusso, A., Santaniello, D., Valentino, C.:\nThe role of ai in improving interaction with cultural heritage: An overview. Hand-\nbook of Research on AI and ML for Intelligent Machines and Systems (2024)\n4. Çetin, Ö., Erbay, F.: Gamification practices in museums. Journal of Tourismology\n7(2), 265–276 (2021)\n5. Cloutier, R., Muller, G., Verma, D., Nilchiani, R., Hole, E., Bone, M.: The concept\nof reference architectures. Systems Engineering 13(1), 14–27 (2010)\n6. Erbaşı, Z., Tural, B., Çoşkuner, İ.: The role and potential of artificial intelligence\nand gamification in education: The example of vakıf participation bank. Orclever\nProc. of Research and Development 3(1), 243–254 (2023)\n7. Hossain,M.D.,Sultana,T.,Akhter,S.,Hossain,M.I.,Thu,N.T.,Huynh,L.N.,Lee,\nG.W., Huh, E.N.: The role of microservice approach in edge computing: Opportu-\nnities, challenges, and research directions. ICT Express 9(6), 1162–1182 (2023)\n8. Ioannides, M., Magnenat-Thalmann, N., Papagiannakis, G.: Mixed reality and\ngamification for cultural heritage, vol. 2. Springer (2017)\n9. Khan, I., Melro, A., Amaro, A.C., Oliveira, L.: Role of gamification in cultural\nheritage dissemination: A systematic review. In: Proc. of Sixth Int. Congress on\nInformation and Communication Technology: ICICT 2021, London, Volume 1. pp.\n393–400. Springer (2022)\n10. Marques, C.G., Pedro, J.P., Araújo, I.: A systematic literature review of gamifica-\ntion in/for cultural heritage: leveling up, going beyond. Heritage 6(8) (2023)\n11. Panou, C., Ragia, L., Dimelli, D., Mania, K.: An architecture for mobile outdoors\naugmented reality for cultural heritage. ISPRS Int. Journal of Geo-Information\n7(12), 463 (2018)\n12. Rahmatulloh, A., Nugraha, F., Gunawan, R., Darmawan, I.: Event-driven archi-\ntecture to improve performance and scalability in microservices-based systems. In:\n2022 Int. Conference Advancement in Data Science, E-learning and Information\nSystems (ICADEIS). pp. 01–06. IEEE (2022)\n13. Reicher, T., Mac Williams, A., Brugge, B., Klinker, G.: Results of a study on\nsoftware architectures for augmented reality systems. In: The Second IEEE and\nACM Int. Symposium on Mixed and Augmented Reality. Proc. IEEE (2003)\n14. Ribeiro, M., Santos, J., Lobo, J., Araújo, S., Magalhães, L., Adão, T.: Vr, ar,\ngamification and ai towards the next generation of systems supporting cultural\nheritage: Addressing challenges of a museum context. In: Proc. of the 29th Int.\nACM Conference on 3D Web Technology. pp. 1–10 (2024)\n15. Siriwardhana, Y., Porambage, P., Liyanage, M., Ylianttila, M.: A survey on mobile\naugmented reality with 5g mobile edge computing: Architectures, applications, and\ntechnical aspects. IEEE Communications Surveys & Tutorials 23(2) (2021)\n16. Spina, C.: Wcag 2.1 and the current state of web accessibility in libraries. Weave:\nJournal of Library User Experience 2(2) (2019)\n--- Page 9 ---\nA Reference Architecture for GAM CH Applications leveraging GAI and AR 9\n17. Sylaiou, S., Papaioannou, G.: Ict in the promotion of arts and cultural heritage\neducation in museums. In: Strategic Innovative Marketing and Tourism: 7th ICSI-\nMAT, Athenian Riviera, Greece, 2018. pp. 363–370. Springer (2019)\n18. Trichopoulos, G.: Large language models for cultural heritage. In: Proc. of the 2nd\nInt. Conference of the ACM Greek SIGCHI Chapter. pp. 1–5 (2023)\n19. Zikas, P., Bachlitzanakis, V., Papaefthymiou, M., Kateros, S., Georgiou, S., Ly-\ndatakis, N., Papagiannakis, G.: Mixed reality serious games and gamification for\nsmart education. In: European conference on games based learning. p. 805. Aca-\ndemic Conferences Int. Limited (2016)",
  "text_length": 22753
}