{
  "id": "http://arxiv.org/abs/2506.03139v1",
  "title": "SVGenius: Benchmarking LLMs in SVG Understanding, Editing and Generation",
  "summary": "Large Language Models (LLMs) and Multimodal LLMs have shown promising\ncapabilities for SVG processing, yet existing benchmarks suffer from limited\nreal-world coverage, lack of complexity stratification, and fragmented\nevaluation paradigms. We introduce SVGenius, a comprehensive benchmark\ncomprising 2,377 queries across three progressive dimensions: understanding,\nediting, and generation. Built on real-world data from 24 application domains\nwith systematic complexity stratification, SVGenius evaluates models through 8\ntask categories and 18 metrics. We assess 22 mainstream models spanning\ndifferent scales, architectures, training paradigms, and accessibility levels.\nOur analysis reveals that while proprietary models significantly outperform\nopen-source counterparts, all models exhibit systematic performance degradation\nwith increasing complexity, indicating fundamental limitations in current\napproaches; however, reasoning-enhanced training proves more effective than\npure scaling for overcoming these limitations, though style transfer remains\nthe most challenging capability across all model types. SVGenius establishes\nthe first systematic evaluation framework for SVG processing, providing crucial\ninsights for developing more capable vector graphics models and advancing\nautomated graphic design applications. Appendix and supplementary materials\n(including all data and code) are available at\nhttps://zju-real.github.io/SVGenius.",
  "authors": [
    "Siqi Chen",
    "Xinyu Dong",
    "Haolei Xu",
    "Xingyu Wu",
    "Fei Tang",
    "Hang Zhang",
    "Yuchen Yan",
    "Linjuan Wu",
    "Wenqi Zhang",
    "Guiyang Hou",
    "Yongliang Shen",
    "Weiming Lu",
    "Yueting Zhuang"
  ],
  "published": "2025-06-03T17:58:57Z",
  "updated": "2025-06-03T17:58:57Z",
  "categories": [
    "cs.CV",
    "cs.AI"
  ],
  "pdf_url": "http://arxiv.org/pdf/2506.03139v1"
}