{
  "id": "http://arxiv.org/abs/2506.00888v1",
  "title": "An Integrated Platform for LEED Certification Automation Using Computer\n  Vision and LLM-RAG",
  "summary": "The Leadership in Energy and Environmental Design (LEED) certification\nprocess is characterized by labor-intensive requirements for data handling,\nsimulation, and documentation. This paper presents an automated platform\ndesigned to streamline key aspects of LEED certification. The platform\nintegrates a PySide6-based user interface, a review Manager for process\norchestration, and multiple analysis engines for credit compliance, energy\nmodeling via EnergyPlus, and location-based evaluation. Key components include\nan OpenCV-based preprocessing pipeline for document analysis and a report\ngeneration module powered by the Gemma3 large language model with a\nretrieval-augmented generation framework. Implementation techniques - including\ncomputer vision for document analysis, structured LLM prompt design, and\nRAG-based report generation - are detailed. Initial results from pilot project\ndeployment show improvements in efficiency and accuracy compared to traditional\nmanual workflows, achieving 82% automation coverage and up to 70% reduction in\ndocumentation time. The platform demonstrates practical scalability for green\nbuilding certification automation.",
  "authors": [
    "Jooyeol Lee"
  ],
  "published": "2025-06-01T08:05:35Z",
  "updated": "2025-06-01T08:05:35Z",
  "categories": [
    "cs.SE"
  ],
  "pdf_url": "http://arxiv.org/pdf/2506.00888v1",
  "full_text": "--- Page 1 ---\narXiv:2506.00888v1  [cs.SE]  1 Jun 2025An Integrated Platform for LEED Certification\nAutomation Using Computer Vision and LLM-RAG\nJooYeol Lee\nEverPoint Inc.\nCEO & Independent Researcher\nSeoul, South Korea\ngnt8521@gmail.com\nAbstract —The Leadership in Energy and Environmental De-\nsign (LEED) certification process is characterized by labor-\nintensive requirements for data handling, simulation, and docu-\nmentation. This paper presents an automated platform designed\nto streamline key aspects of LEED certification. The platform\nintegrates a PySide6-based user interface, a Review Manager for\nprocess orchestration, and multiple analysis engines for credit\ncompliance, energy modeling via EnergyPlus, and location-based\nevaluation. Key components include an OpenCV-based prepro-\ncessing pipeline for document analysis and a report generation\nmodule powered by the Gemma3 large language model with\na retrieval-augmented generation framework. Implementation\ntechniques—including computer vision for document analysis,\nstructured LLM prompt design, and RAG-based report genera-\ntion—are detailed. Initial results from pilot project deployment\nshow improvements in efficiency and accuracy compared to tra-\nditional manual workflows, achieving 82% automation coverage\nand up to 70% reduction in documentation time. The platform\ndemonstrates practical scalability for green building certification\nautomation.\nIndex Terms —LEED Certification, Automation, Building Per-\nformance Simulation, EnergyPlus, Large Language Models,\nRetrieval-Augmented Generation\nI. I NTRODUCTION\nObtaining Leadership in Energy and Environmental Design\n(LEED) certification for buildings is a complex, multi-criteria\nprocess involving extensive documentation, analysis, and strict\ncompliance checks [1]. Current certification workflows present\nsignificant challenges; project teams must manually gather\nand verify vast amounts of data, navigate multifaceted LEED\ncriteria, and often identify compliance gaps late in the project\nlifecycle [2]. These manual, reactive approaches make certifi-\ncation time-consuming and error-prone, contributing to project\ndelays and increased costs [3].\nThe application of automation technologies has been identi-\nfied as a promising approach to address these inefficiencies [4].\nAutomated systems can potentially consolidate project data,\nprovide real-time compliance insights, and simulate design\nscenarios to predict LEED scores early in the design phase [5].\nThe U.S. Green Building Council (USGBC) and researchers\nhave noted that automating data management and monitoring\ncan address major LEED challenges, such as tracking diverse\nsustainability metrics across design and construction phases\n[6].An automated approach could continuously flag non-\ncompliance issues and suggest corrective actions, reducing\nlate-stage rework [8]. Furthermore, advances in building per-\nformance simulation and machine learning enable predictive\nanalysis of how design choices impact certification levels\n[7]. The emergence of powerful computational tools, from\ncomputer vision libraries to large language models, provides\nthe building industry with new means to automate previously\nmanual tasks [9].\nIn this paper, we introduce an integrated platform for LEED\ncertification automation. The system combines a desktop ap-\nplication front-end with an orchestrated backend pipeline of\nanalysis modules and language model services. The contribu-\ntions of this work include: (1) a modular system architecture\nthat unifies user input, data preprocessing, physics-based simu-\nlation, and LLM-based report generation; (2) implementation\nof an OpenCV-driven document processing pipeline; (3) in-\ntegration of automated EnergyPlus simulations and location-\nspecific analyses; (4) a specialized report generation system\nusing RAG; and (5) demonstration of efficiency improvements\nthrough pilot project deployment.\nII. R ELATED WORK\nBuilding performance simulation and automated LEED as-\nsessment have been active research areas for over a decade.\nEarly efforts focused on BIM-based approaches for automating\nspecific LEED credits [8]. These systems typically extracted\ngeometric and material properties from BIM models to eval-\nuate energy-related credits but struggled with comprehensive\nmulti-credit analysis.\nRecent advances in machine learning have enabled more\nsophisticated approaches. Jiang et al. [10] developed EPlus-\nLLM, demonstrating the potential of large language models\nfor building energy modeling. Their work showed promising\nresults in automated IDF file generation, though it focused pri-\nmarily on energy modeling rather than comprehensive LEED\ncompliance.\nDocument processing in the AEC industry has evolved\nsignificantly with computer vision advances. Kim et al. [11]\npresented methods for extracting information from construc-\ntion drawings using deep learning, while Ajayi et al. [12] pro-\nvided a comprehensive review of automation in construction\ndocumentation.\n--- Page 2 ---\nSeveral commercial platforms have attempted LEED au-\ntomation, but most focus on specific credit categories or\nrequire extensive manual data entry. The gap between com-\nprehensive automation and practical deployment remains sig-\nnificant. Our work addresses this gap by providing an end-to-\nend platform that combines multiple technologies in a unified\nworkflow.\nThe emergence of retrieval-augmented generation has\nopened new possibilities for technical documentation [13].\nHowever, application to domain-specific compliance documen-\ntation, particularly in the building industry, remains largely\nunexplored. Our work contributes to this emerging field by\ndemonstrating practical RAG implementation for LEED certi-\nfication.\nIII. S YSTEM ARCHITECTURE\nThe platform follows a layered design with structured data\nflow from user input to final report generation (Fig. 1). The\narchitecture prioritizes modularity, scalability, and maintain-\nability through clear separation of concerns.\nA. Presentation Layer\nThe Presentation Layer consists of a desktop User Inter-\nface built with PySide6 (Qt for Python). This choice provides\ncross-platform compatibility and native performance for com-\nputationally intensive operations. The UI allows users to input\nbuilding data including BIM models, design parameters, site\ninformation, and project specifications. It also provides real-\ntime feedback on analysis progress and displays generated\noutputs for review and editing.\nB. Orchestration Layer\nThe Orchestration Layer centers on the Review Manager,\nwhich coordinates the end-to-end workflow. This component\nserves as the system’s control logic, triggering analysis mod-\nules in appropriate sequence, managing data exchange between\ncomponents, and maintaining process state throughout exe-\ncution. The orchestrator implements a pipeline pattern that\nallows for parallel execution of independent analysis tasks\nwhile managing dependencies between related operations.\nC. Analysis Layer\nThe Analysis Layer comprises four specialized modules\noperating in coordination:\nThe Document Processing Pipeline handles ingestion and\nanalysis of project documents including drawings, specifica-\ntions, and material certificates. It employs computer vision\ntechniques for data extraction and optical character recognition\nfor text processing.\nTheLEED Credit Analysis Module implements rule-based\nevaluation of project data against specific LEED credit require-\nments. This module encodes the logic and calculations for\nvarious LEED credits, automatically determining compliance\nstatus and identifying areas requiring attention.\nTheEnergy Modeling Module integrates with EnergyPlus,\nthe building energy simulation engine developed by the U.S.Department of Energy [14]. This module automates generation\nof EnergyPlus input files and manages simulation execution,\nenabling high-fidelity analysis of building energy performance\ncritical for multiple LEED credits.\nThe Location-Based Analysis Module utilizes GIS data\nand external APIs to assess credits related to site selec-\ntion, transportation access, and environmental context. This\nincludes proximity analysis for public transit, walkability\nmetrics, and sensitive land identification.\nD. Data Management and Integration\nThe orchestrator aggregates results from all analysis mod-\nules into a unified data store, implemented using a structured\nJSON schema that maintains relationships between different\ndata types. This design enables efficient querying and supports\nthe modular architecture by providing a common data interface\nfor all components.\nThe modular design facilitates system extension, allowing\nfuture addition of new analysis components such as Life\nCycle Assessment modules without requiring changes to the\ncore architecture. Each module operates independently while\nsharing data through well-defined interfaces.\nIV. I MPLEMENTATION DETAILS\nThe detailed implementation architecture (Fig. 2) illustrates\ncomprehensive interconnections between system components\nand specific data processing workflows employed in the plat-\nform.\nA. Document Processing Pipeline\nThe document preprocessing pipeline employs a multi-stage\napproach to handle diverse formats and quality variations\ncommon in architectural and construction documents.\n1) Document Normalization and Enhancement: Input doc-\numents undergo initial preprocessing to standardize format and\nresolution. PDF documents are rendered at high resolution\n(600 DPI) and converted to grayscale to reduce computational\ncomplexity while preserving essential detail. The enhance-\nment process includes adaptive thresholding with configurable\nparameters, Gaussian blur filtering for noise reduction, and\nmorphological operations to remove artifacts such as hatching\npatterns commonly found in architectural drawings.\n2) Text Region Detection and OCR: Text regions are iden-\ntified using edge detection combined with contour analysis.\nThe Canny edge detector identifies potential text boundaries,\nfollowed by connected component analysis that filters can-\ndidates based on geometric properties. The pipeline includes\nspecialized processing for architectural documents, including\nhatching removal, line art preservation, and multi-language\nsupport for Korean and English text recognition.\nB. Energy Modeling Integration\nThe energy modeling component leverages an extractor-\nbased approach to bridge the gap between user input data and\nEnergyPlus simulation requirements.\n--- Page 3 ---\nFig. 1. High-level architecture overview of the LEED automation platform.\nFig. 2. Detailed system architecture showing all components and data flows between layers.\n1) Data Extraction Framework: The system employs spe-\ncialized extractors that parse building information from mul-\ntiple input sources. Geometric extractors process BIM data to\nextract zone definitions and building envelope properties. Sys-\ntem extractors parse HV AC specifications and equipment datato generate appropriate EnergyPlus objects. Schedule extrac-\ntors convert occupancy patterns into EnergyPlus-compatible\ntime series data.\n2) IDF Generation and Validation: The extractor frame-\nwork generates IDF files through a systematic process ensuring\n--- Page 4 ---\ncompatibility and accuracy. Each extractor module handles\nspecific building systems independently, allowing modular\nupdates and maintenance. Generated IDF files undergo val-\nidation checks to ensure physical consistency and simulation\nreadiness.\nC. LLM-RAG Implementation\nThe report generation system combines the Gemma3-4B\nlarge language model with retrieval-augmented generation\nto produce factual, contextually relevant documentation. The\nsystem operates entirely on local infrastructure to ensure data\nprivacy and reduce operational costs.\n1) Knowledge Base Construction: The RAG system main-\ntains a domain-specific knowledge base containing LEED\nreference guides, USGBC credit language, relevant building\ncodes, and project-specific data from analysis modules. Docu-\nments are processed using a metadata-aligned chunking strat-\negy rather than naive sentence-level splits, segmenting LEED\ndocumentation by credit unit (e.g., ”EA Credit: Optimize\nEnergy Performance”) to align with the inherent structure of\nLEED reference materials.\n2) Vector Storage and Retrieval Architecture: Each chunk\nis tagged with metadata including credit category, name, point\nvalue, and type (Prerequisite or Credit), enabling efficient\nvector indexing using FAISS (Facebook AI Similarity Search)\nfor approximate nearest neighbor search. The embedding gen-\neration employs pre-trained sentence transformers optimized\nfor technical document processing. This metadata alignment\nensures that prompts for specific credits retrieve only the most\nrelevant and contextually accurate documentation.\n3) Generation Process and Model Configuration: When\ngenerating reports for specific credits, the system queries\nthe FAISS index to retrieve relevant text snippets based on\nsemantic similarity. These snippets are inserted into structured\nprompts for the locally deployed Gemma3-4B model, ensuring\nthe model’s output is informed by authoritative sources and\nproject-specific results. The generation process includes post-\nprocessing verification to cross-check numerical values and\nclaims against source data.\nD. Performance Optimization\nSystem performance optimization focuses on resource man-\nagement and processing efficiency to ensure reliable operation\nin production environments.\n1) Memory Management and Parallel Processing: The\nimplementation employs conservative memory allocation prac-\ntices, maintaining usage below 70% of available system\nmemory. Independent analysis modules execute concurrently\nwhere dependencies permit, with resource pooling to share\ncomputational resources efficiently across multiple tasks.\n2) Error Handling and Recovery: Robust error handling\nmechanisms ensure system reliability during extended process-\ning sessions. Each module implements graceful degradation\nstrategies, allowing partial results when complete analysis is\nnot possible. Automatic retry mechanisms handle transient\nfailures, while comprehensive logging enables debugging and\nperformance analysis.V. E XPERIMENTAL SETUP\nThe platform evaluation was conducted using a represen-\ntative commercial office building project pursuing LEED v4\nBD+C certification. The test building is a six-story, 75,000\nsquare foot office complex located in a mixed-use urban\ndistrict.\nA. Test Environment and Configuration\nThe system was deployed on a workstation with Intel Core\ni7-12700K processor, 32GB RAM, and NVIDIA RTX 3070\nGPU. The software environment included Python 3.9, OpenCV\n4.7, EnergyPlus 23.1, and local deployment of Gemma3-\n7B model. Processing was conducted using the building’s\nactual project documentation, including architectural drawings,\nmechanical specifications, and material schedules.\nB. Evaluation Metrics\nPerformance was measured across three dimensions: au-\ntomation coverage (percentage of credits processed with-\nout manual intervention), accuracy (agreement with expert-\ngenerated analyses), and efficiency (time reduction compared\nto manual workflows). Baseline comparisons were established\nusing documentation prepared by an experienced LEED con-\nsultant following standard industry practices.\nC. Data Collection and Validation\nThe evaluation process involved processing 49 potentially\nachievable LEED credits across all credit categories. Each\nautomated analysis was cross-verified against manual cal-\nculations performed by certified professionals. Energy mod-\neling results were validated using independently developed\nEnergyPlus models, with particular attention to thermal zone\ndefinitions, HV AC system modeling, and load calculations.\nVI. R ESULTS AND DISCUSSION\nThe platform successfully automated analysis and documen-\ntation for approximately 82% of targeted credits (40 out of\n49 achievable points), demonstrating significant potential for\nstreamlining LEED certification workflows.\nA. Automation Coverage and Accuracy\nCredits related to energy and water efficiency, materials\nand resources, and indoor environmental quality achieved the\nhighest automation rates, with 90-95% of requirements pro-\ncessed without manual intervention. Location and transporta-\ntion credits achieved 75% automation, limited primarily by\nthe need for site-specific qualitative assessments. Innovation\ncredits required extensive manual input, as expected given their\nqualitative nature.\nThe automated EnergyPlus simulation produced energy\nuse intensity predictions within 5% of models created by\nexperienced consultants, demonstrating the viability of the\nautomated modeling workflow. Document processing achieved\n94% accuracy in text extraction from technical drawings, with\nremaining errors primarily related to hand-written annotations\nand non-standard formatting.\n--- Page 5 ---\nB. Efficiency Improvements\nGeneration of a comprehensive draft report required ap-\nproximately 3 hours of computation and 30 minutes of hu-\nman review, representing a 60-70% reduction in person-hours\ncompared to traditional manual documentation processes. The\nplatform provided proactive compliance feedback, enabling\nreal-time design optimization rather than reactive end-stage\ncorrections.\nEnergy simulation workflows showed the most dramatic\nimprovements, reducing modeling time from 2-3 weeks to\nunder 4 hours including validation. Document processing elim-\ninated manual data entry for building specifications, reducing\ntranscription errors and associated rework cycles.\nC. System Reliability and User Experience\nThe RAG-based report generation consistently produced\nfactually accurate narratives that met LEED submission stan-\ndards. Cross-verification revealed no critical errors such as\nincorrectly claimed credits, though minor stylistic adjustments\nwere occasionally required. The modular architecture demon-\nstrated robust error handling, with individual module failures\nnot affecting overall system operation.\nUser feedback highlighted the value of real-time compliance\nmonitoring and the ability to evaluate design alternatives\nrapidly. The systematic approach reduced risk of oversight\ncompared to manual processes, particularly for complex credit\ninteractions and prerequisite dependencies.\nD. Limitations and Areas for Improvement\nCurrent limitations include dependency on high-quality\ninput documents and the need for manual review of qual-\nitative credit aspects. The system performs optimally with\nstandardized document formats and may require additional\npreprocessing for legacy or non-standard documentation.\nFuture enhancements will focus on expanding the knowl-\nedge base, improving computer vision models for complex\ndocument types, and implementing more sophisticated feed-\nback mechanisms for continuous learning. Integration with ad-\nditional building performance tools and support for other green\nbuilding rating systems represent natural extension points.\nVII. C ONCLUSION\nThis paper presented an automated platform for LEED certi-\nfication that integrates computer vision, building performance\nsimulation, and large language model technologies in a unified\nworkflow. The system demonstrated significant improvements\nin efficiency and accuracy compared to traditional manual\nprocesses, achieving 82% automation coverage with 60-70%\nreduction in documentation time.\nThe modular architecture enables scalability and adaptation\nto other green building rating systems. The successful inte-\ngration of RAG with domain-specific knowledge bases shows\npromise for technical documentation automation in specialized\nfields. The platform represents a practical advance toward\ncomprehensive automation of complex compliance processes\nin the building industry.The primary contribution is demonstration of a holistic, end-\nto-end automated system for real-world LEED certification.\nFuture work will involve expanded validation across diverse\nproject types and integration of additional analysis capabilities.\nThe approach established here provides a foundation for\nbroader automation of technical compliance processes in the\narchitecture, engineering, and construction industry.\nREFERENCES\n[1] U.S. Green Building Council, “LEED v4 for Building Design and\nConstruction,” 2023. [Online]. Available: https://www.usgbc.org/leed/v4\n[2] P. Wu, Y . Wang, and X. Wang, “A critical review of the research on the\nmanagement of sustainable building technologies,” Journal of Cleaner\nProduction , vol. 156, pp. 290-302, Jul. 2019.\n[3] M. A. Asl, M. Zarrin, and H. R. Tavakol, “Barriers to implementation\nof LEED-certified projects in the construction industry,” Journal of\nBuilding Engineering , vol. 27, Art. no. 100989, Jan. 2020.\n[4] Y . B. Choi and J. H. Oum, “A Study on the Improvement of the\nLEED Certification Process through Case Analysis,” Journal of the\nArchitectural Institute of Korea Structure & Construction , vol. 35, no.\n1, pp. 67-74, Jan. 2019.\n[5] Y . Lu, Y . Li, M. Skibniewski, Z. Wu, and R. Wang, “Artificial intel-\nligence for the architecture, engineering, and construction industry: A\nreview and future research directions,” Automation in Construction , vol.\n131, Art. no. 103857, Nov. 2021.\n[6] V . Shashank and M. Santosh, “Reimagining Green Building Certifica-\ntion: The AI Powered Approach,” People+AI Blog , Jun. 2024.\n[7] AvantLeap, “Achieving LEED Compliance with AI: The Future of Smart\nCertification by 2025,” AvantLeap Insights , 2025.\n[8] S. T. Ng, M. J. Kim, and S. M. E. Rahman, “A BIM-based framework for\nautomated evaluation of LEED prerequisites and credits,” Automation in\nConstruction , vol. 84, pp. 11-23, Dec. 2017.\n[9] A. M. H. Al-khella, A. T. Al-Samari, and H. S. Al-Obaidi, “The\nimpact of building design parameters on energy consumption: A review,”\nJournal of Building Engineering , vol. 44, Art. no. 103251, Dec. 2021.\n[10] G. Jiang et al., “EPlus-LLM: A large language model-based computing\nplatform for automated building energy modeling,” Applied Energy , vol.\n367, Art. no. 123431, 2024.\n[11] S. Kim, J. Lee, and H. Sohn, “Automated information extraction from\nconstruction drawings using deep learning,” Journal of Computing in\nCivil Engineering , vol. 34, no. 5, Art. no. 04020035, Sep. 2020.\n[12] S. A. Ajayi, L. O. Oyedele, and M. O. O. Akintoye, “Harnessing\nthe power of AI for automating construction project documentation: A\nsystematic review,” Journal of Information Technology in Construction ,\nvol. 25, pp. 276-296, 2020.\n[13] P. S. Lewis et al., “Retrieval-Augmented Generation for Knowledge-\nIntensive NLP Tasks,” in Proc. NeurIPS 33 , 2020, pp. 9459–9474.\n[14] U.S. Department of Energy, “EnergyPlus Engineering Reference,” 2023.\n[Online]. Available: https://energyplus.net/\n[15] R. G. Smith, “An overview of the Tesseract OCR engine,” in Proc. Ninth\nInternational Conference on Document Analysis and Recognition , 2007,\nvol. 2, pp. 629-633.\n[16] Q. V . Le, T. H. Nguyen, and M. H. Lim, “A deep learning-based ap-\nproach for parsing architectural floor plans,” Automation in Construction ,\nvol. 139, Art. no. 104285, Jul. 2022.\n[17] J. M. S. de Oliveira, R. Z. Freire, and L. R. H. de Souza, “Eppy:\nA Python package for building energy simulation with EnergyPlus,”\nJournal of Open Source Software , vol. 4, no. 40, p. 1537, Aug. 2019.\n[18] J. H. Lee and S. W. Kim, “GIS-based decision support system for\nsustainable site selection in urban planning,” Environment and Planning\nB: Urban Analytics and City Science , vol. 46, no. 8, pp. 1526-1543,\n2019.\n[19] Google AI, “Gemma: Open Models by Google,” 2024. [Online]. Avail-\nable: https://ai.google.dev/gemma\n[20] T. L. Shuster, S. Roller, Y . Adi, J. Weston, and N. A. Smith, “Retrieval\naugmentation reduces hallucination in conversation,” in Findings of\nEMNLP 2021 , 2021, pp. 3733–3749.\n[21] R. Gao, X. Lin, Z. Dai, and P. J. Liu, “Rethinking retrieval for RAG\nmodels,” arXiv preprint arXiv:2310.00184 , 2023.\n[22] A. Amershi et al., “Guidelines for human-AI interaction,” in Proc. 2019\nCHI Conference on Human Factors in Computing Systems , 2019, pp.\n1-13.\n--- Page 6 ---\n[23] D. J. Kim, J. H. Park, and S. Y . Lee, “Exploring the future roles of\narchitects in the age of AI: A focus on building design,” Frontiers of\nArchitectural Research , vol. 10, no. 3, pp. 496-508, Sep. 2021.",
  "text_length": 24265
}