{
  "id": "http://arxiv.org/abs/2506.02051v1",
  "title": "Phenotypic Profile-Informed Generation of Drug-Like Molecules via\n  Dual-Channel Variational Autoencoders",
  "summary": "The de novo generation of drug-like molecules capable of inducing desirable\nphenotypic changes is receiving increasing attention. However, previous methods\npredominantly rely on expression profiles to guide molecule generation, but\noverlook the perturbative effect of the molecules on cellular contexts. To\novercome this limitation, we propose SmilesGEN, a novel generative model based\non variational autoencoder (VAE) architecture to generate molecules with\npotential therapeutic effects. SmilesGEN integrates a pre-trained drug VAE\n(SmilesNet) with an expression profile VAE (ProfileNet), jointly modeling the\ninterplay between drug perturbations and transcriptional responses in a common\nlatent space. Specifically, ProfileNet is imposed to reconstruct pre-treatment\nexpression profiles when eliminating drug-induced perturbations in the latent\nspace, while SmilesNet is informed by desired expression profiles to generate\ndrug-like molecules. Our empirical experiments demonstrate that SmilesGEN\noutperforms current state-of-the-art models in generating molecules with higher\ndegree of validity, uniqueness, novelty, as well as higher Tanimoto similarity\nto known ligands targeting the relevant proteins. Moreover, we evaluate\nSmilesGEN for scaffold-based molecule optimization and generation of\ntherapeutic agents, and confirmed its superior performance in generating\nmolecules with higher similarity to approved drugs. SmilesGEN establishes a\nrobust framework that leverages gene signatures to generate drug-like molecules\nthat hold promising potential to induce desirable cellular phenotypic changes.",
  "authors": [
    "Hui Liu",
    "Shiye Tian",
    "Xuejun Liu"
  ],
  "published": "2025-06-01T07:46:39Z",
  "updated": "2025-06-01T07:46:39Z",
  "categories": [
    "q-bio.BM",
    "cs.AI",
    "cs.LG"
  ],
  "pdf_url": "http://arxiv.org/pdf/2506.02051v1",
  "full_text": "--- Page 1 ---\narXiv:2506.02051v1  [q-bio.BM]  1 Jun 2025Phenotypic Profile-Informed Generation of Drug-Like Molecules via\nDual-Channel Variational Autoencoders\nHui Liu ,Shiye Tian ,Xuejun Liu∗\nCollege of Computer and Information Engineering, Nanjing Tech University, Nanjing, 211800, China.\n{hliu, xjliu }@njtech.edu.cn,\nAbstract\nThe de novo generation of drug-like molecules ca-\npable of inducing desirable phenotypic changes\nis receiving increasing attention. However, pre-\nvious methods predominantly rely on expression\nprofiles to guide molecule generation, but over-\nlook the perturbative effect of the molecules on\ncellular contexts. To overcome this limitation,\nwe propose SmilesGEN, a novel generative model\nbased on variational autoencoder (V AE) architec-\nture to generate molecules with potential therapeu-\ntic effects. SmilesGEN integrates a pre-trained\ndrug V AE (SmilesNet) with an expression profile\nV AE (ProfileNet), jointly modeling the interplay\nbetween drug perturbations and transcriptional re-\nsponses in a common latent space. Specifically,\nProfileNet is imposed to reconstruct pre-treatment\nexpression profiles when eliminating drug-induced\nperturbations in the latent space, while SmilesNet\nis informed by desired expression profiles to gener-\nate drug-like molecules. Our empirical experiments\ndemonstrate that SmilesGEN outperforms current\nstate-of-the-art models in generating molecules\nwith higher degree of validity, uniqueness, novelty,\nas well as higher Tanimoto similarity to known lig-\nands targeting the relevant proteins. Moreover, we\nevaluate SmilesGEN for scaffold-based molecule\noptimization and generation of therapeutic agents,\nand confirmed its superior performance in gener-\nating molecules with higher similarity to approved\ndrugs. SmilesGEN establishes a robust framework\nthat leverages gene signatures to generate drug-\nlike molecules that hold promising potential to in-\nduce desirable cellular phenotypic changes. The\nsource code and datasets are available at: https:\n//github.com/hliulab/SmilesGEN.\n1 Introduction\nIn the realm of drug discovery, target-based drug design\n(TDD) has emerged as the dominant strategy over the past\nfew decades, driven by advancements in molecular biology\nand proteomics [Swinney and Anthony, 2011; Attwood etal., 2021 ]. TDD is centered on the identification and valida-\ntion of specific molecular targets-typically proteins or RNAs-\nthat play a critical role in disease processes [Munson et al. ,\n2024 ]. Once a target is confirmed, compounds are designed\nor screened based on their ability to interact with the target in\na manner that modulates its activity, thereby leading to ther-\napeutic benefits [Meissner et al. , 2022 ]. However, the pro-\ncess of molecular target validation is inherently intricate and\nresource-intensive, which result in a narrow focus on well-\ncharacterized targets [Vincent et al. , 2022 ]. Additionally,\nTDD is vulnerable to off-target effects, where drugs inter-\nact with unintended targets, potentially causing unpredictable\nand sometimes severe side effects [Sadri, 2023 ].\nIn contrast, phenotypic drug discovery (PDD) adopts a dif-\nferent approach by concentrating on the observable effects\nof compounds on disease-relevant biological systems [Berg,\n2021; Vincent et al. , 2022; Moffat et al. , 2017 ]. In fact,\nPDD has a long and established history, with many new\ndrugs identified based on the observed therapeutic effects\non disease phenotypes [Vincent et al. , 2022 ]. A major ad-\nvantage of PDD is that it does not require prior knowl-\nedge of specific drug targets, making it particularly advan-\ntageous in cases where the underlying molecular mechanism\nof a disease is not well understood [Moffat et al. , 2017;\nMeissner et al. , 2022 ]. However, the absence of a well-\ndefined molecular target in phenotypic drug discovery poses\nsignificant challenges on refining the chemical structure of\nlead compounds to optimize their efficacy, safety, and drug-\nlike properties. A promising strategy to overcome these chal-\nlenges involves leveraging transcriptional response as indi-\ncators of phenotypic changes to guide the drug design and\noptimization process [Malandraki-Miller and Riley, 2021 ].\nExpression profiles provide a detailed, high-resolution snap-\nshot of how a compound influences cellular pathways and\nprocesses, offering a molecule-level understanding of the ob-\nserved phenotypic outcomes. By comparing the expression\nprofiles of treated and untreated cells, researchers can identify\npotential drug candidates that elicit desired phenotypic shifts.\nTherefore, expression profiles can serve as phenotypic signa-\ntures in the discovery process. Thereafter, the terms “expres-\nsion profile” and “phenotypic profile” are used interchange-\nably in this study.\nSeveral large-scale assays have been conducted to mea-\nsure a wealth of drug-induced transcriptional responses in\n--- Page 2 ---\nvitro. For example, the L1000 platform [Subramanian et\nal., 2017 ]offers a cost-effective, high-throughput method\nfor generating expression profiles subjected to drug perturba-\ntions. Based on such data resource, deep generative models,\nsuch as generative adversarial networks (GANs) [Goodfellow\net al. , 2014 ]and variational autoencoders (V AEs) [Kingma\nand Welling, 2013 ], have been proposed to design molecules\nwith potential to elicit intended bioactivity [Malandraki-\nMiller and Riley, 2021 ]. However, existing approaches gen-\nerate molecules without considering the cellular context rele-\nvant to specific disease. To guide drug discovery using phe-\nnotypic profile, several methods have been developed to uti-\nlize drug-induced expression profiles as conditional variables\nfor molecular generation. These methods include Expres-\nsionGAN [M´endez-Lucio et al. , 2020 ], TRIOMPHE [Kaitoh\nand Yamanishi, 2021 ], GxV AEs [Li and Yamanishi, 2024 ],\nand Gex2SGen [Das et al. , 2023 ]. Despite their advance-\nment, these phenotype-based methods have two primary lim-\nitations. First, they rely exclusively on post-treatment expres-\nsion profiles to guide drug generation, neglecting the change\nof expression profiles induced by drug perturbations. Second,\nthey do not model the interplay between molecules and cel-\nlular environment, which is crucial for generating molecules\nwith potential to induce desired phenotypic changes.\nTo address these issues, we propose SmilesGEN, a novel\ndeep generative framework designed for de novo generation\nof drug-like molecules. SmilesGEN uniquely integrates drug-\ninduced gene expression changes with phenotype-informed\nmolecule generation within a unified framework. Unlike\nprevious approaches, SmilesGEN uses dual-channel vari-\national autoencoders to explicitly model the interplay be-\ntween molecules and cellular environment. By mapping\nboth molecules and expression profiles to a common latent\nspace, the drug-induced phenotypic changes can be straight-\nforwardly formulated. SmilesGEN is designed to satisfy\ntwo critical constraints. First, by mitigating the disturba-\ntive effects of molecules on post-treatment phenotypic pro-\nfiles, SmilesGEN aims to restore the pre-treatment cellular\nstate. Second, when conditioned on desired phenotypic pro-\nfiles, SmilesGEN is engineered to generate molecules with\npotential to induce such phenotypic outcomes. Extensive\nexperiments demonstrate that SmilesGEN outperforms cur-\nrent state-of-the-art methods, generating molecules with po-\ntential bioactivity and desirable drug-like properties. By es-\ntablishing the link between molecule generation and cellular\ncontext, SmilesGEN effectively increases the likelihood of\ngenerating molecules that interact productively with disease-\nassociated cellular machinery.\nThe main contributions of this study are summarized as\nbelow:\n•Phenotype-informed de novo molecule genera-\ntion: Unlike previous methods designed to generate\nmolecules with proper physicochemical property, this\nstudy aims to generate molecules that potentially elicit\ndesirable phenotypic outcomes.\n•Explicit formalization of drug perturbative effect on\nphenotypic change : this study explicitly formalizes the\nphenotypic change to capture the net effect of the drugperturbation, enabling to extract more informative fea-\ntures for molecular generation.\n•Superior performance over state-of-the-art (SOTA)\nmethods : Extensive experiments demonstrate that our\nmethod outperforms two baselines and five previous\nmethods, and generates therapeutic molecules with\nchemical structures highly similar to those of known lig-\nands.\n2 Related Work\n2.1 De Novo Drug Generation\nSome generative models have been employed to design\nnovel molecular structures, aiming to explore chemical space\nand generate molecules with both novelty and chemical va-\nlidity. These approaches often utilize Simplified Molec-\nular Input Line Entry System (SMILES) strings as input,\nwhich are well-suited for generative models like recurrent\nneural networks [Segler et al. , 2018; Merk et al. , 2018 ],\nV AEs [G´omez-Bombarelli et al. , 2018; Blaschke et al. , 2018;\nZhang and Chen, 2022 ], and Transformers [Wang et al. ,\n2022; Dollar et al. , 2021 ]. Attention-based models lever-\nage attention mechanisms to learn the “molecular grammar”\nfrom SMILES strings, enabling the generation of coherent\nmolecular sequences. Despite the advantages of compact\nand standardized representation provided by SMILES, these\nmethods often produce invalid molecular structures, as the\nstringed representation of SMILES does not always guar-\nantee chemical validity. So, some methods employ Graph\nNeural Networks (GNNs) to represent and generate molec-\nular structures [De Cao and Kipf, 2018; Li et al. , 2018;\nJinet al. , 2020 ], in order to capture the chemical structure\nof molecules. In addition, reinforcement learning techniques\nhave been incorporated into some methods to optimize the\nstructures of generated molecules [Zhavoronkov et al. , 2019;\nPopova et al. , 2018 ].\n2.2 Drug Generation from Expression Profile\nWith the advancement of RNA sequencing technology, the\ngeneration of large-scale multi-omics data has enabled re-\nsearchers to integrate omics data into generative models\nfor the design of de novo molecules. For instance, TRI-\nOMPHE [Kaitoh and Yamanishi, 2021 ]employed a varia-\ntional autoencoder framework conditioned on e n profiles\nto generate molecules. Gex2SGen [Das et al. , 2023 ]and\nGxV AEs [Li and Yamanishi, 2024 ]followed similar ideas\nthat used the desired expression profiles as input to design\ndrug-like molecules capable of eliciting phenotypic changes.\nMendez-Lucio et al. [M´endez-Lucio et al. , 2020 ]further\nemployed a generative adversarial network (GAN) in con-\njunction with expression profiles to automatically design\nmolecules with a high probability to induce therapeutic ef-\nfects. Although the integration of transcriptomic profiles into\ngenerative models marks a significant advancement, these\nmethods overlook the interplay between drug molecules and\ncellular context.\n--- Page 3 ---\n-\nPost-treatment \nexpression profile Latent Space ProfileNet \nEncoderProfileNet \nDecoder\nSmilesNet \nEncoderSmilesNet \nDecoderC1=CC=C(C=C1)\nNC(=O)C2=NNC3\n=CC=CC=C32\nReconstructed pre-treatment profile\nConditional profile \nReconstructed post-treatment profile\nMolecule-induced+\nC1=CC=C(C=C1)\nNC(=O)C2=NNC3\n=CC=CC=C32\nCanonical moleculeReconstruted \nmole\nculeFigure 1: SmilesGEN framework comprises two interacting variational autoencoders, SmilesNet and ProfileNet, which work jointly to extract\nfeatures from molecules and phenotypic profiles and reconstruct molecules and post-treatment signatures, as well as pre-treatment signatures.\n3 Methods\n3.1 SimlesGEN Framework\nThe proposed SmilesGEN framework comprises dual-\nchannel V AEs: a molecule V AE (SmilesNet) and an ex-\npression profile V AE (ProfileNet). As shown in Figure 1,\nSmilesNet is a V AE [Chung et al. , 2014 ]that utilizes gated\nrecurrent unit (GRU) backbone for the encoding and genera-\ntion of molecules. SmilesNet is pretrained on a large-scale\nSMILES descriptors, enabling it to explore the extensive\nchemical space and generate meaningful molecular struc-\ntures. ProfileNet is another V AE composed of multiple feed-\nforward layers to encode and decode expression profiles. A\nkey feature of ProfileNet is to explicitly formalize the net ef-\nfect of drug perturbations on cellular state in the latent space,\nby enforcing the constraint that the encoded post-treatment\nexpression profile, when adjusted by the molecular represen-\ntation, should restore the corresponding pre-treatment expres-\nsion profile. Conceptually, this formalization simulates the\ntherapeutic effects in a reverse direction that removal of drug\ntreatment allows the cellular environment to revert to its un-\nperturbed state. By modeling the dynamic interplay between\nmolecules and cellular environments, our model enhances\nits capacity to learn informative and expressive features re-\nlated to both molecule structures and their induced pheno-\ntypic changes. Once trained, the encoded expression pro-\nfiles are fed into the SmilesNet decoder to generate molecules\nwith a high likelihood of eliciting the desired phenotypic out-\ncomes.\n3.2 Drug Variational Autoencoder\nThe molecules are represented using SMILES strings, a com-\npact and standardized notation for describing molecular struc-\ntures. Let a molecule Sbe denoted by a string S=\n[s1, s2,···, sn], in which each character corresponds to an\natom or a chemical bond. Suppose the posterior distributionlearned by SmilesNet encoder is denoted as qϕ(Zs|S)that\nis approximate to a normal distribution N(µs,σs), where\nµsandσsdenote the mean and standard deviation. A la-\ntent variable Zsis sampled from qϕ(Zs|S)and then used\nto reconstruct the molecule Sfollowing a stochastic process\nS∼pφ(S|Z)parameterized by φ:\npφ(S|Zs, Zx) =nY\ni=1pφ(si|s1:i−1, Zs, Zx). (1)\nin which Zxrepresents the conditional variable drawn from\nthe probability distribution learned from drug-induced phe-\nnotypic profiles (see below). During the pre-training phase,\nZxin is substituted with Zs. SmilesNet tries to maximize the\nlower bound of the true log-marginal likelihood as follows:\nLS(ϕ, φ) =EZs∼qϕ(Zs|S)(logpφ(S|Zs, Zx))\n−DKL(qϕ(Zs|S)||pφ(Zs))(2)\nwhere E(·)is an expectation operation, ϕandφdenote the pa-\nrameters of the SmilesNet encoder and decoder, respectively.\n3.3 Profile Variational Autoencoder\nDenote the post-treatment expression profile by X=\n(x1, x2,···, xm), where each element represents the expres-\nsion levels of a gene when subjected to a molecule. Simi-\nlarly, denote by Y= (y1, y2,···, ym)the pre-treatment ex-\npression profile of corresponding genes. Suppose the pos-\nterior distribution learned by ProfileNet encoder is denoted\nasqθ(Zx|X)that is approximate to a normal distribution\nN(µx,σx), where µxandσxdenote the mean and stan-\ndard deviation. From the posterior distribution, a latent vari-\nableZxis sampled and taken as the conditional variable by\nProfileNet decoder to reconstruct Xfollowing a generative\nprocess X∼pψ(X|Zx). ProfileNet aims to maximize the\nmarginal likelihood to generate the expression profile from\n--- Page 4 ---\nthe generative process:\nLX(θ, ψ) =EZx∼qθ(Zx|X)(logpψ(X|Zx))\n−DKL(qθ(Zx|X)||pψ(Zx))(3)\nwhere θandψare actually the parameters of the ProfileNet\nencoder and decoder, respectively.\n3.4 Modeling Drug-Induced Phenotypic Change\nWe aim to explicitly formalize the impact of drugs on cellu-\nlar states within the latent space. Following the assumption\nof linear additivity that has been widely used in modeling\ncellular response to drug perturbations [Hetzel et al. , 2022;\nHuang and Liu, 2024 ], we assume that the linear subtraction\nof two random variables capture the data distribution of the\npre-treatment expression profiles (control state), when miti-\ngate the effect of drug perturbation from post-treatment ex-\npression profiles. As a result, we can draw samples from\nthe resulting random variable to reconstruct the pre-treatment\nexpression profile using the ProfileNet decoder. Denote the\nvariable Zyis approximated by the reparameterization trick:\nZy= (µx−µs) + (σx+σs)ϵ, (4)\nin which ϵis sampled from a standard normal distribution\nN(0,I). Following the same generative process pψ(·), we\nexpect to reconstruct the pre-treatment expression profile Y\nwhen conditioned on Zy. So, we define another loss function\nas below:\nLY(θ, ψ) =EZy∼N (µx−µs,σx+σs)(logpψ(Y|Zy))\n−DKL(qθ(Zy|X)||pψ(Zy))(5)\n3.5 Full Objective\nTaken together, we define the total loss function as below:\nL(ϕ, φ, θ, ψ ) =LS(ϕ, φ) +LX(θ, ψ) +LY(θ, ψ)(6)\nThe parameter are optimized by minimizing the total loss\nfunction. The training process of SmileGEN consists of\ntwo distinct stages. As outlined in Algorithm 1, the first\nstage involves pretraining SmilesNet on large-scale dataset\nof molecules. Once pretraining is completed, the encoder of\nSmilesNet is frozen. In subsequent training stage, the model\ntakes as input the drug S, its perturbed expression profile X,\nand unperturbed expression profile Yto reconstruct them.\nThe parameters are optimized by minimizing the objective\nloss function. After training, we retain the ProfileNet encoder\nand SmilesNet decoder to generate drug-like molecules from\nperturbed expression profiles.\nIn our practice, we employed the bidirectional GRUs as the\nbackbone of SmilesNet encoder and decoder. Both the en-\ncoder and decoder were composed of three hidden layers of\nsize 192. The ProfileNet encoder and decoder adopted multi-\nple forward-feed layers with sizes 512, 256, and 192, respec-\ntively. During the pretraining stage, SmilesNet was optimized\nusing the Adam optimizer with a learning rate of 5e-4 and a\ndropout rate of 0.1. The maximum length of the generated\nSMILES strings was restricted to 100 characters. In the sub-\nsequent training stage, both SmilesNet and ProfileNet were\noptimized using Adam optimizer with a reduced learning rateAlgorithm 1 Training Procedure of SmilesGEN.\nData: SMILES string S, drug-perturbed profiles X, unper-\nturbed profiles Y\n1:/*Pre-training of SmilesNet*/\n2:fori←1toSEpoch do\n3: Train SmilesNet to minimize Eq.(2).\n4: Update parameters φandϕ.\n5:end for\n6:Freeze SmilesNet encoder parameter ϕ.\n7:/*Joint Training of SmilesNet and ProfileNet*/\n8:forj←1toGEpochs do\n9: Train SmilesNet and ProfileNet to minimize Eq.(6).\n10: Update parameters θ,ψ, andφ.\n11:end for\nof 1e-4. The maximum epochs of the pre-training and training\nstages were set to 100 and 500, respectively. The batch size\nfor both stages was set at 64. SmilesGEN was implemented\nusing PyTorch 2.3.0. The training and all evaluation exper-\niments were conducted on a CentOS Linux 8.2.2004 (Core)\nsystem, equipped with a GeForce RTX 4090 GPU and 128GB\nof memory.\n4 Experiments\n4.1 Datasets\nFor performance evaluation, we used the expression profiles\ninduced by the genetic perturbation of 10 commonly tar-\nget genes associated with the treatment of prevalent cancers.\nAmong them, eight genes (AKT1, AKT2, AURKB, CTSK,\nEGFR, HDAC1, MTOR, and PIK3CA) were knockdown, and\ntwo genes (SMAD3 and TP53) were over-expressed by ge-\nnetic perturbations. To evaluate the generated molecules, we\nobtained inhibitors and agonists that have been confirmed\nto target these proteins from the Drug Target Commons\n(DTC) database [Tang et al. , 2018 ]. We compute the per-\nformance metrics between these inhibitors/agonists and gen-\nerated molecules.\nWe also utilized the expression profiles of cancer pa-\ntients from The Cancer Genome Atlas (TCGA) reposi-\ntory [Weinstein et al. , 2013 ]to guide the generation of ther-\napeutic molecules. Specifically, we extracted the disease-\nspecific expression profiles of three types of cancers: triple-\nnegative breast cancer (TNBC), colorectal cancer (CRC), and\nlung adenocarcinoma (LUAD). To evaluate the generated\nmolecules, we retrieved a list of drugs approved for treat-\nment of these cancers from DrugBank database [Wishart et\nal., 2006 ]. The generated molecules were then assessed based\non their structural similarity to the approved drugs, holding\nthe rationale that structurally similar molecules are likely to\nexhibit therapeutic effects against the diseases.\n4.2 Evaluation Metrics\nFor the generated molecules, we assessed their validity,\nuniqueness, novelty, and diversity. High validity and unique-\nness are indicators of an effective molecule generation pro-\ncess, while high novelty indicates the model is not overfitting\nto the training data. High diversity reflects the model’s ability\n--- Page 5 ---\nAKT1\nAKT2\nAURKB\nCTSK\nEGFR\nHDAC1\nMTOR\nPICK3CA\nSMAD3\nTP5301020304050Valid_Number\nAKT1\nAKT2\nAURKB\nCTSK\nEGFR\nHDAC1\nMTOR\nPICK3CA\nSMAD3\nTP5301020304050Novel_Number\nAKT1\nAKT2\nAURKB\nCTSK\nEGFR\nHDAC1\nMTOR\nPICK3CA\nSMAD3\nTP5301020304050Unique_NumberSmilesGEN GxVAEs BIAAE FAME TRIOMPHEFigure 2: Performance comparison in terms of validity, uniqueness and novelty of generated molecules by SmilesGEN and four competing\nmethods using the expression profiles induced by genetic perturbations.\nTarget Protein Euclidean Cosine ExpressionGAN TRIOMPHE BIAAE FAME GxV AEs SmilesGEN\nAKT1 0.35 0.18 0.32 0.23 0.43 0.44 0.66 0.98\nAKT2 0.36 0.33 0.29 0.50 0.42 0.55 0.38 0.81\nAURKB 0.29 0.34 0.36 0.25 0.43 0.55 0.50 0.63\nCTSK 0.18 0.29 0.31 0.32 0.37 0.43 0.41 0.51\nEGFR 0.26 0.26 0.30 0.47 0.47 0.76 0.58 0.81\nHDAC1 0.39 0.25 0.34 0.24 0.42 0.46 0.49 0.56\nMTOR 0.33 0.19 0.39 0.30 0.49 0.42 0.50 0.75\nPIK3CA 0.25 0.24 0.26 0.32 0.35 0.55 0.43 0.75\nSMAD3 0.44 0.32 0.44 0.38 0.45 0.52 0.51 0.76\nTP53 0.40 0.36 0.46 0.59 0.58 0.73 0.71 1.00\nTable 1: Comparison of highest Tanimoto coefficients achieved the SmilesGEN and seven competing methods\nto generate molecules beyond the molecules in training set.\nTo assess the drug-likeness of the generated molecules, we\nemployed the quantitative estimate of drug-likeness (QED)\nscore. Additionally, we evaluated the similarity between the\ngenerated molecules and known ligands of target proteins us-\ning Tanimoto similarity based on molecular fingerprints. This\nmultifaceted assessment ensures the effectiveness and appli-\ncability of our model in generating molecules with potential\ntherapeutic effect.\n4.3 Evaluation on Benchmark dataset\nTo validate the model’s capability to generate molecules\nbased on desired expression profiles, we conducted experi-\nments using the expression profile induced by genetic pertur-\nbations in the MCF7 cell line, a benchmark dataset that has\nbeen utilized in previous studies. Specifically, we used the\nknockdown-induced expression profiles of eight target genes\n(AKT1, AKT2, AURKB, CTSK, EGFR, HDAC1, MTOR,\nand PIK3CA) to generate inhibitors, and overexpression-\ninduced profiles of two target genes (SMAD3 and TP53) to\ngenerate agonists. We first conducted a comparative anal-\nysis of our model against four existing methods in terms\nof validity, uniqueness, and novelty metrics. The compet-\ning methods include GxV AEs [Li and Yamanishi, 2024 ], BI-\nAAE [Shayakhmetov et al. , 2020 ], FAME [Pham et al. , 2022 ]\nand TRIOMPHE [Kaitoh and Yamanishi, 2021 ]. As shown in\nFigure 2, the experimental results indicate that the molecules\ngenerated by our model achieved higher degree of validity,\nuniqueness, and novelty than four competing methods.Next, we evaluated the performance of SmilesGEN against\nseven existing models by assessing the Tanimoto coefficient\nbetween generated molecules and known ligands. To bench-\nmark our method, we included two baseline models based\non molecular similarity search (Euclidean and Cosine sim-\nilarity), alongside five other competing methods: Expres-\nsionGAN [M´endez-Lucio et al. , 2020 ], TRIOMPHE [Kaitoh\nand Yamanishi, 2021 ], BIAAE [Shayakhmetov et al. , 2020 ],\nFAME [Pham et al. , 2022 ], and GxV AEs [Li and Yamanishi,\n2024 ]. For each target gene, 50 molecules were generated\nusing each method, and the Tanimoto coefficients were com-\nputed between the generated molecules and the known lig-\nands specific to that target gene. The highest Tanimoto co-\nefficients for each method were reported, as shown in Ta-\nble 1. Notably, SmilesGEN consistently achieved signif-\nicantly higher Tanimoto coefficients compared to all other\nmethods. Although the current state-of-the-art model, Gx-\nV AEs, outperformed the other competing methods, its perfor-\nmance remained notably inferior to that of SmilesGEN. Fur-\nthermore, Figure S1 showcases the molecular structures with\nthe highest Tanimoto similarity to known ligands, as gener-\nated by SmilesGEN and five competing methods. Such visual\ncomparisons further underscore SmilesGEN’s superior abil-\nity to generate molecules with the highly similar structures to\nknown ligands.\nMoreover, we further evaluated the drug-likeness and di-\nversity of the molecules generated by SmilesGEN. For each\ntarget gene, we generated 1,000 candidate molecules and an-\nalyzed their physicochemical properties, including the quan-\n--- Page 6 ---\nAKT1 HDAC1Optimized Ligand Optimized Ligand\nAKT2 MTOR\nAURKB PIK3CA\nCTSK SMAD3\nEGFR TP53\ta)\nAKT1 CHEMBL86795\nLogP 1.56 SA 1.83\nQED 0.56 HBA 2\nMW 118.1 HBD 1SmilesGEN\n2.77 SA2.13\n0.49 HBA 3\n220.2 HBD 1HDAC1 CHEMBL16300\nLogP 0.81 SA 1.42\nQED 0.44 HBA 3\nMW 137.1 HBD 2SmilesGEN\n1.91 SA1.73\n0.44 HBA 4\n223.3 HBD 2\nAKT2 CHEMBL188048\nLogP 0.60 SA 2.69\nQED 0.64 HBA 7\nMW 216.2 HBD 2SmilesGEN\n4.09 SA2.11\n0.56 HBA 3\n287.4 HBD 0\nAURKB CHEMBL110381\nLogP 2.08 SA 1.87\nQED 0.56 HBA 3\nMW 196.2 HBD 1SmilesGEN\n3.23 SA2.00\n0.48 HBA 3\n246.3 HBD 1\nCTSK CHEMBL77456\nLogP 2.13 SA 2.19\nQED 0.66 HBA 3\nMW 184.2 HBD 0SmilesGEN\n4.09 SA1.95\n0.73 HBA 4\n294.4 HBD 0\nEGFR CHEMBL104468\nLogP 2.78 SA 2.27\nQED 0.64 HBA 4\nMW 281.3 HBD 0SmilesGEN\n3.30 SA2.19\n0.73 HBA 4\n307.3 HBD 0MTOR CHEMBL85443\nLogP 1.47 SA 1.92\nQED 0.66 HBA 3\nMW 145.2 HBD 1SmilesGEN\n1.87 SA2.51\n0.59 HBA 9\n349.4 HBD 2\nPIK3CA CHEMBL1817865\nLogP 0.54 SA 2.57\nQED 0.55 HBA 4\nMW 134.1 HBD 3SmilesGEN\n2.92 SA2.77\n0.52 HBA 7\n327.4 HBD 3\nSMAD3 CHEMBL1470679\nLogP 1.32 SA 2.25\nQED 0.69 HBA 3\nMW 176.6 HBD 1SmilesGEN\n3.04 SA 2.41\n0.86 HBA 3\n274.4 HBD 1\nTP53 CHEMBL1162293\nLogP 2.29 SA 1.79\nQED 0.58 HBA 1\nMW 161.1 HBD 2SmilesGEN\n3.21 SA2.07\n0.68 HBA 5\n276.2 HBD 1(b)Figure 3: Performance evaluation for scaffold-based molecule optimization. (a) Optimized molecules based on benzene ring toward specific\ngene targets and their nearest known ligands. (b) Comparison between optimized molecules and corresponding short-chain ligands.\ntitative estimate of drug-likeness (QED), logarithm of parti-\ntion coefficient (LogP), molecular weight (MW), hydrogen\nbond acceptor (HBA), and hydrogen bond donor (HBD). The\nkernel density distributions of these physicochemical prop-\nerties for both the generated molecules and the known lig-\nands are presented in Figure S2. The results revealed that\nthe QED distribution for our generated molecules exhibited\na peak around 0.7, while 90% known ligands displayed peak\nQED values below 0.55, implying the generated molecules\nhave higher degree of drug-likeness than known ligands. For\nother physicochemical metrics, the broader distribution range\nof the generated molecules compared to known ligands fur-\nther confirmed the better diversity achieved by our method.\nIn addition, we applied Lipinski’s Rule of Five (logP <10,\nmolecular weight <500, hydrogen bond donors <5, hydrogen\nbond acceptors <10) to filter the 1,000 generated molecules,\nand then computed the Tanimoto similarities between the\nfiltered molecules and known ligands. Table S1 showed\nthe details of generated molecules with Tanimoto similari-\nties exceeding 0.7. It is worth noting that among the re-\nfined molecules, more than 50% of the molecules generated\ntowards desired expression profiles induced by seven gene\nperturbations (AKT1, AURKB, EGFR, MTOR, PIK3CA,\nSMAD3, TP53) exhibited high similarity with known ligands\n(Tanimoto ≥0.7). We showcased the molecular structures of\nthe generated molecules with highest Tanimoto similarity to\nknown ligands (Figure S3). These findings provide strong\nevidence of our method’s capability to generate structurallydiverse molecules with high drug-likeness.\n4.4 Profile-Based Molecule Optimization\nMolecule optimization is another important task in drug dis-\ncovery, as it significantly contributes to improving thera-\npeutic efficacy and pharmacokinetic properties. For proof-\nof-concept purpose, we evaluate our model in optimiz-\ning benzene rings—one of the most common scaffolds in\ndrugs—towards active-like molecules, guided by the gene\nsignature induced by genetic perturbations. Specifically, the\nSMILES of benzene rings and desired expression profiles\nwere taken as input to generate molecular structures. Fig-\nure 3(a) presents the optimized molecules alongside their\nnearest known ligands. The results demonstrate that the gen-\nerated molecules not only effectively retained the benzene\nring scaffold, but also incorporated functional groups con-\ntaining atoms such as oxygen (O), nitrogen (N), sulfur (S),\nand fluorine (F), showcasing the model’s ability to enhance\nstructural diversity and functionality.\nFurthermore, we extended the optimization process to\nshort-chain ligands associated with specific target genes. Fig-\nure 3(b) presented the short-chain ligands alongside their op-\ntimized counterparts, as well as their physicochemical prop-\nerties, including LogP, QED, MW, SA, HBA, and HBD.\nWe found that the optimized molecules incorporated addi-\ntional benzene rings or functional groups, thereby expand-\ning the molecular structures while maintaining or improving\ntheir QED values relative to the original short-chain ligands.\n--- Page 7 ---\nTable 2: Comparison between approved drugs and generated molecules for three types of cancers\nTarget Protein Approved Drug Name Approved Molecule Generated Molecule Tanimoto\nTNBC Ribociclib\n 0.56\nCRC Cetuximab\n 0.50\nLUAD Alectinib\n 0.98\nMeanwhile, other physicochemical properties were enhanced\nto varying degrees. These findings highlight the strong capa-\nbility of our model in molecular optimization, offering robust\nsupport for drug design and development.\n4.5 Therapeutic Molecule Generation\nWe further applied SmilesGEN to design therapeutic\nmolecules for triple-negative breast cancer (TNBC), colorec-\ntal cancer (CRC), and lung adenocarcinoma (LUAD). These\ncancers are all characterized as malignant tumors, and a\nsignificant proportion of patients either do not respond to\napproved drugs or develop resistance over time. We ob-\ntained the expression profiles of patients with these cancers\nfrom The Cancer Genome Atlas (TCGA). Given the rationale\nthat molecules capable of reversing disease-specific expres-\nsion profiles might possess therapeutic potential [Tong et al. ,\n2023; Yamanaka et al. , 2023 ]. Therefore, we averaged the\nexpression profiles across patients of the same cancer type\nand inverted the averaged expression profiles by multiply-\ning the values by -1. These disease-specific reversal profiles\nwere subsequently input into SmilesGEN to generate candi-\ndate therapeutic molecules.\nFor each type of cancer, we generated 1,000 candidate\nmolecules. After refining the generated molecules using\nthe Lipinski’s Rule of Five, we obtained 783, 859, and 662\nmolecules for TNBC, CRC, and LUAD, respectively. Fig-\nure 4 displays the distribution of quantitative estimate of QED\nvalues of these molecules compared to approved drugs for\ntreating these diseases. It is noteworthy that the mean QED\nvalues of the molecules generated for LUAD and TNBC ex-\nceeded 0.75, suggesting that our model is highly effective in\ngenerating drug-like molecules with therapeutic potential.\nWe further calculated the Tanimoto similarity between our\ngenerated molecules and known approved drugs. Table 2\nhighlights the molecules generated by our model that exhibit\nsignificant similarity to approved drugs for respective can-\ncers. For example, Ribociclib, an approved drug for TNBC\ntreatment [Liet al. , 2022 ], is a specific inhibitor of cyclin-\ndependent kinase 4/6 (CDK4/6), used in the treatment of\nhormone receptor-positive and human epidermal growth fac-\ntor receptor 2-negative (HR+/HER2-) advanced or metastatic\nbreast cancer in postmenopausal women. The molecules gen-erated by our model for these three cancers exhibited high\nTanimoto similarity to these approved drugs. Notably, when\ngenerating therapeutic molecules for lung cancer using the\nreversal profile, the Tanimoto similarity between the gener-\nated molecules and Alectinib Hydrochloride reached 0.98.\nThis high degree of similarity indicates that SmilesGEN ef-\nfectively captures structural features similar to those of ap-\nproved drugs, suggesting that our model can generate hit-like\nmolecules with high therapeutic potential.\n0.00 .20 .40 .60 .81 .00.000.050.100.15/s32\n/s32Molecule FrequencyQ\nED Score  TNBC    CRC    LUAD  Drugs\nFigure 4: Distribution of QED values of generated molecules using\nthe reversal profiles of three types of cancers.\n5 Conclusion\nIn this paper, we introduce the SmilesGEN, a novel genera-\ntive model designed to generate hit-like molecules based on\ndesired phenotypic profiles. Our model explicitly models the\ninterplay between molecules and cellular environments in the\nlatent space, driving the model to learn informative and ex-\npressive features of molecules and expression profiles. Ex-\nperimental results show that SmilesGEN outperforms current\nstate-of-the-art models and can generate hit-like molecules\nwith potential therapeutic effects. We believe that Smiles-\nGEN represents an alternative approach to bridging chemistry\nand biology in the long and difficult road of drug discovery.\n--- Page 8 ---\nAcknowledgments\nThis work was supported by National Natural Science Foun-\ndation of China (No. 62372229), Natural Science Foundation\nof Jiangsu Province (No. BK20231271).\nReferences\n[Attwood et al. , 2021 ]Misty M Attwood, Doriano Fabbro,\nAleksandr V Sokolov, Stefan Knapp, and Helgi B Schi ¨oth.\nTrends in kinase drug discovery: targets, indications\nand inhibitor design. Nature Reviews Drug Discovery ,\n20(11):839–861, 2021.\n[Berg, 2021 ]Ellen L Berg. The future of phenotypic drug\ndiscovery. Cell chemical biology , 28(3):424–430, 2021.\n[Blaschke et al. , 2018 ]Thomas Blaschke, Marcus Olive-\ncrona, Ola Engkvist, J ¨urgen Bajorath, and Hongming\nChen. Application of generative autoencoder in de\nnovo molecular design. Molecular informatics , 37(1-\n2):1700123, 2018.\n[Chung et al. , 2014 ]Junyoung Chung, C ¸ aglar G ¨ulc ¸ehre,\nKyunghyun Cho, and Yoshua Bengio. Empirical evalua-\ntion of gated recurrent neural networks on sequence mod-\neling. ArXiv , abs/1412.3555, 2014.\n[Daset al. , 2023 ]Dibyajyoti Das, Broto Chakrabarty, Raj-\ngopal Srinivasan, and Arijit Roy. Gex2sgen: designing\ndrug-like molecules from desired gene expression signa-\ntures. Journal of Chemical Information and Modeling ,\n63(7):1882–1893, 2023.\n[De Cao and Kipf, 2018 ]Nicola De Cao and Thomas Kipf.\nMolgan: An implicit generative model for small molecular\ngraphs. arXiv preprint arXiv:1805.11973 , 2018.\n[Dollar et al. , 2021 ]Orion Dollar, Nisarg Joshi, David AC\nBeck, and Jim Pfaendtner. Attention-based generative\nmodels for de novo molecular design. Chemical Science ,\n12(24):8362–8372, 2021.\n[G´omez-Bombarelli et al. , 2018 ]Rafael G ´omez-\nBombarelli, Jennifer N Wei, David Duvenaud,\nJos´e Miguel Hern ´andez-Lobato, Benjam ´ın S ´anchez-\nLengeling, Dennis Sheberla, Jorge Aguilera-Iparraguirre,\nTimothy D Hirzel, Ryan P Adams, and Al ´an Aspuru-\nGuzik. Automatic chemical design using a data-driven\ncontinuous representation of molecules. ACS central\nscience , 4(2):268–276, 2018.\n[Goodfellow et al. , 2014 ]Ian J. Goodfellow, Jean Pouget-\nAbadie, Mehdi Mirza, Bing Xu, David Warde-Farley,\nSherjil Ozair, Aaron C. Courville, and Yoshua Bengio.\nGenerative adversarial networks. Communications of the\nACM , 63:139 – 144, 2014.\n[Hetzel et al. , 2022 ]Leon Hetzel, Simon Boehm, Niki Kil-\nbertus, Stephan G ¨unnemann, Fabian Theis, et al. Pre-\ndicting cellular responses to novel drug perturbations at\na single-cell resolution. Advances in Neural Information\nProcessing Systems , 35:26711–26722, 2022.\n[Huang and Liu, 2024 ]Wei Huang and Hui Liu. Predict-\ning single-cell cellular responses to perturbations usingcycle consistency learning. Bioinformatics , 40(Supple-\nment 1):i462–i470, 2024.\n[Jinet al. , 2020 ]Wengong Jin, Regina Barzilay, and Tommi\nJaakkola. Hierarchical generation of molecular graphs us-\ning structural motifs. In International conference on ma-\nchine learning , pages 4839–4848. PMLR, 2020.\n[Kaitoh and Yamanishi, 2021 ]Kazuma Kaitoh and Yoshi-\nhiro Yamanishi. Triomphe: transcriptome-based inference\nand generation of molecules with desired phenotypes by\nmachine learning. Journal of Chemical Information and\nModeling , 61(9):4303–4320, 2021.\n[Kingma and Welling, 2013 ]Diederik P Kingma and Max\nWelling. Auto-Encoding Variational Bayes. arXiv e-\nprints , page arXiv:1312.6114, December 2013.\n[Li and Yamanishi, 2024 ]Chen Li and Yoshihiro Yamanishi.\nGxvaes: Two joint vaes generate hit molecules from gene\nexpression profiles. In Proceedings of the AAAI Confer-\nence on Artificial Intelligence , volume 38, pages 13455–\n13463, 2024.\n[Liet al. , 2018 ]Yujia Li, Oriol Vinyals, Chris Dyer, Razvan\nPascanu, and Peter Battaglia. Learning deep generative\nmodels of graphs. arXiv preprint arXiv:1803.03324 , 2018.\n[Liet al. , 2022 ]Yun Li, Huajun Zhang, Yulia Merkher, Lin\nChen, Na Liu, Sergey Leonov, and Yongheng Chen. Re-\ncent advances in therapeutic strategies for triple-negative\nbreast cancer. Journal of hematology & oncology ,\n15(1):121, 2022.\n[Malandraki-Miller and Riley, 2021 ]Sophia Malandraki-\nMiller and Paul R Riley. Use of artificial intelligence\nto enhance phenotypic drug discovery. Drug Discovery\nToday , 26(4):887–901, 2021.\n[Meissner et al. , 2022 ]Felix Meissner, Jennifer Geddes-\nMcAlister, Matthias Mann, and Marcus Bantscheff. The\nemerging role of mass spectrometry-based proteomics\nin drug discovery. Nature Reviews Drug Discovery ,\n21(9):637–654, 2022.\n[M´endez-Lucio et al. , 2020 ]Oscar M ´endez-Lucio, Benoit\nBaillif, Djork-Arn ´e Clevert, David Rouqui ´e, and Joerg\nWichard. De novo generation of hit-like molecules from\ngene expression signatures using artificial intelligence.\nNature communications , 11(1):10, 2020.\n[Merk et al. , 2018 ]Daniel Merk, Lukas Friedrich, Francesca\nGrisoni, and Gisbert Schneider. De novo design of bioac-\ntive small molecules by artificial intelligence. Molecular\ninformatics , 37(1-2):1700153, 2018.\n[Moffat et al. , 2017 ]John G Moffat, Fabien Vincent,\nJonathan A Lee, J ¨org Eder, and Marco Prunotto. Op-\nportunities and challenges in phenotypic drug discovery:\nan industry perspective. Nature reviews Drug discovery ,\n16(8):531–543, 2017.\n[Munson et al. , 2024 ]Brenton P Munson, Michael Chen,\nAudrey Bogosian, Jason F Kreisberg, Katherine Licon,\nRuben Abagyan, Brent M Kuenzi, and Trey Ideker.\nDe novo generation of multi-target compounds using\n--- Page 9 ---\ndeep generative chemistry. Nature Communications ,\n15(1):3636, 2024.\n[Pham et al. , 2022 ]Thai-Hoang Pham, Lei Xie, and Ping\nZhang. Fame: fragment-based conditional molecular gen-\neration for phenotypic drug discovery. In Proceedings of\nthe 2022 SIAM International Conference on Data Mining\n(SDM) , pages 720–728. SIAM, 2022.\n[Popova et al. , 2018 ]Mariya Popova, Olexandr Isayev, and\nAlexander Tropsha. Deep reinforcement learning for de\nnovo drug design. Science advances , 4(7):eaap7885, 2018.\n[Sadri, 2023 ]Arash Sadri. Is target-based drug discovery\nefficient? discovery and “off-target” mechanisms of all\ndrugs. Journal of medicinal chemistry , 66(18):12651–\n12677, 2023.\n[Segler et al. , 2018 ]Marwin HS Segler, Thierry Kogej,\nChristian Tyrchan, and Mark P Waller. Generating focused\nmolecule libraries for drug discovery with recurrent neural\nnetworks. ACS central science , 4(1):120–131, 2018.\n[Shayakhmetov et al. , 2020 ]Rim Shayakhmetov, Maksim\nKuznetsov, Alexander Zhebrak, Artur Kadurin, Sergey\nNikolenko, Alexander Aliper, and Daniil Polykovskiy.\nMolecular generation for desired transcriptome changes\nwith adversarial autoencoders. Frontiers in Pharmacol-\nogy, 11:269, 2020.\n[Subramanian et al. , 2017 ]Aravind Subramanian, Rajiv\nNarayan, Steven M. Corsello, and et al. A next generation\nconnectivity map: L1000 platform and the first 1,000,000\nprofiles. Cell, 171(6):1437–1452.e17, 2017.\n[Swinney and Anthony, 2011 ]David C Swinney and Jason\nAnthony. How were new medicines discovered? Nature\nreviews Drug discovery , 10(7):507–519, 2011.\n[Tang et al. , 2018 ]Jing Tang, Balaguru Ravikumar, Zaid\nAlam, Anni Rebane, Markus V ¨ah¨a-Koskela, Gopal Ped-\ndinti, Arjan J van Adrichem, Janica Wakkinen, Alok\nJaiswal, Ella Karjalainen, et al. Drug target com-\nmons: a community effort to build a consensus knowledge\nbase for drug-target interactions. Cell chemical biology ,\n25(2):224–229, 2018.\n[Tong et al. , 2023 ]Xiaochu Tong, Ning Qu, Xiangtai Kong,\nShengkun Ni, Kun Wang, Lehan Zhang, Yiming Wen,\nSulin Zhang, Xutong Li, and Mingyue Zheng. Transi-\ngen: Deep representation learning of chemical-induced\ntranscriptional profile. bioRxiv , pages 2023–11, 2023.\n[Vincent et al. , 2022 ]Fabien Vincent, Arsenio Nueda,\nJonathan Lee, Monica Schenone, Marco Prunotto, and\nMark Mercola. Phenotypic drug discovery: recent\nsuccesses, lessons learned and new directions. Nature\nReviews Drug Discovery , 21(12):899–914, 2022.\n[Wang et al. , 2022 ]Wenlu Wang, Ye Wang, Honggang\nZhao, and Simone Sciabola. A transformer-based gener-\native model for de novo molecular design. arXiv preprint\narXiv:2210.08749 , 2022.\n[Weinstein et al. , 2013 ]John N Weinstein, Eric A Collison,\nGordon B Mills, Kenna R Shaw, Brad A Ozenberger, Kyle\nEllrott, Ilya Shmulevich, Chris Sander, Joshua M Stuart,and Houtan Noushmehr. The cancer genome atlas pan-\ncancer analysis project. Nature Genetics , 45(10):1113–\n1120, 2013.\n[Wishart et al. , 2006 ]David S Wishart, Craig Knox, An Chi\nGuo, Savita Shrivastava, Murtaza Hassanali, Paul\nStothard, Zhan Chang, and Jennifer Woolsey. Drugbank:\na comprehensive resource for in silico drug discovery and\nexploration. Nucleic acids research , 34(suppl 1):D668–\nD672, 2006.\n[Yamanaka et al. , 2023 ]Chikashige Yamanaka, Shunya Uki,\nKazuma Kaitoh, Michio Iwata, and Yoshihiro Yamanishi.\nDe novo drug design based on patient gene expression\nprofiles via deep learning. Molecular Informatics , 42(8-\n9):2300064, 2023.\n[Zhang and Chen, 2022 ]Jie Zhang and Hongming Chen. De\nnovo molecule design using molecular generative mod-\nels constrained by ligand–protein interactions. Journal\nof chemical information and modeling , 62(14):3291–3306,\n2022.\n[Zhavoronkov et al. , 2019 ]Alex Zhavoronkov, Yan A Iva-\nnenkov, Alex Aliper, Mark S Veselov, Vladimir A Al-\nadinskiy, Anastasiya V Aladinskaya, Victor A Terentiev,\nDaniil A Polykovskiy, Maksim D Kuznetsov, Arip Asadu-\nlaev, et al. Deep learning enables rapid identification\nof potent ddr1 kinase inhibitors. Nature biotechnology ,\n37(9):1038–1040, 2019.",
  "text_length": 42855
}