{
  "id": "http://arxiv.org/abs/2506.05265v1",
  "title": "Teaming in the AI Era: AI-Augmented Frameworks for Forming, Simulating,\n  and Optimizing Human Teams",
  "summary": "Effective teamwork is essential across diverse domains. During the team\nformation stage, a key challenge is forming teams that effectively balance user\npreferences with task objectives to enhance overall team satisfaction. In the\nteam performing stage, maintaining cohesion and engagement is critical for\nsustaining high team performance. However, existing computational tools and\nalgorithms for team optimization often rely on static data inputs, narrow\nalgorithmic objectives, or solutions tailored for specific contexts, failing to\naccount for the dynamic interplay of team members personalities, evolving\ngoals, and changing individual preferences. Therefore, teams may encounter\nmember dissatisfaction, as purely algorithmic assignments can reduce members\ncommitment to team goals or experience suboptimal engagement due to the absence\nof timely, personalized guidance to help members adjust their behaviors and\ninteractions as team dynamics evolve. Ultimately, these challenges can lead to\nreduced overall team performance. My Ph.D. dissertation aims to develop\nAI-augmented team optimization frameworks and practical systems that enhance\nteam satisfaction, engagement, and performance. First, I propose a team\nformation framework that leverages a multi-armed bandit algorithm to\niteratively refine team composition based on user preferences, ensuring\nalignment between individual needs and collective team goals to enhance team\nsatisfaction. Second, I introduce tAIfa (Team AI Feedback Assistant), an\nAI-powered system that utilizes large language models (LLMs) to deliver\nimmediate, personalized feedback to both teams and individual members,\nenhancing cohesion and engagement. Finally, I present PuppeteerLLM, an\nLLM-based simulation framework that simulates multi-agent teams to model\ncomplex team dynamics within realistic environments, incorporating task-driven\ncollaboration and long-term coordination.",
  "authors": [
    "Mohammed Almutairi"
  ],
  "published": "2025-06-05T17:24:37Z",
  "updated": "2025-06-05T17:24:37Z",
  "categories": [
    "cs.HC",
    "cs.AI",
    "cs.MA"
  ],
  "pdf_url": "http://arxiv.org/pdf/2506.05265v1",
  "full_text": "--- Page 1 ---\narXiv:2506.05265v1  [cs.HC]  5 Jun 2025Teaming inthe AIEra:AI-AugmentedFrameworks forForming,\nSimulating,andOptimizingHumanTeams\nMohammedAlmutairi\nComputerSciences andEngineering\nUniversity of Notre Dame\nNotre Dame,IN,USA\nmalmutai@nd.edu\nAbstract\nEﬀectiveteamworkisessentialacrossdiversedomains.Dur ingthe\nteam formation stage ,a key challenge is forming teams that ef-\nfectivelybalanceuserpreferences withtaskobjectives to enhance\noverall team satisfaction. In the team performing stage , main-\ntaining cohesion and engagement is critical for sustaining high\nteam performance. However, existing computational tools a nd al-\ngorithmsforteamoptimizationoftenrelyonstaticdatainp uts,nar-\nrow algorithmic objectives, or solutions tailored for spec iﬁc con-\ntexts, failing to account for the dynamic interplay of team m em-\nbers’ personalities, evolving goals, and changing individ ual pref-\nerences. Therefore, teams may encounter member dissatisfa ction,\nas purely algorithmic assignments can reduce members’ comm it-\nment to team goals or experience suboptimal engagement due t o\nthe absence of timely, personalized guidance to help member s ad-\njust their behaviors and interactions as team dynamics evol ve. Ul-\ntimately,thesechallenges canleadtoreducedoverallteam perfor-\nmance.\nDriven by these challenges, my Ph.D. dissertation aims to de -\nvelop AI-augmented team optimization frameworks and pract ical\nsystems that enhance team satisfaction, engagement, and pe rfor-\nmance.First,Iproposeateamformationframeworkthatleve rages\na multi-armed bandit algorithm to iteratively reﬁne team co mpo-\nsition based on user preferences, ensuring alignment betwe en in-\ndividual needsand collectiveteamgoals toenhance team sat isfac-\ntion.Second,IintroducetAIfa(“Team AIFeedbackAssistan t”), an\nAI-powered system that utilizes large language models (LLM s) to\ndeliver immediate, personalized feedback to both teams and indi-\nvidual members, enhancing cohesion and engagement. Finall y, I\npresent PuppeteerLLM,an LLM-based simulationframework t hat\nsimulatesmulti-agentteamstomodelcomplexteamdynamics within\nrealisticenvironments,incorporatingtask-drivencolla borationand\nlong-termcoordination.Myworktakesahuman-centeredapp roach\nto advance AI-driven team optimization through both theore tical\nframeworks and practical systems to improve team members’ s at-\nisfaction, engagement, and performance.\nPermission to make digital or hard copies of all or part of thi s work for personal or\nclassroomuseisgrantedwithoutfeeprovidedthatcopiesar enotmadeordistributed\nforproﬁtorcommercialadvantageandthatcopiesbearthisn oticeandthefullcitation\nontheﬁrstpage.Copyrightsforthird-partycomponentsoft hisworkmustbehonored.\nFor all other uses,contact the owner/author(s).\nUMAP’25,NewYorkCity,NY, USA\n© 2025 Copyrightheld by the owner/author(s).\nACM ISBN979-8-4007-1313-2/2025/06\nhttps://doi.org/10.1145/3699682.3727574CCS Concepts\n•Human-centered computing →Collaborative and social\ncomputing ; •Computing methodologies →Multi-agent sys-\ntems;Machine learning ;Simulationandmodeling .\nKeywords\nHuman-AITeams,LLM-basedAgentModeling,PersonalizedTe am\nRecommendation,AutomatedFeedback\nACMReference Format:\nMohammedAlmutairi.2025.TeamingintheAIEra:AI-AugmentedFram e-\nworks for Forming, Simulating, and Optimizing Human Teams. In 33rd\nACM Conference on User Modeling, Adaptation and Personaliz ation (UMAP\n’25), June 16–19, 2025, New York City, NY, USA. ACM, New York, NY, USA,\n6pages. https://doi.org/10.1145/3699682.3727574\n1 INTRODUCTION\nTeams are fundamental to learning and work but often face cha l-\nlenges relatedtocollaboration,engagement, and decision -making\nthroughouttheir development stages. Theﬁrstchallenge ar ises in\ntheformingstage ,whereteamsmustbeassembledinawaythat\nfosters consensus and satisﬁes all members. Traditional te am for-\nmationinclassroomsorworkplacesiseithermanualorusess tatic\nassignment algorithms (e.g., matching based on skills or av ailabil-\nity) [13]. Such approaches rarely account for individuals’ prefer-\nences or the degree of agreement among team members regard-\ning their team composition. Research shows that involving u sers\nin team formation can boost their motivation and satisfacti on [1].\nMoreover, traditional recommender system techniques have been\napplied to suggest team members or groupings based on proﬁle s\nand preferences. However, many prior approaches assume mem -\nber preferences are static and often ignore the evolution of those\npreferences ortheneed tobalancefairness among allmember s.\nOnce teams are formed, new challenges arise in the perform-\ningstage ,particularlyinteam engagement. A majorchallenge in\nsustainingandenhancingteamengagementisthelackofcons truc-\ntive feedback during teamwork. Without feedback aligned wi th\nteam goals, members may continue to have poor communication\nhabitsordisengage,hinderingoverallperformance[18].W hilehu-\nmanmanagers orcoaches canprovideguidance, their inputis not\nalways available or timely for every team interaction. Rece nt ef-\nfortsinhuman-computerinteractionhavebegunexploringA I-mediated\nfeedback. For example, He et al. [17] developed a tool that an a-\nlyzesteamchatforsignsoflowparticipationorpoorcollab oration\nand advises members onimproving their interaction norms. S imi-\nlarly,Faucettetal.[10]’sReﬂectLivesystemdeliversrea l-timenon-\nverbal feedback during video consultations, monitoring ey e gaze\n--- Page 2 ---\nUMAP ’25,June 16–19,2025,NewYork City,NY, USA Mohammed Al mutairi\nand interruptions to help clinicians improve patient engag ement.\nTheseworksshowthepromiseofAIinguidingteams,yetexist ing\nsolutionsareoftenlimitedtospeciﬁcfeedbacktypesorreq uiresig-\nniﬁcantmanualsetup.Thereremainsaneedforageneral,sca lable\napproachtoprovidepersonalized,automatedfeedbackthat adapts\ntoany team’s communicationpatterns and engagement levels .\nAnother key challenge in sustaining and enhancing team en-\ngagement is understanding team dynamics in complex teamwor k\nscenarios. Researchers and practitioners often seek to exp eriment\nwith diﬀerent team structures, roles, or interaction strat egies, but\nconducting such experiments with actual teams canbecostly and\ndiﬃculttocontrol.Traditionalsimulationsofteamdynami cs (e.g.,\nagent-based models [25]) capture some aspects of teamwork b ut\noften simplify social and communication behaviors. These l imita-\ntions reduce their ability to model the nuanced, adaptive na ture\nof human-team interaction. Recently, the emergence of LLMs has\nopened new possibilities for simulation. LLM agents can gen er-\natehuman-likebehavior,suggestingtheycouldemulatehow team\nmembers discuss, plan, and collaborate on tasks [32]. These ad-\nvances demonstratethe potentialof LLM-based simulationf rame-\nworks tocreate realistic, interactive environments where team in-\nterventionscanbetestedandreﬁned.However,currentLLM- powered\nsimulationsremainlimitedintheirabilitytomodelreal-w orldcom-\nplexities,suchasscenariosrequiringtask-drivencollab orationand\nlong-term coordination[11].\nMotivatedbythesegaps,myPh.D.dissertationaimstodevel op\nAI-drivenframeworksandpracticalsystemsthatimprovete amfor-\nmation, engagement, and, ultimately, team performance. Sp eciﬁ-\ncally, my work addresses the limitations of team formation m eth-\nods by designing an adaptive framework that iteratively inc orpo-\nrates users’ preferences toimprove consensus-driven team assem-\nbly. I developed a multi-armed bandit-based framework that dy-\nnamically reﬁnes team recommendations based on user feedba ck,\nensuring alignment betweenindividualpreferences and col lective\nteam goals. Additionally, to enhance team engagement and co he-\nsion,myresearch addressesthelackofreal-timeandperson alized\nfeedback in team interactions. I introduce /t.scAI/f.sc/a.sc, an AI-mediated\nfeedback system that analyzes team communication patterns and\nprovides automated, context-aware recommendations to bot h in-\ndividuals and the team as a whole. Finally, my research advan ces\nLLM-based simulations to model team dynamics in a real-worl d\nsimulated environment, integrating task-driven collabor ationand\nlong-term coordination. I developed PuppeteerLLM, a simul ation\nframework that leverages multi-agent teams powered byLLMs to\nemulatecomplex team interactions. This allows researcher s toex-\nperiment with diﬀerent team structures, roles, and engagem ent\nstrategies ina controlledsetting.\n2 RELATED WORK\n2.1 Recommender SystemsforTeam\nFormation\nRecommender systems (RS) have been adapted to facilitate te am\nformation by framing team assembly as a recommendation prob -\nlem. Empirical studies suggest that RS-based team formatio n out-\nperformstraditionalmethods,suchasgreedyapproaches,b yopti-\nmizing member selection based on multiple factors [26, 40]. Onewidely used RS technique is collaborative ﬁltering (CF) [39 ], in-\ntroduced by Resnick et al. [34], which recommends team mem-\nbers based on the preferences of similar users. Yet, CF relie s on\nsuﬃcient preference data to be eﬀective and may lead to homo-\ngeneous teams, as it tends to suggest members with similar at -\ntributes. Another technique is content-based ﬁltering (CB F) [22],\nproposed by Rich [35] recommends team members based on user\npreferences and predeﬁned features. However, CBF eﬀective ness\nis constrained by the similarity function used to compare hi stori-\ncal proﬁles with current preferences. Moreover, studies ad opting\nthis technique often assume user preferences remain static , an as-\nsumptionchallenged by[19].Toaddress thelimitations ofC Fand\nCBF, the hybrid technique was introduced and has been widely\nusedacrossvariousdomains[2,20].Forexample,Zhangetal .[40]\ndeveloped an on-demand taxi platform that uses hybrid RS tec h-\nniques toform driver teams,recommending drivers basedon s im-\nilarity matrices. However, this method favors early leader s in the\nselectionprocess,asoncealeaderacceptsamember,thatme mber\nisunavailabletoothers.Thissequentialselectionreduce sfairness,\nparticularlyforlaterleaderswhomustchoosefromamoreli mited\npool.\nTo overcome the limitations of traditional RS techniques, r ein-\nforcement learning provides a dynamic approach that adapts to\nuserpreferences overtime.Multi-armedbandit(MAB)algor ithms,\nsuchas[7,37],aresuitedforscenariosrequiringabalance between\nexploring new options and exploiting known good choices. Th ey\nhave been applied in various adaptive decision-making prob lems\n[4]andserveasafoundationformyteamformationwork.Zhou et\nal.[42]introducedasystem thatuses amulti-armedbandit f rame-\nwork to discover which team behavior policies, such as commu -\nnication norms, decision-making styles, or leadership str uctures,\nwork best for a particular team structure. Each potential po licyis\ntreated as an “arm” of the bandit, allowing the system to expe ri-\nmentallywithand switchamong variousoptionsin real time.\n2.2 Feedback in Teams\nFeedback interventions enhance team processes such as comm u-\nnication balance and coordination [16]. Eﬀective feedback helps\nteamsreﬂectontheirperformanceandreﬁnetheirmotivatio nwhen\ntheyareawareofnecessaryadjustments[14,27].Depending onits\nnature,feedbackcanbesubjectiveorobjective,incorpora tingcon-\nversational insights, behavioral patterns, or performanc e evalua-\ntions, and may target individuals or entire teams [29]. Sinc e tasks\nevolve over multiple cycles, leaders can monitor team membe rs’\nperformance, diagnose problems, and provide targeted feed back\nto enhance team learning and skill development [23]. Resear ch\ncategorizes team feedback into recipient-focused , where the feed-\nbackisdirectedatindividualsorthewholeteam,and time-focused\nfeedback,wherethefeedbackisdeliveredbefore,during,o raftera\ntask [9]. Real-time feedback during a task helps members sta y on\ntrack,adjusttheireﬀortstowardteamgoals,andenhancese ngage-\nment by providing immediate acknowledgment [30].However, as\nteamsscaleinsizeand complexity,providingtimely,perso nalized\nfeedback to every team member requires substantial eﬀort, m ak-\ning it diﬃcult for leaders to eﬀectively monitor team dynami cs.\n--- Page 3 ---\nTeaming in theAIEra: AI-Augmented FrameworksforForming, Si mulating,and Optimizing Human Teams UMAP’25,June 16–19, 20 25,NewYorkCity, NY, USA\nAI-generated feedback oﬀers a scalable solution to automat e per-\nformance evaluation, team monitoring, and continuous impr ove-\nmentsuggestionswithouthumanintervention[5,8].Severa ltools\nhave been developed to provide real-time team feedback [10, 21].\nForexample,SayWAT[6],implementedonGoogleGlass,provi des\nvisualfeedbackonspeechprosody.Similarly,Samroseetal .[36]de-\nsigned a video chat platformthatgives feedback oninterrup tions,\nvolume, and emotional tonein team discussions.\n2.3 ModelingandSimulation Team Dynamics\nResearchers have employed agent-based modeling (ABM) and r e-\ninforcementlearning(RL)tosimulateteams’behaviorsand perfor-\nmance [25]. ABMs rely on predeﬁned rules to model agent inter -\nactions, making them eﬀective for generalizable collectiv e behav-\niorsbutlimitedincapturingcomplexsocialinteractionsa ndadap-\ntive decision-making [3, 33]. RL-based approaches, on the o ther\nhand, enableagents tolearnfromtheir environment, allowi ngfor\nmore dynamic behavior modeling. For instance, Meimandi et a l.\n[28]proposedanRL-basedframeworkthatintegratesbelief s,prior\nknowledge, and social interactions to simulate ethics and t rust in\nteams.However,RLmodelsrequireextensivetrainingandre lyon\nﬁxed parameters, which can oversimplify agent decision-ma king\nand limit their ability to emulate real-world cognition [24 , 41]. In\ncontrast to ABM and RL, large language models (LLMs) oﬀer a\nmoreﬂexibleapproachtosimulatingsocialinteractionsan devolv-\ningteam behaviors[11].LLM-powered agents havedemonstra ted\nhuman-likedecision-makingandmemoryretention,enablin gthem\nto dynamically adapt based on prior interactions [31, 38]. H ow-\never, LLM-based multi-agent systems still face challenges in coor-\ndinatedmulti-agentinteractionstoperformtask-drivenc ollabora-\ntionandlong-termcoordinationwithspatialandtemporald ynam-\nics [15].\n3 RESEARCH OBJECTIVES, METHODOLOGY,\nAND RESULT\nMydoctoralresearch goalistoenhance teamsatisfaction,e ngage-\nment, and, ultimately,team performancebydeveloping AI-d riven\ntheoreticalframeworksandpracticalsystems.Toachievet hisgoal,\nI deﬁne three main research objectives, each addressing a sp eciﬁc\nsetofresearch questions.Below,Ioutlinetheseobjective s andthe\nquestions they seek toanswer:\n3.1 RO1: Develop ateam formation framework\nthatincorporates user preferences to\nmaximize consensus amongmembers in\nassembled teams.\nThis objectiveaddresses thefollowingresearch questions :\n•RQ1.Howeﬀective is therecommendationsystem inguid-\ning users in selecting a team that aligns with their prefer-\nences?\n•RQ2.How does incorporating user preferences during the\nteam formationprocess impactteam satisfaction?\n•RQ3.How does incorporating user preferences during the\nteam formationprocess impactteam performance?To address the research questions, I have structured my work\nintothefollowingsteps:\n3.1.1Algorithm Development: I modeled the team formation\nproblemasaMABproblem,extendingtheUpperConﬁdenceBoun d\n(UCB)algorithmtoiterativelyreﬁneteamrecommendations based\non user feedback [12]. My approach treats team selection as a se-\nquential decision-making process, where the UCB algorithm ad-\njustsrecommendations bybalancing explorationand exploi tation.\nEach potential team compositionis represented as an “arm,” with\nuser feedback serving as the reward to guide the algorithm in the\nselectionprocess.\n3.1.2OﬀlineEvaluation: IevaluatedtheUCBalgorithmthrough\nanoﬄinesimulation,measuringhowwelltherecommendedtea ms\nalignwithuserpreferences.TheevaluationleveragedBigF iveper-\nsonalitytraitsasarepresentationofuserpreferences,sh owingthat\nthe UCB algorithm achieved a high degree of alignment betwee n\nthe recommended team compositions and users’ selections. T he\npreliminary result provided motivation to further examine the ef-\nfectofthealgorithm inreal-world team interactionscenar ios.\n3.1.3FutureWork: BuildinguponthepreliminaryresultsofUCB\nalgorithm evaluation, the next step is to develop an interac tive\nsystem that integrates the proposed MAB-based team formati on\nframework within a real-time communication environment us ing\nDiscord1. Speciﬁcally, the system will allow users to specify their\nproﬁles.Then,anoptimizationalgorithmwillbeemployedt ogen-\nerateaninitialsetofcandidateteamcompositions.Afterw ard,user\npreferences will iteratively guide personalized recommen dations\nofthesecandidateteams.Overmultipleiterations,UCBalg orithm\nwillreﬁne andconverge towardoptimalteam compositionsba sed\nonuserfeedback.Thisiterativeprocesswillgenerateapre ference\nscore matrix, which will subsequently be used to solve an ass ign-\nmentproblemtomaximizeoveralluser-teamalignment.Afte rcom-\npletingsystemdevelopment,Iwillconductabetween-subje ctslab-\noratoryexperiment to evaluate theeﬀectiveness of diﬀeren t team\nformation methods on team satisfaction and performance. Pa rtic-\nipants will be randomly assigned to a team, and each session w ill\nfollow one of four experimental conditions: random teams, s elf-\nassembledteams, and proposedteam formationframework.\n3.2 RO2: DevelopanAIagentpoweredbyLLMs\nto analyzeteam interactions and generate\nimmediate, personalized feedback to\nenhance team engagement and cohesion.\nThisobjectiveaddresses thefollowingresearch questions :\n•RQ1:HowdoesincludingAI-generatedautomatedfeedback\nimpact team members’ engagement and interactions with\neach other?\n•RQ2:HowdoesincludingAI-generatedautomatedfeedback\nimpact teamperformance?\nTo achieve this objective and answer the research questions , I\norganizedmy workinto thesesteps:\n1https://discord.com/developers/docs/quick-start/ove rview\n--- Page 4 ---\nUMAP ’25,June 16–19,2025,NewYork City,NY, USA Mohammed Al mutairi\n3.2.1PromptDesign: IbeganbydesigningLLMpromptstogen-\nerateeﬀectivefeedbackmessages,drawingoninsightsfrom small-\ngroupresearchtointegratesevenkeycommunicationmetric sthat\nevaluateteamcommunication.First,languagestylematchi ng(LSM)\nmeasures how closely team members align their communicatio n\nstyles by analyzing function word usage. Sentiment analysi s cap-\nturestheemotionaltoneofconversations,classifyingthe masposi-\ntive,negative,orneutral.Thetransactivememorysystema ssesses\nhowwellteammembersrecognizeandleverageeachother’sex per-\ntiseduringdecision-making.Teamengagementmeasuresbal anced\nparticipation, ensuring that a few members do not dominate c on-\nversations. Collective pronoun usage indicates shared tea m iden-\ntity,whilecommunicationﬂowexaminesresponsetimes,int errup-\ntions, and turn-taking patterns. Finally, topic coherence evaluates\nwhetherdiscussionsstayalignedwiththeteam’sobjective s,reduc-\ning oﬀ-task distractions.\n3.2.2SystemDevelopment: IdevelopedtAIfa,anLLM-powered\nagentdesignedtoprovideimmediate,AI-generatedfeedbac ktoin-\ndividuals and teams on Slack. The system operates through fo ur\nmainprocessingstages:Stage 1/circlecopyrtretrievesandstructuresteammes-\nsages into a JSON format, preserving metadata and chronolog y;\nStage2/circlecopyrtevaluates team dynamics by computing the communica-\ntion metrics; Stage 3/circlecopyrtuses these metrics and structured prompts\nto generate personalized feedback through the LLM; and Stag e4/circlecopyrt\ndelivers both individual feedback via private message and t eam\nfeedback via public message. The feedback is structuredint o four\nkey sections: task contribution summary, strengths, areas for im-\nprovement, and actionablerecommendations.\n3.2.3User Study: To evaluate the eﬀectiveness of tAIfa, I con-\nducteda laboratoryexperiment toexamine itsimpactonteam en-\ngagement, cohesion, and performance. A total of 54 particip ants\nwereassignedtoteamsofthreeandperformedthreecollabor ative\ntasks,eachlasting10minutes,simulatingreal-worldteam dynam-\nicsonSlack.Thisbetween-subjectsstudyincludedacontro lgroup\n(no AI feedback) and a treatment group (receiving AI feedbac k\nfrom tAIfa).Each 60-minute session followed a three-round struc-\nture,afterwhich participantscompletedsurveys ontheirt eamex-\nperiences, interactions, and engagement levels.\n3.2.4Results: Mypreliminary results indicate thatteams in the\ntreatment conditionoutperformedthe controlgroupacross multi-\npleengagement metrics.Theyengaged indeeperdiscussions ,had\nlonger conversations, and involved more participants, sug gesting\nthat tAIfa feedbackfostered active participationand sust ained en-\ngagement.Participantsinthetreatmentgroupalsoreporte dhigher\nlevels of team eﬃciency, satisfaction, and willingness to c ollabo-\nrate with the same team again. Additionally, teams in the tre at-\nment condition showed an improvement in overall performanc e\ncompared tothecontrolteams.\nMetric(Average) ControlTreatment\nConversation Duration(Minutes) 6.9 8.14\nSpeaker TurnFrequency 16 20.87\nWordCount 233.04 260.3\nTask Performance 60.4% 62%3.2.5FutureWork: Asofnow,thetAIfaagentdoesnotsupport\nreal-timeusersinteractionandthefeedbackisprovidedon lyatthe\nendofthetasks.Iplantoexpandtheagent’scapabilitiesto enable\ndynamicinteraction,allowinguserstochoosetheirprefer redfeed-\nbacktiming.Also,Iaimtorecruitlargerandmorediversesa mples\ntoensure statisticallysigniﬁcant ﬁndings.\n3.3 RO3: Develop an LLM-based simulation\nframework tostudy team dynamics.\nThisobjectiveaddresses thefollowingresearch question:\n•RQ1:HowcanLLMsbeleveragedtocreatesimulationenvi-\nronmentsthataccuratelyemulatehuman-teaminteractions ?\nTo achieve this objective and answer the research question, I\norganizedmy workinto thesesteps:\n3.3.1FrameworkDevelopment: IdevelopedPuppeteerLLM,a\nsimulation framework that models complex human team dynam-\nics by incorporating LLM agents, physical environments (al low-\ning agents to “move” and occupy locations aﬀecting their int erac-\ntions),andtemporaldynamics (progressing over timewitha gents\nremembering and reacting to past events). The framework pro -\nceeds through three stages: Initialization , where the system sets\nuptheenvironment andagents; Execution ,whereLLMagentsiter-\natively generate and validate events; and Termination , where the\nsimulationendsandtheﬁnalstateisrecorded.PuppeteerLL Mrep-\nresentstheenvironmentasagraph-basedstructure G={/u1D4541,/u1D4542,...,/u1D454/u1D45B}\nwhereeachleafnodecorrespondstoauniquespatialregion, allow-\ning agents tonavigate and reason aboutphysical constraint s.The\nframework provides agents with conversation capability (d yadic\nand nested conversations) and an event scheduling system th at\nqueues each event and executes it in a coherent timeline, the reby\nmitigating challenges like LLM hallucinations. Finally, P uppeteer-\nLLM generates a structuredJSON logofeach simulation,supp ort-\ning both quantitative and qualitative analysis of agent beh aviors\nand team dynamics.\n3.3.2Future Work: My next step is to develop a user interface\nthatassistsusersinsettingupthescenario,conﬁguringth eagents,\nandcustomizingtheenvironment.Thisinterfacewillallow researchers\ntocreatetasks,deﬁneteam roles,personalities,andenvir onments\nwithoutdirectcodemanipulation.Uponthecompletionofth euser\ninterface, I plan to conduct two experiments. First, a compa rative\nanalysis will compare simulation outputs to a ground truth t eam\ndataset, assessing whether the framework replicates human -like\nbehaviors within the same scenario. This step requires deﬁn ing\nwhich metricsresemble team dynamics tocompare. Second,Iw ill\nconduct a user study in which participants interact with the Pup-\npeteerLLM interface to simulate team dynamics. Then, I will sur-\nvey their perceptions of thesimulatedteaminteraction.\n4 DISSERTATION STATUS AND LONG-TERM\nPLAN\nI started my Ph.D. in January 2023 in Computer Science and En-\ngineering at the University of Notre Dame under the supervis ion\nofprofessorDiego Gómez-Zará.Currently,Iaminmy thirdyear\nofstudy,withaprojectedcompletiondatein Fall2026 .Overthe\n--- Page 5 ---\nTeaming in theAIEra: AI-Augmented FrameworksforForming, Si mulating,and Optimizing Human Teams UMAP’25,June 16–19, 20 25,NewYorkCity, NY, USA\nnext two years, I will pursuethe futurework outlined in Sect ions\n3.1.3,3.2.5,and3.3.2toaddressmyresearchobjectives.I nthelong\nterm,IplantofocusonadvancingLLM-basedagentsimulatio nsto\nmodelcomplexteamdynamics andprovideresearchers withto ols\nto enhance team performance. The overall goal of my thesis is to\ndevelopAI-drivenframeworksandpracticalsystemsthaten hance\nteamformation,engagement, andcohesionacrossdiﬀerent s tages\nof team development.\nReferences\n[1] EssaAlhazmi,SameeraHorawalavithana,JohnSkvoretz, JeremyBlackburn,and\nAdrianaIamnitchi.2017. Anempiricalstudyonteamformati oninonlinegames.\nInProceedingsofthe2017IEEE/ACMInternational Conferenceo nAdvancesinSo-\ncial NetworksAnalysis and Mining2017 .431–438.\n[2] Oznur Alkan, Elizabeth M Daly, and Inge Vejsbjerg. 2018. Opportunity team\nbuilderforsalesteams.In 23rdInternational ConferenceonIntelligent UserInter-\nfaces.251–261.\n[3] Li An, Volker Grimm, Abigail Sullivan, BL Turner Ii, Nico las Malleson, Alison\nHeppenstall, ChristianVincenot, DerekRobinson, Xinyue Y e, JianguoLiu,et al.\n2021. Challenges, tasks, and opportunities in modeling age nt-based complex\nsystems. EcologicalModelling 457 (2021), 109685.\n[4] Hamsa Bastani, Mohsen Bayati, and Khashayar Khosravi. 2 021. Mostly\nexploration-free algorithms for contextual bandits. Management Science 67, 3\n(2021), 1329–1349.\n[5] Karim Benharrak,Tim Zindulka, Florian Lehmann, Hendri k Heuer, and Daniel\nBuschek.2024. Writer-deﬁnedAIpersonasforon-demandfee dbackgeneration.\nInProceedings of the CHI Conference on Human Factors in Computi ng Systems .\n1–18.\n[6] LouAnne EBoyd,Alejandro Rangel,HelenTomimbang,Andr eaConejo-Toledo,\nKanikaPatel,MonicaTentori,andGillianRHayes.2016. Say WAT:Augmenting\nface-to-faceconversationsforadultswith autism.In Proceedingsofthe2016CHI\nconferenceon human factorsin computingsystems .4872–4883.\n[7] SébastienBubeck,NicoloCesa-Bianchi,etal.2012. Reg retanalysisofstochastic\nand nonstochastic multi-armed bandit problems. Foundations and Trends® in\nMachine Learning 5,1 (2012), 1–122.\n[8] Tauﬁq Daryanto, Xiaohan Ding, Lance T Wilhelm, Sophia St il, Kirk McInnis\nKnutsen, and Eugenia H Rho. 2025. Conversate: Supporting Re ﬂective Learn-\ninginInterviewPracticeThroughInteractiveSimulationa ndDialogicFeedback.\nProceedingsoftheACMonHuman-ComputerInteraction 9,GROUP(2025),1–32.\n[9] GalinaDeeva,DariaBogdanova, EstefaníaSerral,Moniq ue Snoeck, and Jochen\nDe Weerdt. 2021. A reviewof automated feedback systemsfor l earners:Classi-\nﬁcation framework, challenges and opportunities. Computers & Education 162\n(2021), 104094.\n[10] Heather AFaucett, MatthewLLee, and Scott Carter.2017 . I should listenmore:\nreal-timesensingandfeedbackofnon-verbalcommunicatio ninvideotelehealth.\nProceedings of the ACMon Human-Computer Interaction 1,CSCW(2017), 1–19.\n[11] Chen Gao, Xiaochong Lan, Nian Li, Yuan Yuan, Jingtao Din g, Zhilun Zhou,\nFengli Xu, and Yong Li. 2024. Large language models empowere d agent-based\nmodeling and simulation: A survey and perspectives. Humanities and Social\nSciencesCommunications 11,1 (2024), 1–24.\n[12] AurélienGarivierandEricMoulines.2008. Onupper-co nﬁdenceboundpolicies\nfornon-stationary bandit problems. arXiv preprint arXiv:0805.3415 (2008).\n[13] Diego Gómez-Zará,ArchanDas,BradleyPawlow, and Nosh irContractor.2022.\nIn searchof diverseand connected teams:A computational ap proachto assem-\nble diverse teams based on members’ social networks. PloS one17, 11 (2022),\ne0276061.\n[14] DiegoGómez-Zará,LeslieADeChurch,andNoshirSContr actor.2020. Ataxon-\nomyofteam-assemblysystems:Understanding howpeople use technologies to\nformteams. Proceedings ofthe ACMon Human-Computer Interaction 4, CSCW2\n(2020), 1–36.\n[15] Taicheng Guo, Xiuying Chen, Yaqi Wang, Ruidi Chang, Shi chao Pei, Nitesh V\nChawla, Olaf Wiest, and Xiangliang Zhang. 2024. Large langu age model\nbased multi-agents: A survey of progress and challenges. arXiv preprint\narXiv:2402.01680 (2024).\n[16] JRichardHackmanandEdwardELawler.1971. Employeere actionstojobchar-\nacteristics. Journal ofapplied psychology 55,3(1971), 259.\n[17] HelenAiHe,NaomiYamashita,ChatWacharamanotham,An dreaBHorn,Jenny\nSchmid,andElaineMHuang.2017.Twosidestoeverystory:Mi tigatingintercul-\ntural conﬂict through automated feedback and shared self-r eﬂections in global\nvirtualteams. ProceedingsoftheACMonHuman-ComputerInteraction 1,CSCW\n(2017), 1–21.\n[18] Farnaz Jahanbakhsh, Wai-Tat Fu, Karrie Karahalios, Da rko Marinov, and Brian\nBailey.2017. You want me to workwith who? Stakeholder perce ptions of auto-\nmated team formation in project-based courses. In Proceedings of the 2017 CHIconference onhuman factorsincomputingsystems .3201–3212.\n[19] NicolasJones,ArmelleBrun,andAnneBoyer.2011.Impr ovingreliabilityofuser\npreferences:Comparinginsteadofrating.In 2011SixthInternational Conference\non Digital InformationManagement . IEEE, 316–321.\n[20] Rishabh Joshi, Varun Gupta, Xinyue Li, Yue Cui, Ziwen Wa ng, Yaser Norouz-\nzadeh Ravari,DiegoKlabjan, Rafet Sifa,Azita Parsaeian,A nders Drachen, et al.\n2019. A team based player versusplayerrecommender systems frameworkfor\nplayer improvement. In Proceedings of the Australasian Computer Science Week\nMulticonference . 1–7.\n[21] Hieke Keuning, Johan Jeuring, and Bastiaan Heeren. 201 8. A systematic litera-\nturereviewofautomatedfeedbackgenerationforprogrammi ngexercises. ACM\nTransactionson ComputingEducation (TOCE) 19,1 (2018), 1–43.\n[22] Hyeyoung Ko, Suyeon Lee, Yoonseo Park, and Anna Choi. 20 22. A survey of\nrecommendationsystems:recommendationmodels,techniqu es,andapplication\nﬁelds.Electronics 11,1(2022), 141.\n[23] SteveWJKozlowski,DanielJWatola,JaclynMJensen,Br ianHKim,andIsabelC\nBotero.2008. Developingadaptiveteams:Atheory ofdynami cteamleadership.\nInTeameﬀectiveness in complexorganizations . Routledge, 147–190.\n[24] Brenden M Lake, Tomer D Ullman, Joshua B Tenenbaum, and S amuel J Gersh-\nman. 2017. Building machines that learn and think like peopl e.Behavioral and\nbrain sciences 40(2017), e253.\n[25] Samuel Lapp, Kathryn Jablokow, and Christopher McComb . 2019. KABOOM:\nan agent-based model for simulating cognitive style in team problem solving.\nDesignScience 5 (2019), e13.\n[26] MistyLLoughry,MatthewWOhland,andDavidJWoehr.201 4. Assessingteam-\nwork skills for assuranceof learning using CATME team tools .Journal of Mar-\nketing Education 36,1 (2014), 5–19.\n[27] Judith Masthoﬀ and Isabella Saccardi. 2024. Towards au tomated feedback to\na team member on their performance. In Adjunct Proceedings of the 32nd ACM\nConference onUserModeling, Adaptation and Personalizatio n. 347–355.\n[28] Kiana Jafari Meimandi, Matthew Bolton, and Peter Belin g. 2023. RL-HAT: A\nNew Framework for Understanding Human-Agent Teaming. In Proceedings of\nthe AAAISymposium Series , Vol. 1.80–85.\n[29] DavidANadler.1979. Theeﬀectsoffeedbackontaskgrou pbehavior:Areview\nof the experimental research. Organizational Behavior and Human Performance\n23, 3(1979), 309–338.\n[30] NicoleNikiforowandSebastianWagener.2021. Thecont extualeﬀectofcomple-\ntionontheeﬀectivenessofperformancefeedback. JournalofBusinessEconomics\n91, 1(2021), 61–90.\n[31] Joon Sung Park, Joseph O’Brien, CarrieJun Cai,Meredit h Ringel Morris,Percy\nLiang, and Michael S Bernstein. 2023. Generative agents: In teractive simulacra\nof human behavior. In Proceedings of the 36th annual acm symposium on user\ninterface softwareand technology . 1–22.\n[32] Joon Sung Park, Carolyn Q Zou, Aaron Shaw, Benjamin Mako Hill, CarrieCai,\nMeredithRingelMorris,RobbWiller,PercyLiang,andMicha elSBernstein.2024.\nGenerative agent simulations of 1,000 people. arXiv preprint arXiv:2411.10109\n(2024).\n[33] WilliamRandandChristianStummer.2021. Agent-based modelingofnewprod-\nuct marketdiﬀusion: anoverviewof strengths and criticism s.Annals of Opera-\ntionsResearch 305,1 (2021), 425–447.\n[34] Paul Resnick, Neophytos Iacovou, Mitesh Suchak, Peter Bergstrom, and John\nRiedl. 1994. Grouplens: An open architecture for collabora tive ﬁltering of net-\nnews. InProceedings of the 1994 ACM conference on Computer supported cooper-\native work .175–186.\n[35] Elaine Rich. 1983. Users are individuals: individuali zing user models. Interna-\ntional journal of man-machinestudies 18,3 (1983), 199–214.\n[36] Samiha Samrose, Reza Rawassizadeh, and Ehsan Hoque. 20 20. Immediate or\nreﬂective?: Eﬀects of real-timefeedback on group discussi ons over videochat.\narXiv preprintarXiv:2011.06529 (2020).\n[37] William R Thompson. 1933. On the likelihood that one unk nown probability\nexceeds another in view of the evidence of two samples. Biometrika 25, 3-4\n(1933), 285–294.\n[38] Qingyun Wu, Gagan Bansal, Jieyu Zhang, Yiran Wu, Shaoku n Zhang, Erkang\nZhu, Beibin Li, Li Jiang, Xiaoyun Zhang, and Chi Wang. 2023. A utogen: En-\nablingnext-genllmapplicationsviamulti-agentconversa tionframework. arXiv\npreprint arXiv:2308.08155 (2023).\n[39] ChongYang,XiaohuiYu,YangLiu,YanpingNie,andYuanh ongWang.2016.Col-\nlaborativeﬁltering with weighted opinion aspects. Neurocomputing 210 (2016),\n185–196.\n[40] Lingyu Zhang, Tianshu Song, Yongxin Tong, Zimu Zhou, Da nLi, Wei Ai, Lulu\nZhang,GuobinWu,YanLiu,andJiepingYe.2019. Recommendat ion-basedteam\nformationforon-demand taxi-calling platforms.In Proceedingsof the28thACM\nInternational Conference onInformation and Knowledge Man agement.59–68.\n[41] Wei Zhang, Andrea Valencia, and Ni-Bin Chang. 2021. Syn ergistic integration\nbetween machine learning and agent-based modeling: A multi disciplinary re-\nview.IEEE Transactions on Neural Networks and Learning Systems 34, 5 (2021),\n2170–2190.\n--- Page 6 ---\nUMAP ’25,June 16–19,2025,NewYork City,NY, USA Mohammed Al mutairi\n[42] SharonZhou,MelissaValentine,andMichaelSBernstei n.2018. Insearchofthe\ndream team: Temporally constrained multi-armed bandits fo r identifying eﬀec-\ntive team structures. In Proceedings of the 2018 chi conference on human factorsin computingsystems .1–13.\n--- Page 7 ---\nThis figure \"acm-jdslogo.png\" is available in \"png\"\n format from:\nhttp://arxiv.org/ps/2506.05265v1",
  "text_length": 33995
}